{
  "(empty)": "(vacío)",
  "{0}: {1}": "{0}: {1}",
  "A system error occurred ({0})": "Error del sistema ({0})",
  "An unknown error occurred. Please consult the log for more details.": "Se ha producido un error desconocido. Consulte el registro para obtener más detalles.",
  "{0} ({1} errors in total)": "{0} ({1} errores en total)",
  "Ctrl": "Ctrl",
  "Shift": "Mayús",
  "Alt": "Alt",
  "Windows": "Windows",
  "Super": "Super",
  "Control": "Control",
  "Option": "Opción",
  "Command": "Comando",
  "&&Undo": "&&Deshacer",
  "Undo": "Deshacer",
  "&&Redo": "&&Rehacer",
  "Redo": "Rehacer",
  "&&Select All": "&&Seleccionar todo",
  "Select All": "Seleccionar todo",
  "Whether the editor text has focus (cursor is blinking)": "Si el texto del editor tiene el foco (el cursor parpadea)",
  "Whether the editor or an editor widget has focus (e.g. focus is in the find widget)": "Si el editor o un widget del editor tiene el foco (por ejemplo, el foco está en el widget de búsqueda)",
  "Whether an editor or a rich text input has focus (cursor is blinking)": "Si un editor o una entrada de texto enriquecido tienen el foco (el cursor parpadea)",
  "Whether the editor is read only": "Si el editor es de solo lectura",
  "Whether the context is a diff editor": "Si el contexto es un editor de diferencias",
  "Whether `editor.columnSelection` is enabled": "Si \"editor.columnSelection\" se ha habilitado",
  "Whether the editor has text selected": "Si el editor tiene texto seleccionado",
  "Whether the editor has multiple selections": "Si el editor tiene varias selecciones",
  "Whether `Tab` will move focus out of the editor": "Si \"Tabulación\" moverá el foco fuera del editor",
  "Whether the editor hover is visible": "Si el mantenimiento del puntero del editor es visible",
  "Whether the editor is part of a larger editor (e.g. notebooks)": "Si el editor forma parte de otro más grande (por ejemplo, blocs de notas)",
  "The language identifier of the editor": "Identificador de idioma del editor",
  "Whether the editor has a completion item provider": "Si el editor tiene un proveedor de elementos de finalización",
  "Whether the editor has a code actions provider": "Si el editor tiene un proveedor de acciones de código",
  "Whether the editor has a code lens provider": "Si el editor tiene un proveedor de CodeLens",
  "Whether the editor has a definition provider": "Si el editor tiene un proveedor de definiciones",
  "Whether the editor has a declaration provider": "Si el editor tiene un proveedor de declaraciones",
  "Whether the editor has an implementation provider": "Si el editor tiene un proveedor de implementación",
  "Whether the editor has a type definition provider": "Si el editor tiene un proveedor de definiciones de tipo",
  "Whether the editor has a hover provider": "Si el editor tiene un proveedor de contenido con mantenimiento del puntero",
  "Whether the editor has a document highlight provider": "Si el editor tiene un proveedor de resaltado de documentos",
  "Whether the editor has a document symbol provider": "Si el editor tiene un proveedor de símbolos de documentos",
  "Whether the editor has a reference provider": "Si el editor tiene un proveedor de referencia",
  "Whether the editor has a rename provider": "Si el editor tiene un proveedor de cambio de nombre",
  "Whether the editor has a signature help provider": "Si el editor tiene un proveedor de ayuda de signatura",
  "Whether the editor has an inline hints provider": "Si el editor tiene un proveedor de sugerencias insertadas",
  "Whether the editor has a document formatting provider": "Si el editor tiene un proveedor de formatos de documento",
  "Whether the editor has a document selection formatting provider": "Si el editor tiene un proveedor de formatos de selección de documentos",
  "Whether the editor has multiple document formatting providers": "Si el editor tiene varios proveedores de formatos del documento",
  "Whether the editor has multiple document selection formatting providers": "Si el editor tiene varios proveedores de formato de la selección de documentos",
  "No selection": "",
  "Line {0}, Column {1} ({2} selected)": "",
  "Line {0}, Column {1}": "",
  "{0} selections ({1} characters selected)": "",
  "{0} selections": "",
  "Now changing the setting `accessibilitySupport` to 'on'.": "",
  "Now opening the Editor Accessibility documentation page.": "Abriendo la página de documentación de accesibilidad.",
  " in a read-only pane of a diff editor.": "Está en un panel de solo lectura de un editor de diferencias.",
  " in a pane of a diff editor.": "Está en un panel de un editor de diferencias.",
  " in a read-only code editor": "Está en un editor de código de solo lectura.",
  " in a code editor": "Está en un editor de código.",
  "To configure the editor to be optimized for usage with a Screen Reader press Command+E now.": "Configure la aplicación para que se optimice para su uso con un lector de pantalla (Comando+E).",
  "To configure the editor to be optimized for usage with a Screen Reader press Control+E now.": "Configure la aplicación para que se optimice para su uso con un lector de pantalla (Control+E).",
  "The editor is configured to be optimized for usage with a Screen Reader.": "La aplicación está configurada para optimizarse para su uso con un lector de pantalla.",
  "The editor is configured to never be optimized for usage with a Screen Reader, which is not the case at this time.": "La aplicación está configurada para que nunca se optimice para su uso con un lector de pantalla.",
  "Pressing Tab in the current editor will move focus to the next focusable element. Toggle this behavior by pressing {0}.": "Al presionar TAB en el editor actual, el foco se mueve al siguiente elemento activable. Active o desactive este comportamiento{0}.",
  "Pressing Tab in the current editor will move focus to the next focusable element. The command {0} is currently not triggerable by a keybinding.": "",
  "Pressing Tab in the current editor will insert the tab character. Toggle this behavior by pressing {0}.": "Al presionar TAB en el editor actual, se insertará el carácter de tabulación. Active o desactive este comportamiento{0}.",
  "Pressing Tab in the current editor will insert the tab character. The command {0} is currently not triggerable by a keybinding.": "",
  "Press Command+H now to open a browser window with more information related to editor accessibility.": "",
  "Press Control+H now to open a browser window with more information related to editor accessibility.": "",
  "You can dismiss this tooltip and return to the editor by pressing Escape or Shift+Escape.": "",
  "Show Accessibility Help": "Mostrar ayuda de accesibilidad",
  "Developer: Inspect Tokens": "Desarrollador: inspeccionar tokens",
  "Go to Line/Column...": "Vaya a Línea/Columna...",
  "Show all Quick Access Providers": "Mostrar todos los proveedores de acceso rápido",
  "Command Palette": "Paleta de comandos",
  "Show And Run Commands": "Mostrar y ejecutar comandos",
  "Go to Symbol...": "Ir a símbolo...",
  "Go to Symbol by Category...": "Ir a símbolo por categoría...",
  "Editor content": "Contenido del editor",
  "Press Alt+F1 for Accessibility Options.": "",
  "Toggle High Contrast Theme": "Alternar tema de contraste alto",
  "Made {0} edits in {1} files": "{0} ediciones realizadas en {1} archivos",
  "Stick to the end even when going to longer lines": "",
  "Removed secondary cursors": "",
  "editor": "",
  "The editor is not accessible at this time. Press {0} for options.": "",
  "The number of cursors has been limited to {0}.": "",
  "Line decoration for inserts in the diff editor.": "",
  "Line decoration for removals in the diff editor.": "",
  "Cannot compare files because one file is too large.": "",
  "Icon for 'Insert' in diff review.": "",
  "Icon for 'Remove' in diff review.": "",
  "Icon for 'Close' in diff review.": "",
  "Close": "Cerrar",
  "no lines changed": "",
  "1 line changed": "",
  "{0} lines changed": "",
  "Difference {0} of {1}: original line {2}, {3}, modified line {4}, {5}": "",
  "blank": "",
  "{0} unchanged line {1}": "",
  "{0} original line {1} modified line {2}": "",
  "+ {0} modified line {1}": "",
  "- {0} original line {1}": "",
  "Go to Next Difference": "",
  "Go to Previous Difference": "",
  "Copy deleted lines": "",
  "Copy deleted line": "",
  "Copy changed lines": "",
  "Copy changed line": "",
  "Copy deleted line ({0})": "",
  "Copy changed line ({0})": "",
  "Revert this change": "",
  "Editor": "Editor",
  "The number of spaces a tab is equal to. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.": "El número de espacios a los que equivale una tabulación. Este valor se invalida en función del contenido del archivo cuando {0} está activado.",
  "Insert spaces when pressing `Tab`. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.": "Insertar espacios al presionar \"TAB\". Este valor se invalida en función del contenido del archivo cuando {0} está activado.",
  "Controls whether `#editor.tabSize#` and `#editor.insertSpaces#` will be automatically detected when a file is opened based on the file contents.": "Controla si {0} y {1} se detectan automáticamente al abrir un archivo en función del contenido de este.",
  "Remove trailing auto inserted whitespace.": "Quitar el espacio en blanco final autoinsertado.",
  "Special handling for large files to disable certain memory intensive features.": "Manejo especial para archivos grandes para desactivar ciertas funciones de memoria intensiva.",
  "Controls whether completions should be computed based on words in the document.": "Controla si las finalizaciones se deben calcular en función de las palabras del documento y desde qué documentos se calculan.",
  "Only suggest words from the active document.": "",
  "Suggest words from all open documents of the same language.": "",
  "Suggest words from all open documents.": "",
  "Controls from which documents word based completions are computed.": "",
  "Semantic highlighting enabled for all color themes.": "El resaltado semántico está habilitado para todos los temas de color.",
  "Semantic highlighting disabled for all color themes.": "El resaltado semántico está deshabilitado para todos los temas de color.",
  "Semantic highlighting is configured by the current color theme's `semanticHighlighting` setting.": "El resaltado semántico está configurado con el valor \"semanticHighlighting\" del tema de color actual.",
  "Controls whether the semanticHighlighting is shown for the languages that support it.": "Controla si se muestra semanticHighlighting para los idiomas que lo admiten.",
  "Keep peek editors open even when double clicking their content or when hitting `Escape`.": "Mantiene abiertos los editores interactivos, incluso al hacer doble clic en su contenido o presionar \"Escape\".",
  "Lines above this length will not be tokenized for performance reasons": "Las lineas por encima de esta longitud no se tokenizarán por razones de rendimiento.",
  "Defines the bracket symbols that increase or decrease the indentation.": "Define los corchetes que aumentan o reducen la sangría.",
  "The opening bracket character or string sequence.": "Secuencia de cadena o corchete de apertura.",
  "The closing bracket character or string sequence.": "Secuencia de cadena o corchete de cierre.",
  "Defines the bracket pairs that are colorized by their nesting level if bracket pair colorization is enabled.": "Define los pares de corchetes coloreados por su nivel de anidamiento si está habilitada la coloración de par de corchetes.",
  "Timeout in milliseconds after which diff computation is cancelled. Use 0 for no timeout.": "Tiempo de espera en milisegundos después del cual se cancela el cálculo de diferencias. Utilice 0 para no usar tiempo de espera.",
  "Maximum file size in MB for which to compute diffs. Use 0 for no limit.": "Tamaño máximo de archivo en MB para el que calcular diferencias. Use 0 para no limitar.",
  "Controls whether the diff editor shows the diff side by side or inline.": "Controla si el editor de diferencias muestra las diferencias en paralelo o alineadas.",
  "When enabled, the diff editor ignores changes in leading or trailing whitespace.": "Cuando está habilitado, el editor de diferencias omite los cambios en los espacios en blanco iniciales o finales.",
  "Controls whether the diff editor shows +/- indicators for added/removed changes.": "Controla si el editor de diferencias muestra los indicadores +/- para los cambios agregados o quitados.",
  "Controls whether the editor shows CodeLens.": "Controla si el editor muestra CodeLens.",
  "Lines will never wrap.": "Las líneas no se ajustarán nunca.",
  "Lines will wrap at the viewport width.": "Las líneas se ajustarán en el ancho de la ventanilla.",
  "Lines will wrap according to the `#editor.wordWrap#` setting.": "Las líneas se ajustarán en función de la configuración de {0}.",
  "The editor will use platform APIs to detect when a Screen Reader is attached.": "Usar las API de la plataforma para detectar cuándo se conecta un lector de pantalla.",
  "The editor will be permanently optimized for usage with a Screen Reader. Word wrapping will be disabled.": "Optimizar para usar con un lector de pantalla.",
  "The editor will never be optimized for usage with a Screen Reader.": "Supongamos que no hay un lector de pantalla conectado.",
  "Controls whether the editor should run in a mode where it is optimized for screen readers. Setting to on will disable word wrapping.": "Controla si la interfaz de usuario debe ejecutarse en un modo en el que esté optimizada para lectores de pantalla.",
  "Controls whether a space character is inserted when commenting.": "Controla si se inserta un carácter de espacio al comentar.",
  "Controls if empty lines should be ignored with toggle, add or remove actions for line comments.": "Controla si las líneas vacías deben ignorarse con la opción de alternar, agregar o quitar acciones para los comentarios de línea.",
  "Controls whether copying without a selection copies the current line.": "Controla si al copiar sin selección se copia la línea actual.",
  "Controls whether the cursor should jump to find matches while typing.": "Controla si el cursor debe saltar para buscar coincidencias mientras se escribe.",
  "Never seed search string from the editor selection.": "Nunca inicializar la cadena de búsqueda desde la selección del editor.",
  "Always seed search string from the editor selection, including word at cursor position.": "Siempre inicializar la cadena de búsqueda desde la selección del editor, incluida la palabra en la posición del cursor.",
  "Only seed search string from the editor selection.": "Solo inicializar la cadena de búsqueda desde la selección del editor.",
  "Controls whether the search string in the Find Widget is seeded from the editor selection.": "Controla si la cadena de búsqueda del widget de búsqueda se inicializa desde la selección del editor.",
  "Never turn on Find in Selection automatically (default).": "No activar nunca Buscar en selección automáticamente (predeterminado).",
  "Always turn on Find in Selection automatically.": "Activar siempre Buscar en selección automáticamente.",
  "Turn on Find in Selection automatically when multiple lines of content are selected.": "Activar Buscar en la selección automáticamente cuando se seleccionen varias líneas de contenido.",
  "Controls the condition for turning on Find in Selection automatically.": "Controla la condición para activar la búsqueda en la selección de forma automática.",
  "Controls whether the Find Widget should read or modify the shared find clipboard on macOS.": "Controla si el widget de búsqueda debe leer o modificar el Portapapeles de búsqueda compartido en macOS.",
  "Controls whether the Find Widget should add extra lines on top of the editor. When true, you can scroll beyond the first line when the Find Widget is visible.": "Controla si Encontrar widget debe agregar más líneas en la parte superior del editor. Si es true, puede desplazarse más allá de la primera línea cuando Encontrar widget está visible.",
  "Controls whether the search automatically restarts from the beginning (or the end) when no further matches can be found.": "Controla si la búsqueda se reinicia automáticamente desde el principio (o el final) cuando no se encuentran más coincidencias.",
  "Enables/Disables font ligatures ('calt' and 'liga' font features). Change this to a string for fine-grained control of the 'font-feature-settings' CSS property.": "Habilita o deshabilita las ligaduras tipográficas (características de fuente \"calt\" y \"liga\"). Cámbielo a una cadena para el control específico de la propiedad de CSS \"font-feature-settings\".",
  "Explicit 'font-feature-settings' CSS property. A boolean can be passed instead if one only needs to turn on/off ligatures.": "Propiedad de CSS \"font-feature-settings\" explícita. En su lugar, puede pasarse un valor booleano si solo es necesario activar o desactivar las ligaduras.",
  "Configures font ligatures or font features. Can be either a boolean to enable/disable ligatures or a string for the value of the CSS 'font-feature-settings' property.": "Configura las ligaduras tipográficas o las características de fuente. Puede ser un valor booleano para habilitar o deshabilitar las ligaduras o bien una cadena para el valor de la propiedad \"font-feature-settings\" de CSS.",
  "Controls the font size in pixels.": "Controla el tamaño de fuente en píxeles.",
  "Only \"normal\" and \"bold\" keywords or numbers between 1 and 1000 are allowed.": "Solo se permiten las palabras clave \"normal\" y \"negrita\" o los números entre 1 y 1000.",
  "Controls the font weight. Accepts \"normal\" and \"bold\" keywords or numbers between 1 and 1000.": "Controla el grosor de la fuente. Acepta las palabras clave \"normal\" y \"negrita\" o los números entre 1 y 1000.",
  "Show peek view of the results (default)": "Mostrar vista de inspección de los resultados (predeterminado)",
  "Go to the primary result and show a peek view": "Ir al resultado principal y mostrar una vista de inspección",
  "Go to the primary result and enable peek-less navigation to others": "Vaya al resultado principal y habilite la navegación sin peek para otros",
  "This setting is deprecated, please use separate settings like 'editor.editor.gotoLocation.multipleDefinitions' or 'editor.editor.gotoLocation.multipleImplementations' instead.": "Esta configuración está en desuso. Use configuraciones separadas como \"editor.editor.gotoLocation.multipleDefinitions\" o \"editor.editor.gotoLocation.multipleImplementations\" en su lugar.",
  "Controls the behavior the 'Go to Definition'-command when multiple target locations exist.": "Controla el comportamiento del comando \"Ir a definición\" cuando existen varias ubicaciones de destino.",
  "Controls the behavior the 'Go to Type Definition'-command when multiple target locations exist.": "Controla el comportamiento del comando \"Ir a definición de tipo\" cuando existen varias ubicaciones de destino.",
  "Controls the behavior the 'Go to Declaration'-command when multiple target locations exist.": "Controla el comportamiento del comando \"Ir a declaración\" cuando existen varias ubicaciones de destino.",
  "Controls the behavior the 'Go to Implementations'-command when multiple target locations exist.": "Controla el comportamiento del comando \"Ir a implementaciones\" cuando existen varias ubicaciones de destino.",
  "Controls the behavior the 'Go to References'-command when multiple target locations exist.": "Controla el comportamiento del comando \"Ir a referencias\" cuando existen varias ubicaciones de destino.",
  "Alternative command id that is being executed when the result of 'Go to Definition' is the current location.": "Identificador de comando alternativo que se ejecuta cuando el resultado de \"Ir a definición\" es la ubicación actual.",
  "Alternative command id that is being executed when the result of 'Go to Type Definition' is the current location.": "Id. de comando alternativo que se está ejecutando cuando el resultado de \"Ir a definición de tipo\" es la ubicación actual.",
  "Alternative command id that is being executed when the result of 'Go to Declaration' is the current location.": "Id. de comando alternativo que se está ejecutando cuando el resultado de \"Ir a declaración\" es la ubicación actual.",
  "Alternative command id that is being executed when the result of 'Go to Implementation' is the current location.": "Id. de comando alternativo que se está ejecutando cuando el resultado de \"Ir a implementación\" es la ubicación actual.",
  "Alternative command id that is being executed when the result of 'Go to Reference' is the current location.": "Identificador de comando alternativo que se ejecuta cuando el resultado de \"Ir a referencia\" es la ubicación actual.",
  "Controls whether the hover is shown.": "Controla si se muestra la información al mantener el puntero sobre un elemento.",
  "Controls the delay in milliseconds after which the hover is shown.": "Controla el retardo en milisegundos después del cual se muestra la información al mantener el puntero sobre un elemento.",
  "Controls whether the hover should remain visible when mouse is moved over it.": "Controla si la información que aparece al mantener el puntero sobre un elemento permanece visible al mover el mouse sobre este.",
  "Prefer showing hovers above the line, if there's space.": "Preferir mostrar los desplazamientos por encima de la línea, si hay espacio.",
  "Enables the code action lightbulb in the editor.": "",
  "Enables the inlay hints in the editor.": "Habilita las sugerencias de incrustación en el editor.",
  "Controls font size of inlay hints in the editor. A default of 90% of `#editor.fontSize#` is used when the configured value is less than `5` or greater than the editor font size.": "Controla el tamaño de fuente de las sugerencias de incrustación en el editor. Como valor predeterminado, se usa {0} cuando el valor configurado es menor que {1} o mayor que el tamaño de fuente del editor.",
  "Controls font family of inlay hints in the editor. When set to empty, the `#editor.fontFamily#` is used.": "Controla la familia de fuentes de sugerencias de incrustación en el editor. Cuando se establece en vacío, se usa el {0}.",
  "Controls the line height. \n - Use 0 to automatically compute the line height from the font size.\n - Values between 0 and 8 will be used as a multiplier with the font size.\n - Values greater than or equal to 8 will be used as effective values.": "Controla el alto de línea. \r\n - Use 0 para calcular automáticamente el alto de línea a partir del tamaño de la fuente.\r\n - Los valores entre 0 y 8 se usarán como multiplicador con el tamaño de fuente.\r\n - Los valores mayores o igual que 8 se usarán como valores efectivos.",
  "Controls whether the minimap is shown.": "Controla si se muestra el minimapa.",
  "The minimap has the same size as the editor contents (and might scroll).": "El minimapa tiene el mismo tamaño que el contenido del editor (y podría desplazarse).",
  "The minimap will stretch or shrink as necessary to fill the height of the editor (no scrolling).": "El minimapa se estirará o reducirá según sea necesario para ocupar la altura del editor (sin desplazamiento).",
  "The minimap will shrink as necessary to never be larger than the editor (no scrolling).": "El minimapa se reducirá según sea necesario para no ser nunca más grande que el editor (sin desplazamiento).",
  "Controls the size of the minimap.": "Controla el tamaño del minimapa.",
  "Controls the side where to render the minimap.": "Controla en qué lado se muestra el minimapa.",
  "Controls when the minimap slider is shown.": "Controla cuándo se muestra el control deslizante del minimapa.",
  "Scale of content drawn in the minimap: 1, 2 or 3.": "Escala del contenido dibujado en el minimapa: 1, 2 o 3.",
  "Render the actual characters on a line as opposed to color blocks.": "Represente los caracteres reales en una línea, por oposición a los bloques de color.",
  "Limit the width of the minimap to render at most a certain number of columns.": "Limite el ancho del minimapa para representar como mucho un número de columnas determinado.",
  "Controls the amount of space between the top edge of the editor and the first line.": "Controla la cantidad de espacio entre el borde superior del editor y la primera línea.",
  "Controls the amount of space between the bottom edge of the editor and the last line.": "Controla el espacio entre el borde inferior del editor y la última línea.",
  "Enables a pop-up that shows parameter documentation and type information as you type.": "Habilita un elemento emergente que muestra documentación de los parámetros e información de los tipos mientras escribe.",
  "Controls whether the parameter hints menu cycles or closes when reaching the end of the list.": "Controla si el menú de sugerencias de parámetros se cicla o se cierra al llegar al final de la lista.",
  "Enable quick suggestions inside strings.": "Habilita sugerencias rápidas en las cadenas.",
  "Enable quick suggestions inside comments.": "Habilita sugerencias rápidas en los comentarios.",
  "Enable quick suggestions outside of strings and comments.": "Habilita sugerencias rápidas fuera de las cadenas y los comentarios.",
  "Controls whether suggestions should automatically show up while typing.": "Controla si las sugerencias deben mostrarse automáticamente al escribir. Puede controlarse para la escritura en comentarios, cadenas y otro código. Las sugerencias rápidas pueden configurarse para mostrarse como texto fantasma o con el widget de sugerencias. Tenga en cuenta también la configuración de {0} que controla si los caracteres especiales desencadenan las sugerencias.",
  "Line numbers are not rendered.": "Los números de línea no se muestran.",
  "Line numbers are rendered as absolute number.": "Los números de línea se muestran como un número absoluto.",
  "Line numbers are rendered as distance in lines to cursor position.": "Los números de línea se muestran como distancia en líneas a la posición del cursor.",
  "Line numbers are rendered every 10 lines.": "Los números de línea se muestran cada 10 líneas.",
  "Controls the display of line numbers.": "Controla la visualización de los números de línea.",
  "Number of monospace characters at which this editor ruler will render.": "Número de caracteres monoespaciales en los que se representará esta regla del editor.",
  "Color of this editor ruler.": "Color de esta regla del editor.",
  "Render vertical rulers after a certain number of monospace characters. Use multiple values for multiple rulers. No rulers are drawn if array is empty.": "Muestra reglas verticales después de un cierto número de caracteres monoespaciados. Usa múltiples valores para mostrar múltiples reglas. Si la matriz está vacía, no se muestran reglas.",
  "The vertical scrollbar will be visible only when necessary.": "La barra de desplazamiento vertical estará visible solo cuando sea necesario.",
  "The vertical scrollbar will always be visible.": "La barra de desplazamiento vertical estará siempre visible.",
  "The vertical scrollbar will always be hidden.": "La barra de desplazamiento vertical estará siempre oculta.",
  "Controls the visibility of the vertical scrollbar.": "Controla la visibilidad de la barra de desplazamiento vertical.",
  "The horizontal scrollbar will be visible only when necessary.": "La barra de desplazamiento horizontal estará visible solo cuando sea necesario.",
  "The horizontal scrollbar will always be visible.": "La barra de desplazamiento horizontal estará siempre visible.",
  "The horizontal scrollbar will always be hidden.": "La barra de desplazamiento horizontal estará siempre oculta.",
  "Controls the visibility of the horizontal scrollbar.": "Controla la visibilidad de la barra de desplazamiento horizontal.",
  "The width of the vertical scrollbar.": "Ancho de la barra de desplazamiento vertical.",
  "The height of the horizontal scrollbar.": "Altura de la barra de desplazamiento horizontal.",
  "Controls whether clicks scroll by page or jump to click position.": "Controla si al hacer clic se desplaza por página o salta a la posición donde se hace clic.",
  "Controls whether all non-basic ASCII characters are highlighted. Only characters between U+0020 and U+007E, tab, line-feed and carriage-return are considered basic ASCII.": "Controla si se resaltan todos los caracteres ASCII no básicos. Solo los caracteres entre U+0020 y U+007E, tabulación, avance de línea y retorno de carro se consideran ASCII básicos.",
  "Controls whether characters that just reserve space or have no width at all are highlighted.": "Controla si se resaltan los caracteres que solo reservan espacio o que no tienen ancho.",
  "Controls whether characters are highlighted that can be confused with basic ASCII characters, except those that are common in the current user locale.": "Controla si se resaltan caracteres que se pueden confundir con caracteres ASCII básicos, excepto los que son comunes en la configuración regional del usuario actual.",
  "Controls whether characters in comments should also be subject to unicode highlighting.": "Controla si los caracteres de los comentarios también deben estar sujetos al resaltado Unicode.",
  "Controls whether characters in strings should also be subject to unicode highlighting.": "Controla si los caracteres de las cadenas también deben estar sujetos al resaltado Unicode.",
  "Defines allowed characters that are not being highlighted.": "Define los caracteres permitidos que no se resaltan.",
  "Unicode characters that are common in allowed locales are not being highlighted.": "Los caracteres Unicode que son comunes en las configuraciones regionales permitidas no se resaltan.",
  "Controls whether to automatically show inline suggestions in the editor.": "Controla si se deben mostrar automáticamente las sugerencias alineadas en el editor.",
  "Controls whether bracket pair colorization is enabled or not. Use 'workbench.colorCustomizations' to override the bracket highlight colors.": "Controla si está habilitada o no la coloración de pares de corchetes. Use {0} para invalidar los colores de resaltado de corchete.",
  "Enables bracket pair guides.": "Habilita guías de par de corchetes.",
  "Enables bracket pair guides only for the active bracket pair.": "Habilita guías de par de corchetes solo para el par de corchetes activo.",
  "Disables bracket pair guides.": "Deshabilita las guías de par de corchetes.",
  "Controls whether bracket pair guides are enabled or not.": "Controla si el editor debe resaltar el par de corchetes activo.",
  "Enables horizontal guides as addition to vertical bracket pair guides.": "Habilita guías horizontales como adición a guías de par de corchetes verticales.",
  "Enables horizontal guides only for the active bracket pair.": "Habilita guías horizontales solo para el par de corchetes activo.",
  "Disables horizontal bracket pair guides.": "Deshabilita las guías de par de corchetes horizontales.",
  "Controls whether horizontal bracket pair guides are enabled or not.": "Controla si están habilitadas las guías de pares de corchetes horizontales.",
  "Controls whether the editor should render indent guides.": "Controla si el editor debe representar guías de sangría.",
  "Controls whether the editor should highlight the active indent guide.": "Controla si el editor debe resaltar la guía de sangría activa.",
  "Insert suggestion without overwriting text right of the cursor.": "Inserte la sugerencia sin sobrescribir el texto a la derecha del cursor.",
  "Insert suggestion and overwrite text right of the cursor.": "Inserte la sugerencia y sobrescriba el texto a la derecha del cursor.",
  "Controls whether words are overwritten when accepting completions. Note that this depends on extensions opting into this feature.": "Controla si las palabras se sobrescriben al aceptar la finalización. Tenga en cuenta que esto depende de las extensiones que participan en esta característica.",
  "Controls whether filtering and sorting suggestions accounts for small typos.": "Controla si el filtrado y la ordenación de sugerencias se tienen en cuenta para los errores ortográficos pequeños.",
  "Controls whether sorting favors words that appear close to the cursor.": "Controla si la ordenación mejora las palabras que aparecen cerca del cursor.",
  "Controls whether remembered suggestion selections are shared between multiple workspaces and windows (needs `#editor.suggestSelection#`).": "Controla si las selecciones de sugerencias recordadas se comparten entre múltiples áreas de trabajo y ventanas (necesita \"#editor.suggestSelection#\").",
  "Controls whether an active snippet prevents quick suggestions.": "Controla si un fragmento de código activo impide sugerencias rápidas.",
  "Controls whether to show or hide icons in suggestions.": "Controla si mostrar u ocultar iconos en sugerencias.",
  "Controls the visibility of the status bar at the bottom of the suggest widget.": "Controla la visibilidad de la barra de estado en la parte inferior del widget de sugerencias.",
  "Controls whether to preview the suggestion outcome in the editor.": "Controla si se puede obtener una vista previa del resultado de la sugerencia en el editor.",
  "Controls whether suggest details show inline with the label or only in the details widget": "Controla si los detalles de sugerencia se muestran incorporados con la etiqueta o solo en el widget de detalles.",
  "This setting is deprecated. The suggest widget can now be resized.": "La configuración está en desuso. Ahora puede cambiarse el tamaño del widget de sugerencias.",
  "This setting is deprecated, please use separate settings like 'editor.suggest.showKeywords' or 'editor.suggest.showSnippets' instead.": "Esta configuración está en desuso. Use configuraciones separadas como \"editor.suggest.showKeyword\" o \"editor.suggest.showSnippets\" en su lugar.",
  "When enabled IntelliSense shows `method`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"method\".",
  "When enabled IntelliSense shows `function`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de \"función\".",
  "When enabled IntelliSense shows `constructor`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"constructor\".",
  "When enabled IntelliSense shows `deprecated`-suggestions.": "Cuando se activa IntelliSense muestra sugerencias \"obsoletas\".",
  "When enabled IntelliSense shows `field`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"field\".",
  "When enabled IntelliSense shows `variable`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"variable\".",
  "When enabled IntelliSense shows `class`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"class\".",
  "When enabled IntelliSense shows `struct`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"struct\".",
  "When enabled IntelliSense shows `interface`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"interface\".",
  "When enabled IntelliSense shows `module`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"module\".",
  "When enabled IntelliSense shows `property`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"property\".",
  "When enabled IntelliSense shows `event`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"event\".",
  "When enabled IntelliSense shows `operator`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"operator\".",
  "When enabled IntelliSense shows `unit`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"unit\".",
  "When enabled IntelliSense shows `value`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de \"value\".",
  "When enabled IntelliSense shows `constant`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"constant\".",
  "When enabled IntelliSense shows `enum`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"enum\".",
  "When enabled IntelliSense shows `enumMember`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"enumMember\".",
  "When enabled IntelliSense shows `keyword`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"keyword\".",
  "When enabled IntelliSense shows `text`-suggestions.": "Si está habilitado, IntelliSense muestra sugerencias de tipo \"text\".",
  "When enabled IntelliSense shows `color`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de \"color\".",
  "When enabled IntelliSense shows `file`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"file\".",
  "When enabled IntelliSense shows `reference`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"reference\".",
  "When enabled IntelliSense shows `customcolor`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"customcolor\".",
  "When enabled IntelliSense shows `folder`-suggestions.": "Si está habilitado, IntelliSense muestra sugerencias de tipo \"folder\".",
  "When enabled IntelliSense shows `typeParameter`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"typeParameter\".",
  "When enabled IntelliSense shows `snippet`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias de tipo \"snippet\".",
  "When enabled IntelliSense shows `user`-suggestions.": "Cuando está habilitado, IntelliSense muestra sugerencias del usuario.",
  "When enabled IntelliSense shows `issues`-suggestions.": "Cuando está habilitado IntelliSense muestra sugerencias para problemas.",
  "Whether leading and trailing whitespace should always be selected.": "Indica si los espacios en blanco iniciales y finales deben seleccionarse siempre.",
  "Controls whether suggestions should be accepted on commit characters. For example, in JavaScript, the semi-colon (`;`) can be a commit character that accepts a suggestion and types that character.": "Controla si se deben aceptar sugerencias en los caracteres de confirmación. Por ejemplo, en Javascript, el punto y coma (\";\") puede ser un carácter de confirmación que acepta una sugerencia y escribe ese carácter.",
  "Only accept a suggestion with `Enter` when it makes a textual change.": "Aceptar solo una sugerencia con \"Entrar\" cuando realiza un cambio textual.",
  "Controls whether suggestions should be accepted on `Enter`, in addition to `Tab`. Helps to avoid ambiguity between inserting new lines or accepting suggestions.": "Controla si las sugerencias deben aceptarse con \"Entrar\", además de \"TAB\". Ayuda a evitar la ambigüedad entre insertar nuevas líneas o aceptar sugerencias.",
  "Controls the number of lines in the editor that can be read out by a screen reader at once. When we detect a screen reader we automatically set the default to be 500. Warning: this has a performance implication for numbers larger than the default.": "Controla el número de líneas del editor que pueden ser leídas por un lector de pantalla a la vez. Cuando detectamos un lector de pantalla, fijamos automáticamente el valor por defecto en 500. Advertencia: esto tiene una implicación de rendimiento para números mayores que el predeterminado.",
  "Use language configurations to determine when to autoclose brackets.": "Utilizar las configuraciones del lenguaje para determinar cuándo cerrar los corchetes automáticamente.",
  "Autoclose brackets only when the cursor is to the left of whitespace.": "Cerrar automáticamente los corchetes cuando el cursor esté a la izquierda de un espacio en blanco.",
  "Controls whether the editor should automatically close brackets after the user adds an opening bracket.": "Controla si el editor debe cerrar automáticamente los corchetes después de que el usuario agregue un corchete de apertura.",
  "Remove adjacent closing quotes or brackets only if they were automatically inserted.": "Quite los corchetes o las comillas de cierre adyacentes solo si se insertaron automáticamente.",
  "Controls whether the editor should remove adjacent closing quotes or brackets when deleting.": "Controla si el editor debe quitar los corchetes o las comillas de cierre adyacentes al eliminar.",
  "Type over closing quotes or brackets only if they were automatically inserted.": "Escriba en las comillas o los corchetes solo si se insertaron automáticamente.",
  "Controls whether the editor should type over closing quotes or brackets.": "Controla si el editor debe escribir entre comillas o corchetes.",
  "Use language configurations to determine when to autoclose quotes.": "Utilizar las configuraciones del lenguaje para determinar cuándo cerrar las comillas automáticamente. ",
  "Autoclose quotes only when the cursor is to the left of whitespace.": "Cerrar automáticamente las comillas cuando el cursor esté a la izquierda de un espacio en blanco. ",
  "Controls whether the editor should automatically close quotes after the user adds an opening quote.": "Controla si el editor debe cerrar automáticamente las comillas después de que el usuario agrega uma comilla de apertura.",
  "The editor will not insert indentation automatically.": "El editor no insertará la sangría automáticamente.",
  "The editor will keep the current line's indentation.": "El editor mantendrá la sangría de la línea actual.",
  "The editor will keep the current line's indentation and honor language defined brackets.": "El editor respetará la sangría de la línea actual y los corchetes definidos por el idioma.",
  "The editor will keep the current line's indentation, honor language defined brackets and invoke special onEnterRules defined by languages.": "El editor mantendrá la sangría de la línea actual, respetará los corchetes definidos por el idioma e invocará onEnterRules especiales definidos por idiomas.",
  "The editor will keep the current line's indentation, honor language defined brackets, invoke special onEnterRules defined by languages, and honor indentationRules defined by languages.": "El editor respetará la sangría de la línea actual, los corchetes definidos por idiomas y las reglas indentationRules definidas por idiomas, además de invocar reglas onEnterRules especiales.",
  "Controls whether the editor should automatically adjust the indentation when users type, paste, move or indent lines.": "Controla si el editor debe ajustar automáticamente la sangría mientras los usuarios escriben, pegan, mueven o sangran líneas.",
  "Use language configurations to determine when to automatically surround selections.": "Use las configuraciones de idioma para determinar cuándo delimitar las selecciones automáticamente.",
  "Surround with quotes but not brackets.": "Envolver con comillas, pero no con corchetes.",
  "Surround with brackets but not quotes.": "Envolver con corchetes, pero no con comillas.",
  "Controls whether the editor should automatically surround selections when typing quotes or brackets.": "Controla si el editor debe rodear automáticamente las selecciones al escribir comillas o corchetes.",
  "Emulate selection behavior of tab characters when using spaces for indentation. Selection will stick to tab stops.": "Emula el comportamiento de selección de los caracteres de tabulación al usar espacios para la sangría. La selección se aplicará a las tabulaciones.",
  "Controls the font family for CodeLens.": "Controla la familia de fuentes para CodeLens.",
  "Controls the font size in pixels for CodeLens. When set to `0`, 90% of `#editor.fontSize#` is used.": "Controla el tamaño de fuente de CodeLens en píxeles. Cuando se establece en 0, se usa el 90 % de \"#editor.fontSize#\".",
  "Controls whether the editor should render the inline color decorators and color picker.": "Controla si el editor debe representar el Selector de colores y los elementos Decorator de color en línea.",
  "Enable that the selection with the mouse and keys is doing column selection.": "Habilite que la selección con el mouse y las teclas esté realizando la selección de columnas.",
  "Controls whether syntax highlighting should be copied into the clipboard.": "Controla si el resaltado de sintaxis debe ser copiado al portapapeles.",
  "Control the cursor animation style.": "Controla el estilo de animación del cursor.",
  "Controls whether the smooth caret animation should be enabled.": "Controla si la animación suave del cursor debe estar habilitada.",
  "Controls the cursor style.": "Controla el estilo del cursor.",
  "Controls the minimal number of visible leading and trailing lines surrounding the cursor. Known as 'scrollOff' or 'scrollOffset' in some other editors.": "Controla el número mínimo de líneas iniciales visibles (mínimo 0) y líneas finales (mínimo 1) que rodean el cursor. Se conoce como \"scrollOff\" o \"scrollOffset\" en otros editores.",
  "`cursorSurroundingLines` is enforced only when triggered via the keyboard or API.": "Solo se aplica \"cursorSurroundingLines\" cuando se desencadena mediante el teclado o la API.",
  "`cursorSurroundingLines` is enforced always.": "\"cursorSurroundingLines\" se aplica siempre.",
  "Controls when `cursorSurroundingLines` should be enforced.": "Controla cuándo se debe aplicar '#editor.cursorSurroundingLines#'.",
  "Controls the width of the cursor when `#editor.cursorStyle#` is set to `line`.": "Controla el ancho del cursor cuando \"#editor.cursorStyle#\" se establece en \"line\".",
  "Controls whether the editor should allow moving selections via drag and drop.": "Controla si el editor debe permitir mover las selecciones mediante arrastrar y colocar.",
  "Scrolling speed multiplier when pressing `Alt`.": "Multiplicador de la velocidad de desplazamiento al presionar \"Alt\".",
  "Controls whether the editor has code folding enabled.": "Controla si el editor tiene el plegado de código habilitado.",
  "Use a language-specific folding strategy if available, else the indentation-based one.": "Utilice una estrategia de plegado específica del idioma, si está disponible, de lo contrario la basada en sangría.",
  "Use the indentation-based folding strategy.": "Utilice la estrategia de plegado basada en sangría.",
  "Controls the strategy for computing folding ranges.": "Controla la estrategia para calcular rangos de plegado.",
  "Controls whether the editor should highlight folded ranges.": "Controla si el editor debe destacar los rangos plegados.",
  "Controls whether the editor automatically collapses import ranges.": "Permite controlar si el editor contrae automáticamente los rangos de importación.",
  "The maximum number of foldable regions. Increasing this value may result in the editor becoming less responsive when the current source has a large number of foldable regions.": "Número máximo de regiones plegables. Si aumenta este valor, es posible que el editor tenga menos capacidad de respuesta cuando el origen actual tiene un gran número de regiones plegables.",
  "Controls whether clicking on the empty content after a folded line will unfold the line.": "Controla si al hacer clic en el contenido vacío después de una línea plegada se desplegará la línea.",
  "Controls the font family.": "Controla la familia de fuentes.",
  "Controls whether the editor should automatically format the pasted content. A formatter must be available and the formatter should be able to format a range in a document.": "Controla si el editor debe dar formato automáticamente al contenido pegado. Debe haber disponible un formateador capaz de aplicar formato a un rango dentro de un documento. ",
  "Controls whether the editor should automatically format the line after typing.": "Controla si el editor debe dar formato a la línea automáticamente después de escribirla.",
  "Controls whether the editor should render the vertical glyph margin. Glyph margin is mostly used for debugging.": "Controla si el editor debe representar el margen de glifo vertical. El margen de glifo se usa, principalmente, para depuración.",
  "Controls whether the cursor should be hidden in the overview ruler.": "Controla si el cursor debe ocultarse en la regla de información general.",
  "Controls the letter spacing in pixels.": "Controla el espacio entre letras en píxeles.",
  "Controls whether the editor has linked editing enabled. Depending on the language, related symbols, e.g. HTML tags, are updated while editing.": "Controla si el editor tiene habilitada la edición vinculada. Dependiendo del lenguaje, los símbolos relacionados (por ejemplo, las etiquetas HTML) se actualizan durante la edición.",
  "Controls whether the editor should detect links and make them clickable.": "Controla si el editor debe detectar vínculos y hacerlos interactivos.",
  "Highlight matching brackets.": "Resaltar paréntesis coincidentes.",
  "A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events.": "Se usará un multiplicador en los eventos de desplazamiento de la rueda del mouse \"deltaX\" y \"deltaY\". ",
  "Zoom the font of the editor when using mouse wheel and holding `Ctrl`.": "Ampliar la fuente del editor cuando se use la rueda del mouse mientras se presiona \"Ctrl\".",
  "Merge multiple cursors when they are overlapping.": "Combinar varios cursores cuando se solapan.",
  "Maps to `Control` on Windows and Linux and to `Command` on macOS.": "Se asigna a \"Control\" en Windows y Linux y a \"Comando\" en macOS.",
  "Maps to `Alt` on Windows and Linux and to `Option` on macOS.": "Se asigna a \"Alt\" en Windows y Linux y a \"Opción\" en macOS.",
  "The modifier to be used to add multiple cursors with the mouse. The Go to Definition and Open Link mouse gestures will adapt such that they do not conflict with the multicursor modifier. [Read more](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).": "El modificador que se usará para agregar varios cursores con el mouse. Los gestos del mouse Ir a definición y Abrir vínculo se adaptarán de modo que no entren en conflicto con el [modificador multicursor](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).",
  "Each cursor pastes a single line of the text.": "Cada cursor pega una única línea del texto.",
  "Each cursor pastes the full text.": "Cada cursor pega el texto completo.",
  "Controls pasting when the line count of the pasted text matches the cursor count.": "Controla el pegado cuando el recuento de líneas del texto pegado coincide con el recuento de cursores.",
  "Controls whether the editor should highlight semantic symbol occurrences.": "Controla si las repeticiones deben resaltarse en los archivos abiertos.",
  "Controls whether a border should be drawn around the overview ruler.": "Controla si debe dibujarse un borde alrededor de la regla de información general.",
  "Focus the tree when opening peek": "Enfocar el árbol al abrir la inspección",
  "Focus the editor when opening peek": "Enfocar el editor al abrir la inspección",
  "Controls whether to focus the inline editor or the tree in the peek widget.": "Controla si se debe enfocar el editor en línea o el árbol en el widget de vista.",
  "Controls whether the Go to Definition mouse gesture always opens the peek widget.": "Controla si el gesto del mouse Ir a definición siempre abre el widget interactivo.",
  "Controls the delay in milliseconds after which quick suggestions will show up.": "Controla el retraso, en milisegundos, tras el cual aparecerán sugerencias rápidas.",
  "Controls whether the editor auto renames on type.": "Controla si el editor cambia el nombre automáticamente en el tipo.",
  "Deprecated, use `editor.linkedEditing` instead.": "En desuso. Utilice \"editor.linkedEditing\" en su lugar.",
  "Controls whether the editor should render control characters.": "Controla si el editor debe representar caracteres de control.",
  "Render last line number when the file ends with a newline.": "Representar el número de la última línea cuando el archivo termina con un salto de línea.",
  "Highlights both the gutter and the current line.": "Resalta el medianil y la línea actual.",
  "Controls how the editor should render the current line highlight.": "Controla cómo debe representar el editor el resaltado de línea actual.",
  "Controls if the editor should render the current line highlight only when the editor is focused.": "Controla si el editor debe representar el resaltado de la línea actual solo cuando el editor está enfocado.",
  "Render whitespace characters except for single spaces between words.": "Representa caracteres de espacio en blanco, excepto los espacios individuales entre palabras.",
  "Render whitespace characters only on selected text.": "Represente los caracteres de espacio en blanco solo en el texto seleccionado.",
  "Render only trailing whitespace characters.": "Representa solo los caracteres de espacio en blanco al final.",
  "Controls how the editor should render whitespace characters.": "Controla la forma en que el editor debe representar los caracteres de espacio en blanco.",
  "Controls whether selections should have rounded corners.": "Controla si las selecciones deberían tener las esquinas redondeadas.",
  "Controls the number of extra characters beyond which the editor will scroll horizontally.": "Controla el número de caracteres adicionales a partir del cual el editor se desplazará horizontalmente.",
  "Controls whether the editor will scroll beyond the last line.": "Controla si el editor seguirá haciendo scroll después de la última línea.",
  "Scroll only along the predominant axis when scrolling both vertically and horizontally at the same time. Prevents horizontal drift when scrolling vertically on a trackpad.": "Desplácese solo a lo largo del eje predominante cuando se desplace vertical y horizontalmente al mismo tiempo. Evita la deriva horizontal cuando se desplaza verticalmente en un trackpad.",
  "Controls whether the Linux primary clipboard should be supported.": "Controla si el portapapeles principal de Linux debe admitirse.",
  "Controls whether the editor should highlight matches similar to the selection.": "Controla si el editor debe destacar las coincidencias similares a la selección.",
  "Always show the folding controls.": "Mostrar siempre los controles de plegado.",
  "Only show the folding controls when the mouse is over the gutter.": "Mostrar solo los controles de plegado cuando el mouse está sobre el medianil.",
  "Controls when the folding controls on the gutter are shown.": "Controla cuándo se muestran los controles de plegado en el medianil.",
  "Controls fading out of unused code.": "Controla el fundido de salida del código no usado.",
  "Controls strikethrough deprecated variables.": "Controla las variables en desuso tachadas.",
  "Show snippet suggestions on top of other suggestions.": "Mostrar sugerencias de fragmentos de código por encima de otras sugerencias.",
  "Show snippet suggestions below other suggestions.": "Mostrar sugerencias de fragmentos de código por debajo de otras sugerencias.",
  "Show snippets suggestions with other suggestions.": "Mostrar sugerencias de fragmentos de código con otras sugerencias.",
  "Do not show snippet suggestions.": "No mostrar sugerencias de fragmentos de código.",
  "Controls whether snippets are shown with other suggestions and how they are sorted.": "Controla si se muestran los fragmentos de código con otras sugerencias y cómo se ordenan.",
  "Controls whether the editor will scroll using an animation.": "Controla si el editor se desplazará con una animación.",
  "Font size for the suggest widget. When set to `0`, the value of `#editor.fontSize#` is used.": "Tamaño de fuente del widget de sugerencias. Cuando se establece en {0}, se usa el valor de {1}.",
  "Line height for the suggest widget. When set to `0`, the value of `#editor.lineHeight#` is used. The minimum value is 8.": "Alto de línea para el widget de sugerencias. Cuando se establece en {0}, se usa el valor de {1}. El valor mínimo es 8.",
  "Controls whether suggestions should automatically show up when typing trigger characters.": "Controla si deben aparecer sugerencias de forma automática al escribir caracteres desencadenadores.",
  "Always select the first suggestion.": "Seleccionar siempre la primera sugerencia.",
  "Select recent suggestions unless further typing selects one, e.g. `console.| -> console.log` because `log` has been completed recently.": "Seleccione sugerencias recientes a menos que al escribir más se seleccione una, por ejemplo, \"console.| -> console.log\" porque \"log\" se ha completado recientemente.",
  "Select suggestions based on previous prefixes that have completed those suggestions, e.g. `co -> console` and `con -> const`.": "Seleccione sugerencias basadas en prefijos anteriores que han completado esas sugerencias, por ejemplo, \"co -> console\" y \"con -> const\".",
  "Controls how suggestions are pre-selected when showing the suggest list.": "Controla cómo se preseleccionan las sugerencias cuando se muestra la lista,",
  "Tab complete will insert the best matching suggestion when pressing tab.": "La pestaña se completará insertando la mejor sugerencia de coincidencia encontrada al presionar la pestaña",
  "Disable tab completions.": "Deshabilitar los complementos para pestañas.",
  "Tab complete snippets when their prefix match. Works best when 'quickSuggestions' aren't enabled.": "La pestaña se completa con fragmentos de código cuando su prefijo coincide. Funciona mejor cuando las 'quickSuggestions' no están habilitadas.",
  "Enables tab completions.": "Habilita completar pestañas.",
  "Unusual line terminators are automatically removed.": "Los terminadores de línea no habituales se quitan automáticamente.",
  "Unusual line terminators are ignored.": "Los terminadores de línea no habituales se omiten.",
  "Unusual line terminators prompt to be removed.": "Advertencia de terminadores de línea inusuales que se quitarán.",
  "Remove unusual line terminators that might cause problems.": "Quite los terminadores de línea inusuales que podrían provocar problemas.",
  "Inserting and deleting whitespace follows tab stops.": "Los espacios y tabulaciones se insertan y eliminan en alineación con tabulaciones.",
  "Characters that will be used as word separators when doing word related navigations or operations.": "Caracteres que se usarán como separadores de palabras al realizar operaciones o navegaciones relacionadas con palabras.",
  "Lines will wrap at `#editor.wordWrapColumn#`.": "Las líneas se ajustarán al valor de \"#editor.wordWrapColumn#\". ",
  "Lines will wrap at the minimum of viewport and `#editor.wordWrapColumn#`.": "Las líneas se ajustarán al valor que sea inferior: el tamaño de la ventanilla o el valor de \"#editor.wordWrapColumn#\".",
  "Controls how lines should wrap.": "Controla cómo deben ajustarse las líneas.",
  "Controls the wrapping column of the editor when `#editor.wordWrap#` is `wordWrapColumn` or `bounded`.": "Controla la columna de ajuste del editor cuando \"#editor.wordWrap#\" es \"wordWrapColumn\" o \"bounded\".",
  "No indentation. Wrapped lines begin at column 1.": "No hay sangría. Las líneas ajustadas comienzan en la columna 1.",
  "Wrapped lines get the same indentation as the parent.": "A las líneas ajustadas se les aplica la misma sangría que al elemento primario.",
  "Wrapped lines get +1 indentation toward the parent.": "A las líneas ajustadas se les aplica una sangría de +1 respecto al elemento primario.",
  "Wrapped lines get +2 indentation toward the parent.": "A las líneas ajustadas se les aplica una sangría de +2 respecto al elemento primario.",
  "Controls the indentation of wrapped lines.": "Controla la sangría de las líneas ajustadas.",
  "Assumes that all characters are of the same width. This is a fast algorithm that works correctly for monospace fonts and certain scripts (like Latin characters) where glyphs are of equal width.": "Se supone que todos los caracteres son del mismo ancho. Este es un algoritmo rápido que funciona correctamente para fuentes monoespaciales y ciertos scripts (como caracteres latinos) donde los glifos tienen el mismo ancho.",
  "Delegates wrapping points computation to the browser. This is a slow algorithm, that might cause freezes for large files, but it works correctly in all cases.": "Delega el cálculo de puntos de ajuste en el explorador. Es un algoritmo lento, que podría causar bloqueos para archivos grandes, pero funciona correctamente en todos los casos.",
  "Controls the algorithm that computes wrapping points.": "Controla el algoritmo que calcula los puntos de ajuste. Tenga en cuenta que, en el modo de accesibilidad, se usará el modo avanzado para obtener la mejor experiencia.",
  "Background color for the highlight of line at the cursor position.": "Color de fondo para la línea resaltada en la posición del cursor.",
  "Background color for the border around the line at the cursor position.": "Color de fondo del borde alrededor de la línea en la posición del cursor.",
  "Background color of highlighted ranges, like by quick open and find features. The color must not be opaque so as not to hide underlying decorations.": "Color de fondo de rangos resaltados, como en abrir rápido y encontrar características. El color no debe ser opaco para no ocultar decoraciones subyacentes.",
  "Background color of the border around highlighted ranges.": "Color de fondo del borde alrededor de los intervalos resaltados.",
  "Background color of highlighted symbol, like for go to definition or go next/previous symbol. The color must not be opaque so as not to hide underlying decorations.": "Color de fondo del símbolo destacado, como Ir a definición o Ir al siguiente/anterior símbolo. El color no debe ser opaco para no ocultar la decoración subyacente.",
  "Background color of the border around highlighted symbols.": "Color de fondo del borde alrededor de los símbolos resaltados.",
  "Color of the editor cursor.": "Color del cursor del editor.",
  "The background color of the editor cursor. Allows customizing the color of a character overlapped by a block cursor.": "Color de fondo del cursor de edición. Permite personalizar el color del caracter solapado por el bloque del cursor.",
  "Color of whitespace characters in the editor.": "Color de los caracteres de espacio en blanco del editor.",
  "Color of the editor indentation guides.": "Color de las guías de sangría del editor.",
  "Color of the active editor indentation guides.": "Color de las guías de sangría activas del editor.",
  "Color of editor line numbers.": "Color de números de línea del editor.",
  "Color of editor active line number": "Color del número de línea activa en el editor",
  "Id is deprecated. Use 'editorLineNumber.activeForeground' instead.": "ID es obsoleto. Usar en lugar 'editorLineNumber.activeForeground'. ",
  "Color of the editor rulers.": "Color de las reglas del editor",
  "Foreground color of editor CodeLens": "Color principal de lentes de código en el editor",
  "Background color behind matching brackets": "Color de fondo tras corchetes coincidentes",
  "Color for matching brackets boxes": "Color de bloques con corchetes coincidentes",
  "Color of the overview ruler border.": "Color del borde de la regla de visión general.",
  "Background color of the editor overview ruler. Only used when the minimap is enabled and placed on the right side of the editor.": "Color de fondo de la regla de información general del editor.",
  "Background color of the editor gutter. The gutter contains the glyph margins and the line numbers.": "Color de fondo del margen del editor. Este espacio contiene los márgenes de glifos y los números de línea.",
  "Border color of unnecessary (unused) source code in the editor.": "Color del borde de código fuente innecesario (sin usar) en el editor.",
  "Opacity of unnecessary (unused) source code in the editor. For example, \"#000000c0\" will render the code with 75% opacity. For high contrast themes, use the  'editorUnnecessaryCode.border' theme color to underline unnecessary code instead of fading it out.": "Opacidad de código fuente innecesario (sin usar) en el editor. Por ejemplo, \"#000000c0\" representará el código con un 75 % de opacidad. Para temas de alto contraste, utilice el color del tema 'editorUnnecessaryCode.border' para resaltar el código innecesario en vez de atenuarlo.",
  "Border color of ghost text in the editor.": "Color del borde del texto fantasma en el editor.",
  "Foreground color of the ghost text in the editor.": "Color de primer plano del texto fantasma en el editor.",
  "Background color of the ghost text in the editor.": "Color de fondo del texto fantasma en el editor.",
  "Overview ruler marker color for range highlights. The color must not be opaque so as not to hide underlying decorations.": "Color de marcador de regla general para los destacados de rango. El color no debe ser opaco para no ocultar las decoraciones subyacentes.",
  "Overview ruler marker color for errors.": "Color de marcador de regla de información general para errores. ",
  "Overview ruler marker color for warnings.": "Color de marcador de regla de información general para advertencias.",
  "Overview ruler marker color for infos.": "Color de marcador de regla de información general para mensajes informativos. ",
  "Foreground color of brackets (1). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (1). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of brackets (2). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (2). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of brackets (3). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (3). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of brackets (4). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (4). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of brackets (5). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (5). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of brackets (6). Requires enabling bracket pair colorization.": "Color de primer plano de los corchetes (6). Requiere que se habilite la coloración del par de corchetes.",
  "Foreground color of unexpected brackets.": "Color de primer plano de corchetes inesperados.",
  "Background color of inactive bracket pair guides (1). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (1). Requiere habilitar guías de par de corchetes.",
  "Background color of inactive bracket pair guides (2). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (2). Requiere habilitar guías de par de corchetes.",
  "Background color of inactive bracket pair guides (3). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (3). Requiere habilitar guías de par de corchetes.",
  "Background color of inactive bracket pair guides (4). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (4). Requiere habilitar guías de par de corchetes.",
  "Background color of inactive bracket pair guides (5). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (5). Requiere habilitar guías de par de corchetes.",
  "Background color of inactive bracket pair guides (6). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes inactivos (6). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (1). Requires enabling bracket pair guides.": "Color de fondo de las guías de pares de corchetes activos (1). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (2). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes activos (2). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (3). Requires enabling bracket pair guides.": "Color de fondo de las guías de pares de corchetes activos (3). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (4). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes activos (4). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (5). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes activos (5). Requiere habilitar guías de par de corchetes.",
  "Background color of active bracket pair guides (6). Requires enabling bracket pair guides.": "Color de fondo de las guías de par de corchetes activos (6). Requiere habilitar guías de par de corchetes.",
  "Border color used to highlight unicode characters.": "Color de borde usado para resaltar caracteres Unicode.",
  "Plain Text": "Texto sin formato",
  "Typing": "Escribiendo",
  "{0} ({1})": "{0} ({1})",
  "Default Language Configuration Overrides": "La configuración del lenguaje predeterminada se reemplaza",
  "Configure settings to be overridden for {0} language.": "Configure los valores que se invalidarán para el idioma {0}.",
  "Configure editor settings to be overridden for a language.": "Establecer los valores de configuración que se reemplazarán para un lenguaje.",
  "This setting does not support per-language configuration.": "Esta configuración no admite la configuración por idioma.",
  "Cannot register an empty property": "No se puede registrar una propiedad vacía.",
  "Cannot register '{0}'. This matches property pattern '\\\\[.*\\\\]$' for describing language specific editor settings. Use 'configurationDefaults' contribution.": "No se puede registrar \"{0}\". Coincide con el patrón de propiedad '\\\\[.*\\\\]$' para describir la configuración del editor específica del lenguaje. Utilice la contribución \"configurationDefaults\".",
  "Cannot register '{0}'. This property is already registered.": "No se puede registrar \"{0}\". Esta propiedad ya está registrada.",
  "A command that returns information about context keys": "Comando que devuelve información sobre las claves de contexto",
  "Whether the operating system is macOS": "Si el sistema operativo es macOS",
  "Whether the operating system is Linux": "Si el sistema operativo es Linux",
  "Whether the operating system is Windows": "Si el sistema operativo es Windows",
  "Whether the platform is a web browser": "Si la plataforma es un explorador web",
  "Whether the operating system is macOS on a non-browser platform": "Si el sistema operativo es macOS en una plataforma que no es de explorador",
  "Whether the operating system is IOS": "Si el sistema operativo es IOS",
  "Whether keyboard focus is inside an input box": "Si el foco del teclado está dentro de un cuadro de entrada",
  "({0}) was pressed. Waiting for second key of chord...": "Se presionó ({0}). Esperando la siguiente tecla...",
  "The key combination ({0}, {1}) is not a command.": "La combinación de claves ({0}, {1}) no es un comando.",
  "Workbench": "Área de trabajo",
  "The modifier to be used to add an item in trees and lists to a multi-selection with the mouse (for example in the explorer, open editors and scm view). The 'Open to Side' mouse gestures - if supported - will adapt such that they do not conflict with the multiselect modifier.": "El modificador que se utilizará para agregar un elemento en los árboles y listas para una selección múltiple con el ratón (por ejemplo en el explorador, abiertos editores y vista de scm). Los gestos de ratón 'Abrir hacia' - si están soportados - se adaptarán de forma tal que no tenga conflicto con el modificador múltiple.",
  "Controls how to open items in trees and lists using the mouse (if supported). Note that some trees and lists might choose to ignore this setting if it is not applicable.": "Controla cómo abrir elementos en los árboles y las listas mediante el mouse (si se admite). Tenga en cuenta que algunos árboles y listas pueden optar por ignorar esta configuración si no es aplicable.",
  "Controls whether lists and trees support horizontal scrolling in the workbench. Warning: turning on this setting has a performance implication.": "Controla si las listas y los árboles admiten el desplazamiento horizontal en el área de trabajo. Advertencia: La activación de esta configuración repercute en el rendimiento.",
  "Controls tree indentation in pixels.": "Controla la sangría de árbol en píxeles.",
  "Controls whether the tree should render indent guides.": "Controla si el árbol debe representar guías de sangría.",
  "Controls whether lists and trees have smooth scrolling.": "Controla si las listas y los árboles tienen un desplazamiento suave.",
  "Simple keyboard navigation focuses elements which match the keyboard input. Matching is done only on prefixes.": "La navegación simple del teclado se centra en elementos que coinciden con la entrada del teclado. El emparejamiento se hace solo en prefijos.",
  "Highlight keyboard navigation highlights elements which match the keyboard input. Further up and down navigation will traverse only the highlighted elements.": "Destacar la navegación del teclado resalta los elementos que coinciden con la entrada del teclado. Más arriba y abajo la navegación atravesará solo los elementos destacados.",
  "Filter keyboard navigation will filter out and hide all the elements which do not match the keyboard input.": "La navegación mediante el teclado de filtro filtrará y ocultará todos los elementos que no coincidan con la entrada del teclado.",
  "Controls the keyboard navigation style for lists and trees in the workbench. Can be simple, highlight and filter.": "Controla el estilo de navegación del teclado para listas y árboles en el área de trabajo. Puede ser simple, resaltar y filtrar.",
  "Controls whether keyboard navigation in lists and trees is automatically triggered simply by typing. If set to `false`, keyboard navigation is only triggered when executing the `list.toggleKeyboardNavigation` command, for which you can assign a keyboard shortcut.": "",
  "Controls how tree folders are expanded when clicking the folder names. Note that some trees and lists might choose to ignore this setting if it is not applicable.": "Controla cómo se expanden las carpetas de árbol al hacer clic en sus nombres. Tenga en cuenta que algunos árboles y listas pueden optar por omitir esta configuración si no es aplicable.",
  "Error": "Error",
  "Warning": "Advertencia",
  "Info": "Información",
  "{0}, {1}": "{0}, {1}",
  "recently used": "usado recientemente",
  "other commands": "otros comandos",
  "Command '{0}' resulted in an error ({1})": "El comando \"{0}\" ha dado lugar a un error",
  "global commands": "",
  "editor commands": "",
  "Overall foreground color. This color is only used if not overridden by a component.": "",
  "Overall foreground color for error messages. This color is only used if not overridden by a component.": "",
  "Foreground color for description text providing additional information, for example for a label.": "",
  "The default color for icons in the workbench.": "",
  "Overall border color for focused elements. This color is only used if not overridden by a component.": "",
  "An extra border around elements to separate them from others for greater contrast.": "",
  "An extra border around active elements to separate them from others for greater contrast.": "",
  "The background color of text selections in the workbench (e.g. for input fields or text areas). Note that this does not apply to selections within the editor.": "",
  "Color for text separators.": "",
  "Foreground color for links in text.": "",
  "Foreground color for links in text when clicked on and on mouse hover.": "",
  "Foreground color for preformatted text segments.": "",
  "Background color for block quotes in text.": "",
  "Border color for block quotes in text.": "",
  "Background color for code blocks in text.": "",
  "Shadow color of widgets such as find/replace inside the editor.": "",
  "Input box background.": "",
  "Input box foreground.": "",
  "Input box border.": "",
  "Border color of activated options in input fields.": "",
  "Background color of activated options in input fields.": "",
  "Background hover color of options in input fields.": "",
  "Foreground color of activated options in input fields.": "",
  "Input box foreground color for placeholder text.": "",
  "Input validation background color for information severity.": "",
  "Input validation foreground color for information severity.": "",
  "Input validation border color for information severity.": "",
  "Input validation background color for warning severity.": "",
  "Input validation foreground color for warning severity.": "",
  "Input validation border color for warning severity.": "",
  "Input validation background color for error severity.": "",
  "Input validation foreground color for error severity.": "",
  "Input validation border color for error severity.": "",
  "Dropdown background.": "",
  "Dropdown list background.": "",
  "Dropdown foreground.": "",
  "Dropdown border.": "",
  "Background color of checkbox widget.": "",
  "Foreground color of checkbox widget.": "",
  "Border color of checkbox widget.": "",
  "Button foreground color.": "",
  "Button background color.": "",
  "Button background color when hovering.": "",
  "Button border color.": "",
  "Secondary button foreground color.": "",
  "Secondary button background color.": "",
  "Secondary button background color when hovering.": "",
  "Badge background color. Badges are small information labels, e.g. for search results count.": "",
  "Badge foreground color. Badges are small information labels, e.g. for search results count.": "",
  "Scrollbar shadow to indicate that the view is scrolled.": "",
  "Scrollbar slider background color.": "",
  "Scrollbar slider background color when hovering.": "",
  "Scrollbar slider background color when clicked on.": "",
  "Background color of the progress bar that can show for long running operations.": "",
  "Background color of error text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of error squigglies in the editor.": "",
  "Border color of error boxes in the editor.": "",
  "Background color of warning text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of warning squigglies in the editor.": "",
  "Border color of warning boxes in the editor.": "",
  "Background color of info text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of info squigglies in the editor.": "",
  "Border color of info boxes in the editor.": "",
  "Foreground color of hint squigglies in the editor.": "",
  "Border color of hint boxes in the editor.": "",
  "Border color of active sashes.": "",
  "Editor background color.": "",
  "Editor default foreground color.": "",
  "Background color of editor widgets, such as find/replace.": "",
  "Foreground color of editor widgets, such as find/replace.": "",
  "Border color of editor widgets. The color is only used if the widget chooses to have a border and if the color is not overridden by a widget.": "",
  "Border color of the resize bar of editor widgets. The color is only used if the widget chooses to have a resize border and if the color is not overridden by a widget.": "",
  "Quick picker background color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker foreground color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker title background color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker color for grouping labels.": "",
  "Quick picker color for grouping borders.": "",
  "Keybinding label background color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label foreground color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label border color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label border bottom color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Color of the editor selection.": "",
  "Color of the selected text for high contrast.": "",
  "Color of the selection in an inactive editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color for regions with the same content as the selection. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color for regions with the same content as the selection.": "",
  "Color of the current search match.": "",
  "Color of the other search matches. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color of the current search match.": "",
  "Border color of the other search matches.": "",
  "Border color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the Search Editor query matches.": "",
  "Border color of the Search Editor query matches.": "",
  "Highlight below the word for which a hover is shown. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color of the editor hover.": "",
  "Foreground color of the editor hover.": "",
  "Border color of the editor hover.": "",
  "Background color of the editor hover status bar.": "",
  "Color of active links.": "",
  "Foreground color of inline hints": "",
  "Background color of inline hints": "",
  "Foreground color of inline hints for types": "",
  "Background color of inline hints for types": "",
  "Foreground color of inline hints for parameters": "",
  "Background color of inline hints for parameters": "",
  "The color used for the lightbulb actions icon.": "",
  "The color used for the lightbulb auto fix actions icon.": "",
  "Background color for text that got inserted. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color for text that got removed. The color must not be opaque so as not to hide underlying decorations.": "",
  "Outline color for the text that got inserted.": "",
  "Outline color for text that got removed.": "",
  "Border color between the two text editors.": "",
  "Color of the diff editor's diagonal fill. The diagonal fill is used in side-by-side diff views.": "",
  "List/Tree background color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree outline color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree icon foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree icon foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree outline color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background when hovering over items using the mouse.": "",
  "List/Tree foreground when hovering over items using the mouse.": "",
  "List/Tree drag and drop background when moving items around using the mouse.": "",
  "List/Tree foreground color of the match highlights when searching inside the list/tree.": "",
  "List/Tree foreground color of the match highlights on actively focused items when searching inside the list/tree.": "",
  "List/Tree foreground color for invalid items, for example an unresolved root in explorer.": "",
  "Foreground color of list items containing errors.": "",
  "Foreground color of list items containing warnings.": "",
  "Background color of the type filter widget in lists and trees.": "",
  "Outline color of the type filter widget in lists and trees.": "",
  "Outline color of the type filter widget in lists and trees, when there are no matches.": "",
  "Background color of the filtered match.": "",
  "Border color of the filtered match.": "",
  "Tree stroke color for the indentation guides.": "",
  "Table border color between columns.": "",
  "Background color for odd table rows.": "",
  "List/Tree foreground color for items that are deemphasized. ": "",
  "Please use quickInputList.focusBackground instead": "",
  "Quick picker foreground color for the focused item.": "",
  "Quick picker icon foreground color for the focused item.": "",
  "Quick picker background color for the focused item.": "",
  "Border color of menus.": "",
  "Foreground color of menu items.": "",
  "Background color of menu items.": "",
  "Foreground color of the selected menu item in menus.": "",
  "Background color of the selected menu item in menus.": "",
  "Border color of the selected menu item in menus.": "",
  "Color of a separator menu item in menus.": "",
  "Toolbar background when hovering over actions using the mouse": "",
  "Toolbar outline when hovering over actions using the mouse": "",
  "Toolbar background when holding the mouse over actions": "",
  "Highlight background color of a snippet tabstop.": "",
  "Highlight border color of a snippet tabstop.": "",
  "Highlight background color of the final tabstop of a snippet.": "",
  "Highlight border color of the final tabstop of a snippet.": "",
  "Color of focused breadcrumb items.": "",
  "Background color of breadcrumb items.": "",
  "Color of selected breadcrumb items.": "",
  "Background color of breadcrumb item picker.": "",
  "Current header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Current content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Incoming header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Incoming content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Common ancestor header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Common ancestor content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color on headers and the splitter in inline merge-conflicts.": "",
  "Current overview ruler foreground for inline merge-conflicts.": "",
  "Incoming overview ruler foreground for inline merge-conflicts.": "",
  "Common ancestor overview ruler foreground for inline merge-conflicts.": "",
  "Overview ruler marker color for find matches. The color must not be opaque so as not to hide underlying decorations.": "",
  "Overview ruler marker color for selection highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Minimap marker color for find matches.": "",
  "Minimap marker color for repeating editor selections.": "",
  "Minimap marker color for the editor selection.": "",
  "Minimap marker color for errors.": "",
  "Minimap marker color for warnings.": "",
  "Minimap background color.": "",
  "Opacity of foreground elements rendered in the minimap. For example, \"#000000c0\" will render the elements with 75% opacity.": "",
  "Minimap slider background color.": "",
  "Minimap slider background color when hovering.": "",
  "Minimap slider background color when clicked on.": "",
  "The color used for the problems error icon.": "",
  "The color used for the problems warning icon.": "",
  "The color used for the problems info icon.": "",
  "The foreground color used in charts.": "",
  "The color used for horizontal lines in charts.": "",
  "The red color used in chart visualizations.": "",
  "The blue color used in chart visualizations.": "",
  "The yellow color used in chart visualizations.": "",
  "The orange color used in chart visualizations.": "",
  "The green color used in chart visualizations.": "",
  "The purple color used in chart visualizations.": "",
  "The id of the font to use. If not set, the font that is defined first is used.": "",
  "The font character associated with the icon definition.": "",
  "Icon for the close action in widgets.": "Icono de la acción de cierre en los widgets.",
  "Icon for goto previous editor location.": "Icono para ir a la ubicación del editor anterior.",
  "Icon for goto next editor location.": "Icono para ir a la ubicación del editor siguiente.",
  "The following files have been closed and modified on disk: {0}.": "Se han cerrado los siguientes archivos y se han modificado en el disco: {0}.",
  "The following files have been modified in an incompatible way: {0}.": "Los siguientes archivos se han modificado de forma incompatible: {0}.",
  "Could not undo '{0}' across all files. {1}": "No se pudo deshacer \"{0}\" en todos los archivos. {1}",
  "Could not undo '{0}' across all files because changes were made to {1}": "No se pudo deshacer \"{0}\" en todos los archivos porque se realizaron cambios en {1}",
  "Could not undo '{0}' across all files because there is already an undo or redo operation running on {1}": "No se pudo deshacer \"{0}\" en todos los archivos porque ya hay una operación de deshacer o rehacer en ejecución en {1}",
  "Could not undo '{0}' across all files because an undo or redo operation occurred in the meantime": "No se pudo deshacer \"{0}\" en todos los archivos porque se produjo una operación de deshacer o rehacer mientras tanto",
  "Would you like to undo '{0}' across all files?": "¿Desea deshacer \"{0}\" en todos los archivos?",
  "Undo in {0} Files": "&&Deshacer en {0} archivos",
  "Undo this File": "Deshacer este &&archivo",
  "Cancel": "",
  "Could not undo '{0}' because there is already an undo or redo operation running.": "No se pudo deshacer \"{0}\" porque ya hay una operación de deshacer o rehacer en ejecución.",
  "Would you like to undo '{0}'?": "¿Quiere deshacer \"{0}\"?",
  "Yes": "&&Sí",
  "No": "No",
  "Could not redo '{0}' across all files. {1}": "No se pudo rehacer \"{0}\" en todos los archivos. {1}",
  "Could not redo '{0}' across all files because changes were made to {1}": "No se pudo volver a hacer \"{0}\" en todos los archivos porque se realizaron cambios en {1}",
  "Could not redo '{0}' across all files because there is already an undo or redo operation running on {1}": "No se pudo rehacer \"{0}\" en todos los archivos porque ya hay una operación de deshacer o rehacer en ejecución en {1}",
  "Could not redo '{0}' across all files because an undo or redo operation occurred in the meantime": "No se pudo rehacer \"{0}\" en todos los archivos porque se produjo una operación de deshacer o rehacer mientras tanto",
  "Could not redo '{0}' because there is already an undo or redo operation running.": "No se pudo rehacer \"{0}\" porque ya hay una operación de deshacer o rehacer en ejecución.",
  "Code Workspace": "",
  "input": "entrada",
  "Match Case": "",
  "Match Whole Word": "",
  "Use Regular Expression": "",
  "Preserve Case": "",
  "Loading...": "Cargando...",
  "Error: {0}": "Error: {0}",
  "Warning: {0}": "Advertencia: {0}",
  "Info: {0}": "Información: {0}",
  "for history": "",
  "Unbound": "Sin enlazar",
  "Clear": "",
  "Disable Filter on Type": "",
  "Enable Filter on Type": "",
  "No elements found": "",
  "Matched {0} out of {1} elements": "",
  "Back": "",
  "{0}/{1}": "",
  "Press 'Enter' to confirm your input or 'Escape' to cancel": "",
  "Type to narrow down results.": "",
  "{0} Results": "",
  "{0} Selected": "",
  "OK": "",
  "Custom": "",
  "Back ({0})": "",
  "Quick Input": "",
  "Selection Anchor": "Delimitador de la selección",
  "Anchor set at {0}:{1}": "Delimitador establecido en {0}:{1}",
  "Set Selection Anchor": "Establecer el delimitador de la selección",
  "Go to Selection Anchor": "Ir al delimitador de la selección",
  "Select from Anchor to Cursor": "Seleccionar desde el delimitador hasta el cursor",
  "Cancel Selection Anchor": "Cancelar el delimitador de la selección",
  "Overview ruler marker color for matching brackets.": "Resumen color de marcador de regla para corchetes.",
  "Go to Bracket": "Ir al corchete",
  "Select to Bracket": "Seleccionar para corchete",
  "Go to &&Bracket": "Ir al &&corchete",
  "Move Selected Text Left": "Mover el texto seleccionado a la izquierda",
  "Move Selected Text Right": "Mover el texto seleccionado a la derecha",
  "Transpose Letters": "Transponer letras",
  "Cu&&t": "Cor&&tar",
  "Cut": "Cortar",
  "&&Copy": "&&Copiar",
  "Copy": "Copiar",
  "Copy As": "Copiar como",
  "&&Paste": "&&Pegar",
  "Paste": "Pegar",
  "Copy With Syntax Highlighting": "Copiar con resaltado de sintaxis",
  "Kind of the code action to run.": "Tipo de la acción de código que se va a ejecutar.",
  "Controls when the returned actions are applied.": "Controla cuándo se aplican las acciones devueltas.",
  "Always apply the first returned code action.": "Aplicar siempre la primera acción de código devuelto.",
  "Apply the first returned code action if it is the only one.": "Aplicar la primera acción de código devuelta si solo hay una.",
  "Do not apply the returned code actions.": "No aplique las acciones de código devuelto.",
  "Controls if only preferred code actions should be returned.": "Controla si solo se deben devolver las acciones de código preferidas.",
  "An unknown error occurred while applying the code action": "",
  "Quick Fix...": "Corrección Rápida",
  "No code actions available": "No hay acciones de código disponibles",
  "No preferred code actions for '{0}' available": "No hay acciones de código preferidas para \"{0}\" disponibles",
  "No code actions for '{0}' available": "No hay ninguna acción de código para \"{0}\" disponible.",
  "No preferred code actions available": "No hay acciones de código preferidas disponibles",
  "Refactor...": "Refactorizar...",
  "No preferred refactorings for '{0}' available": "No hay refactorizaciones preferidas de \"{0}\" disponibles",
  "No refactorings for '{0}' available": "No hay refactorizaciones de \"{0}\" disponibles",
  "No preferred refactorings available": "No hay ninguna refactorización favorita disponible.",
  "No refactorings available": "No hay refactorizaciones disponibles",
  "Source Action...": "Acción de código fuente...",
  "No preferred source actions for '{0}' available": "No hay acciones de origen preferidas para \"{0}\" disponibles",
  "No source actions for '{0}' available": "No hay ninguna acción de código fuente para \"{0}\" disponible.",
  "No preferred source actions available": "No hay ninguna acción de código fuente favorita disponible.",
  "No source actions available": "No hay acciones de origen disponibles",
  "Organize Imports": "Organizar Importaciones",
  "No organize imports action available": "No hay acciones de importación disponibles",
  "Fix All": "Corregir todo",
  "No fix all action available": "No está disponible la acción de corregir todo",
  "Auto Fix...": "Corregir automáticamente...",
  "No auto fixes available": "No hay autocorrecciones disponibles",
  "Show Code Actions. Preferred Quick Fix Available ({0})": "Mostrar acciones de código. Corrección rápida preferida disponible ({0})",
  "Show Code Actions ({0})": "Mostrar acciones de código ({0})",
  "Show Code Actions": "Mostrar acciones de código",
  "Show CodeLens Commands For Current Line": "Mostrar comandos de lente de código para la línea actual",
  "Click to toggle color options (rgb/hsl/hex)": "",
  "Toggle Line Comment": "Alternar comentario de línea",
  "&&Toggle Line Comment": "&&Alternar comentario de línea",
  "Add Line Comment": "Agregar comentario de línea",
  "Remove Line Comment": "Quitar comentario de línea",
  "Toggle Block Comment": "Alternar comentario de bloque",
  "Toggle &&Block Comment": "Alternar &&bloque de comentario",
  "Show Editor Context Menu": "Mostrar menú contextual del editor",
  "Cursor Undo": "Cursor Deshacer",
  "Cursor Redo": "Cursor Rehacer",
  "Whether the editor runs a cancellable operation, e.g. like 'Peek References'": "Indica si el editor ejecuta una operación que se puede cancelar como, por ejemplo, \"Inspeccionar referencias\"",
  "Find": "Buscar",
  "&&Find": "&&Buscar",
  "Overrides \"Use Regular Expression\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Match Whole Word\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Math Case\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Preserve Case\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Find With Arguments": "Búsqueda con argumentos",
  "Find With Selection": "Buscar con selección",
  "Find Next": "Buscar siguiente",
  "Find Previous": "Buscar anterior",
  "Find Next Selection": "Buscar selección siguiente",
  "Find Previous Selection": "Buscar selección anterior",
  "Replace": "Reemplazar",
  "&&Replace": "&&Reemplazar",
  "Icon for 'Find in Selection' in the editor find widget.": "Icono para \"Buscar en selección\" en el widget de búsqueda del editor.",
  "Icon to indicate that the editor find widget is collapsed.": "Icono para indicar que el widget de búsqueda del editor está contraído.",
  "Icon to indicate that the editor find widget is expanded.": "Icono para indicar que el widget de búsqueda del editor está expandido.",
  "Icon for 'Replace' in the editor find widget.": "Icono para \"Reemplazar\" en el widget de búsqueda del editor.",
  "Icon for 'Replace All' in the editor find widget.": "Icono para \"Reemplazar todo\" en el widget de búsqueda del editor.",
  "Icon for 'Find Previous' in the editor find widget.": "Icono para \"Buscar anterior\" en el widget de búsqueda del editor.",
  "Icon for 'Find Next' in the editor find widget.": "Icono para \"Buscar siguiente\" en el widget de búsqueda del editor.",
  "Previous Match": "Coincidencia anterior",
  "Next Match": "Coincidencia siguiente",
  "Find in Selection": "Buscar en selección",
  "Replace All": "Reemplazar todo",
  "Toggle Replace": "Alternar reemplazar",
  "Only the first {0} results are highlighted, but all find operations work on the entire text.": "Sólo los primeros {0} resultados son resaltados, pero todas las operaciones de búsqueda trabajan en todo el texto.",
  "{0} of {1}": "{0} de {1}",
  "No results": "No hay resultados",
  "{0} found": "Encontrados: {0}",
  "{0} found for '{1}'": "{0} encontrado para \"{1}\"",
  "{0} found for '{1}', at {2}": "{0} encontrado para \"{1}\", en {2}",
  "Ctrl+Enter now inserts line break instead of replacing all. You can modify the keybinding for editor.action.replaceAll to override this behavior.": "Ctrl+Entrar ahora inserta un salto de línea en lugar de reemplazar todo. Puede modificar el enlace de claves para editor.action.replaceAll para invalidar este comportamiento.",
  "The number of foldable regions is limited to a maximum of {0}. Increase configuration option ['Folding Maximum Regions'](command:workbench.action.openSettings?[\"editor.foldingMaximumRegions\"]) to enable more.": "",
  "Unfold": "Desplegar",
  "Unfold Recursively": "Desplegar de forma recursiva",
  "Fold": "Plegar",
  "Toggle Fold": "Alternar plegado",
  "Fold Recursively": "Plegar de forma recursiva",
  "Fold All Block Comments": "Cerrar todos los comentarios de bloque",
  "Fold All Regions": "Plegar todas las regiones",
  "Unfold All Regions": "Desplegar Todas las Regiones",
  "Fold All Regions Except Selected": "Plegar todas excepto las seleccionadas",
  "Unfold All Regions Except Selected": "Desplegar todas excepto las seleccionadas",
  "Fold All": "Plegar todo",
  "Unfold All": "Desplegar todo",
  "Go to Parent Fold": "Ir al plegado primario",
  "Go to Previous Folding Range": "Ir al rango de plegado anterior",
  "Go to Next Folding Range": "Ir al rango de plegado siguiente",
  "Fold Level {0}": "Nivel de plegamiento {0}",
  "Background color behind folded ranges. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the folding control in the editor gutter.": "",
  "Icon for expanded ranges in the editor glyph margin.": "Icono de rangos expandidos en el margen de glifo del editor.",
  "Icon for collapsed ranges in the editor glyph margin.": "Icono de rangos contraídos en el margen de glifo del editor.",
  "Editor Font Zoom In": "Aumentar el tamaño de fuente del editor",
  "Editor Font Zoom Out": "Disminuir el tamaño de fuente del editor",
  "Editor Font Zoom Reset": "Restablecer tamaño de fuente del editor",
  "Made 1 formatting edit on line {0}": "",
  "Made {0} formatting edits on line {1}": "",
  "Made 1 formatting edit between lines {0} and {1}": "",
  "Made {0} formatting edits between lines {1} and {2}": "",
  "Format Document": "Dar formato al documento",
  "Format Selection": "Dar formato a la selección",
  "Icon for goto next marker.": "Icono para ir al marcador siguiente.",
  "Go to Next Problem (Error, Warning, Info)": "Ir al siguiente problema (Error, Advertencia, Información)",
  "Icon for goto previous marker.": "Icono para ir al marcador anterior.",
  "Go to Previous Problem (Error, Warning, Info)": "Ir al problema anterior (Error, Advertencia, Información)",
  "Go to Next Problem in Files (Error, Warning, Info)": "Ir al siguiente problema en Archivos (Error, Advertencia, Información)",
  "Next &&Problem": "Siguiente &&problema",
  "Go to Previous Problem in Files (Error, Warning, Info)": "Ir al problema anterior en Archivos (Error, Advertencia, Información)",
  "Previous &&Problem": "Anterior &&problema",
  "Hint": "Sugerencia",
  "{0} at {1}. ": "{0} en {1}. ",
  "{0} of {1} problems": "{0} de {1} problemas",
  "{0} of {1} problem": "{0} de {1} problema",
  "Editor marker navigation widget error color.": "Color de los errores del widget de navegación de marcadores del editor.",
  "Editor marker navigation widget error heading background.": "Fondo del encabezado del error del widget de navegación del marcador de editor.",
  "Editor marker navigation widget warning color.": "Color de las advertencias del widget de navegación de marcadores del editor.",
  "Editor marker navigation widget warning heading background.": "Fondo del encabezado de la advertencia del widget de navegación del marcador de editor.",
  "Editor marker navigation widget info color.": "Color del widget informativo marcador de navegación en el editor.",
  "Editor marker navigation widget info heading background.": "Fondo del encabezado de información del widget de navegación del marcador de editor.",
  "Editor marker navigation widget background.": "Fondo del widget de navegación de marcadores del editor.",
  "Peek": "Ver",
  "Definitions": "Definiciones",
  "No definition found for '{0}'": "No se encontró ninguna definición para \"{0}\"",
  "No definition found": "No se encontró ninguna definición",
  "Go to Definition": "Ir a definición",
  "Open Definition to the Side": "Abrir definición en el lateral",
  "Peek Definition": "Ver la definición sin salir",
  "Declarations": "Declaraciones",
  "No declaration found for '{0}'": "No se encontró ninguna definición para '{0}'",
  "No declaration found": "No se encontró ninguna declaración",
  "Go to Declaration": "Ir a Definición",
  "Peek Declaration": "Inspeccionar Definición",
  "Type Definitions": "Definiciones de tipo",
  "No type definition found for '{0}'": "No se encontró ninguna definición de tipo para \"{0}\"",
  "No type definition found": "No se encontró ninguna definición de tipo",
  "Go to Type Definition": "Ir a la definición de tipo",
  "Peek Type Definition": "Inspeccionar definición de tipo",
  "Implementations": "Implementaciones",
  "No implementation found for '{0}'": "No se encontró ninguna implementación para \"{0}\"",
  "No implementation found": "No se encontró ninguna implementación",
  "Go to Implementations": "Ir a Implementaciones",
  "Peek Implementations": "Inspeccionar implementaciones",
  "No references found for '{0}'": "No se ha encontrado ninguna referencia para \"{0}\".",
  "No references found": "No se encontraron referencias",
  "Go to References": "Ir a Referencias",
  "References": "Referencias",
  "Peek References": "Inspeccionar Referencias",
  "Go to Any Symbol": "Ir a cualquier símbolo",
  "Locations": "Ubicaciones",
  "No results for '{0}'": "No hay resultados para \"{0}\"",
  "Go to &&Definition": "Ir a &&definición",
  "Go to &&Declaration": "Ir a &&declaración",
  "Go to &&Type Definition": "Ir a la definición de &&tipo",
  "Go to &&Implementations": "Ir a &&implementaciones",
  "Go to &&References": "Ir a &&referencias",
  "symbol in {0} on line {1} at column {2}": "en {0} en la línea {1} en la columna {2}",
  "symbol in {0} on line {1} at column {2}, {3}": "{0} en {1} en la línea {2} en la columna {3}",
  "1 symbol in {0}, full path {1}": "1 símbolo en {0}, ruta de acceso completa {1}",
  "{0} symbols in {1}, full path {2}": "{0} símbolos en {1}, ruta de acceso completa {2}",
  "No results found": "No se encontraron resultados",
  "Found 1 symbol in {0}": "Encontró 1 símbolo en {0}",
  "Found {0} symbols in {1}": "Encontró {0} símbolos en {1}",
  "Found {0} symbols in {1} files": "Encontró {0} símbolos en {1} archivos",
  "Whether there are symbol locations that can be navigated via keyboard-only.": "Indica si hay ubicaciones de símbolos a las que se pueda navegar solo con el teclado.",
  "Symbol {0} of {1}, {2} for next": "Símbolo {0} de {1}, {2} para el siguiente",
  "Symbol {0} of {1}": "Símbolo {0} de {1}",
  "Show Hover": "",
  "Show Definition Preview Hover": "",
  "Tokenization is skipped for long lines for performance reasons. This can be configured via `editor.maxTokenizationLineLength`.": "Por motivos de rendimiento, la tokenización se omite con filas largas. Esta opción se puede configurar con \"editor.maxTokenizationLineLength\".",
  "View Problem": "Ver el problema",
  "No quick fixes available": "No hay correcciones rápidas disponibles",
  "Checking for quick fixes...": "Buscando correcciones rápidas...",
  "Convert Indentation to Spaces": "Convertir sangría en espacios",
  "Convert Indentation to Tabs": "Convertir sangría en tabulaciones",
  "Configured Tab Size": "Tamaño de tabulación configurado",
  "Select Tab Size for Current File": "Seleccionar tamaño de tabulación para el archivo actual",
  "Indent Using Tabs": "Aplicar sangría con tabulaciones",
  "Indent Using Spaces": "Aplicar sangría con espacios",
  "Detect Indentation from Content": "Detectar sangría del contenido",
  "Reindent Lines": "Volver a aplicar sangría a líneas",
  "Reindent Selected Lines": "Volver a aplicar sangría a líneas seleccionadas",
  "Whether an inline suggestion is visible": "",
  "Whether the inline suggestion starts with whitespace": "",
  "Whether the inline suggestion starts with whitespace that is less than what would be inserted by tab": "",
  "Show Next Inline Suggestion": "",
  "Show Previous Inline Suggestion": "",
  "Trigger Inline Suggestion": "",
  "Next": "",
  "Previous": "",
  "Accept": "",
  "Suggestion:": "",
  "Replace with Previous Value": "Reemplazar con el valor anterior",
  "Replace with Next Value": "Reemplazar con el valor siguiente",
  "Expand Line Selection": "Expandir selección de línea",
  "Copy Line Up": "Copiar línea arriba",
  "&&Copy Line Up": "&&Copiar línea arriba",
  "Copy Line Down": "Copiar línea abajo",
  "Co&&py Line Down": "Co&&piar línea abajo",
  "Duplicate Selection": "Selección duplicada",
  "&&Duplicate Selection": "&&Duplicar selección",
  "Move Line Up": "Mover línea hacia arriba",
  "Mo&&ve Line Up": "Mo&&ver línea arriba",
  "Move Line Down": "Mover línea hacia abajo",
  "Move &&Line Down": "Mover &&línea abajo",
  "Sort Lines Ascending": "Ordenar líneas en orden ascendente",
  "Sort Lines Descending": "Ordenar líneas en orden descendente",
  "Delete Duplicate Lines": "Eliminar líneas duplicadas",
  "Trim Trailing Whitespace": "Recortar espacio final",
  "Delete Line": "Eliminar línea",
  "Indent Line": "Sangría de línea",
  "Outdent Line": "Anular sangría de línea",
  "Insert Line Above": "Insertar línea arriba",
  "Insert Line Below": "Insertar línea debajo",
  "Delete All Left": "Eliminar todo a la izquierda",
  "Delete All Right": "Eliminar todo lo que está a la derecha",
  "Join Lines": "Unir líneas",
  "Transpose characters around the cursor": "Transponer caracteres alrededor del cursor",
  "Transform to Uppercase": "Transformar a mayúsculas",
  "Transform to Lowercase": "Transformar a minúsculas",
  "Transform to Title Case": "Transformar en Title Case",
  "Transform to Snake Case": "Transformar en Snake Case",
  "Start Linked Editing": "Iniciar edición vinculada",
  "Background color when the editor auto renames on type.": "Color de fondo cuando el editor cambia el nombre automáticamente al escribir.",
  "Execute command": "Ejecutar comando",
  "Follow link": "Seguir vínculo",
  "cmd + click": "cmd + clic",
  "ctrl + click": "ctrl + clic",
  "option + click": "opción + clic",
  "alt + click": "alt + clic",
  "Execute command {0}": "Ejecutar el comando {0}",
  "Failed to open this link because it is not well-formed: {0}": "No se pudo abrir este vínculo porque no tiene un formato correcto: {0}",
  "Failed to open this link because its target is missing.": "No se pudo abrir este vínculo porque falta el destino.",
  "Open Link": "Abrir vínculo",
  "Cannot edit in read-only editor": "",
  "Whether the editor is currently showing an inline message": "Indica si el editor muestra actualmente un mensaje insertado",
  "Cursor added: {0}": "Cursor agregado: {0}",
  "Cursors added: {0}": "Cursores agregados: {0}",
  "Add Cursor Above": "Agregar cursor arriba",
  "&&Add Cursor Above": "&&Agregar cursor arriba",
  "Add Cursor Below": "Agregar cursor debajo",
  "A&&dd Cursor Below": "A&&gregar cursor abajo",
  "Add Cursors to Line Ends": "Añadir cursores a finales de línea",
  "Add C&&ursors to Line Ends": "Agregar c&&ursores a extremos de línea",
  "Add Cursors To Bottom": "Añadir cursores a la parte inferior",
  "Add Cursors To Top": "Añadir cursores a la parte superior",
  "Add Selection To Next Find Match": "Agregar selección hasta la siguiente coincidencia de búsqueda",
  "Add &&Next Occurrence": "Agregar &&siguiente repetición",
  "Add Selection To Previous Find Match": "Agregar selección hasta la anterior coincidencia de búsqueda",
  "Add P&&revious Occurrence": "Agregar r&&epetición anterior",
  "Move Last Selection To Next Find Match": "Mover última selección hasta la siguiente coincidencia de búsqueda",
  "Move Last Selection To Previous Find Match": "Mover última selección hasta la anterior coincidencia de búsqueda",
  "Select All Occurrences of Find Match": "Seleccionar todas las repeticiones de coincidencia de búsqueda",
  "Select All &&Occurrences": "Seleccionar todas las &&repeticiones",
  "Change All Occurrences": "Cambiar todas las ocurrencias",
  "Trigger Parameter Hints": "Sugerencias para parámetros Trigger",
  "Icon for show next parameter hint.": "Icono para mostrar la sugerencia de parámetro siguiente.",
  "Icon for show previous parameter hint.": "Icono para mostrar la sugerencia de parámetro anterior.",
  "{0}, hint": "{0}, sugerencia",
  "Foreground color of the active item in the parameter hint.": "Color de primer plano del elemento activo en la sugerencia de parámetro.",
  "Whether the current code editor is embedded inside peek": "Indica si el editor de código actual está incrustado en la inspección.",
  "Background color of the peek view title area.": "Color de fondo del área de título de la vista de inspección.",
  "Color of the peek view title.": "Color del título de la vista de inpección.",
  "Color of the peek view title info.": "Color de la información del título de la vista de inspección.",
  "Color of the peek view borders and arrow.": "Color de los bordes y la flecha de la vista de inspección.",
  "Background color of the peek view result list.": "Color de fondo de la lista de resultados de vista de inspección.",
  "Foreground color for line nodes in the peek view result list.": "Color de primer plano de los nodos de inspección en la lista de resultados.",
  "Foreground color for file nodes in the peek view result list.": "Color de primer plano de los archivos de inspección en la lista de resultados.",
  "Background color of the selected entry in the peek view result list.": "Color de fondo de la entrada seleccionada en la lista de resultados de vista de inspección.",
  "Foreground color of the selected entry in the peek view result list.": "Color de primer plano de la entrada seleccionada en la lista de resultados de vista de inspección.",
  "Background color of the peek view editor.": "Color de fondo del editor de vista de inspección.",
  "Background color of the gutter in the peek view editor.": "Color de fondo del margen en el editor de vista de inspección.",
  "Match highlight color in the peek view result list.": "Buscar coincidencia con el color de resaltado de la lista de resultados de vista de inspección.",
  "Match highlight color in the peek view editor.": "Buscar coincidencia del color de resultado del editor de vista de inspección.",
  "Match highlight border in the peek view editor.": "Hacer coincidir el borde resaltado en el editor de vista previa.",
  "Open a text editor first to go to a line.": "Abra primero un editor de texto para ir a una línea.",
  "Go to line {0} and character {1}.": "Vaya a la línea {0} y al carácter {1}.",
  "Go to line {0}.": "Ir a la línea {0}.",
  "Current Line: {0}, Character: {1}. Type a line number between 1 and {2} to navigate to.": "Línea actual: {0}, Carácter: {1}. Escriba un número de línea entre 1 y {2} a los que navegar.",
  "Current Line: {0}, Character: {1}. Type a line number to navigate to.": "Línea actual: {0}, Carácter: {1}. Escriba un número de línea al que navegar.",
  "To go to a symbol, first open a text editor with symbol information.": "Para ir a un símbolo, primero abra un editor de texto con información de símbolo.",
  "The active text editor does not provide symbol information.": "El editor de texto activo no proporciona información de símbolos.",
  "No matching editor symbols": "No hay ningún símbolo del editor coincidente.",
  "No editor symbols": "No hay símbolos del editor.",
  "Open to the Side": "Abrir en el lateral",
  "Open to the Bottom": "Abrir en la parte inferior",
  "symbols ({0})": "símbolos ({0})",
  "properties ({0})": "propiedades ({0})",
  "methods ({0})": "métodos ({0})",
  "functions ({0})": "funciones ({0})",
  "constructors ({0})": "constructores ({0})",
  "variables ({0})": "variables ({0})",
  "classes ({0})": "clases ({0})",
  "structs ({0})": "estructuras ({0})",
  "events ({0})": "eventos ({0})",
  "operators ({0})": "operadores ({0})",
  "interfaces ({0})": "interfaces ({0})",
  "namespaces ({0})": "espacios de nombres ({0})",
  "packages ({0})": "paquetes ({0})",
  "type parameters ({0})": "parámetros de tipo ({0})",
  "modules ({0})": "módulos ({0})",
  "enumerations ({0})": "enumeraciones ({0})",
  "enumeration members ({0})": "miembros de enumeración ({0})",
  "strings ({0})": "cadenas ({0})",
  "files ({0})": "archivos ({0})",
  "arrays ({0})": "matrices ({0})",
  "numbers ({0})": "números ({0})",
  "booleans ({0})": "booleanos ({0})",
  "objects ({0})": "objetos ({0})",
  "keys ({0})": "claves ({0})",
  "fields ({0})": "campos ({0})",
  "constants ({0})": "constantes ({0})",
  "No result.": "No hay ningún resultado.",
  "An unknown error occurred while resolving rename location": "Error desconocido al resolver el cambio de nombre de la ubicación",
  "Renaming '{0}'": "Cambiando el nombre de '{0}' a '{1}'",
  "Renaming {0}": "Cambiar el nombre de {0} a {1}",
  "Successfully renamed '{0}' to '{1}'. Summary: {2}": "Nombre cambiado correctamente de '{0}' a '{1}'. Resumen: {2}",
  "Rename failed to apply edits": "No se pudo cambiar el nombre a las ediciones de aplicación",
  "Rename failed to compute edits": "No se pudo cambiar el nombre de las ediciones de cálculo",
  "Rename Symbol": "Cambiar el nombre del símbolo",
  "Enable/disable the ability to preview changes before renaming": "Activar/desactivar la capacidad de previsualizar los cambios antes de cambiar el nombre",
  "Whether the rename input widget is visible": "",
  "Rename input. Type new name and press Enter to commit.": "",
  "{0} to Rename, {1} to Preview": "",
  "Expand Selection": "Expandir selección",
  "&&Expand Selection": "&&Expandir selección",
  "Shrink Selection": "Reducir la selección",
  "&&Shrink Selection": "&&Reducir selección",
  "Whether the editor in current in snippet mode": "Indica si el editor actual está en modo de fragmentos de código.",
  "Whether there is a next tab stop when in snippet mode": "Indica si hay una tabulación siguiente cuando se está en modo de fragmentos de código.",
  "Whether there is a previous tab stop when in snippet mode": "Si hay una tabulación anterior cuando se está en modo de fragmentos de código.",
  "Sunday": "Domingo",
  "Monday": "Lunes",
  "Tuesday": "Martes",
  "Wednesday": "Miércoles",
  "Thursday": "Jueves",
  "Friday": "Viernes",
  "Saturday": "Sábado",
  "Sun": "Dom",
  "Mon": "Lun",
  "Tue": "Mar",
  "Wed": "Mié",
  "Thu": "Jue",
  "Fri": "Vie",
  "Sat": "Sáb",
  "January": "Enero",
  "February": "Febrero",
  "March": "Marzo",
  "April": "Abril",
  "May": "May",
  "June": "Junio",
  "July": "Julio",
  "August": "Agosto",
  "September": "Septiembre",
  "October": "Octubre",
  "November": "Noviembre",
  "December": "Diciembre",
  "Jan": "Ene",
  "Feb": "Feb",
  "Mar": "Mar",
  "Apr": "Abr",
  "Jun": "Jun",
  "Jul": "Jul",
  "Aug": "Ago",
  "Sep": "Sep",
  "Oct": "Oct",
  "Nov": "Nov",
  "Dec": "Dic",
  "Whether suggestion are visible": "",
  "Whether suggestion details are visible": "Indica si los detalles de las sugerencias están visibles.",
  "Whether there are multiple suggestions to pick from": "Indica si hay varias sugerencias para elegir.",
  "Whether inserting the current suggestion yields in a change or has everything already been typed": "Indica si la inserción de la sugerencia actual genera un cambio o si ya se ha escrito todo.",
  "Whether suggestions are inserted when pressing Enter": "Indica si se insertan sugerencias al presionar Entrar.",
  "Whether the current suggestion has insert and replace behaviour": "Indica si la sugerencia actual tiene el comportamiento de inserción y reemplazo.",
  "Whether the default behaviour is to insert or replace": "Indica si el comportamiento predeterminado es insertar o reemplazar.",
  "Whether the current suggestion supports to resolve further details": "Indica si la sugerencia actual admite la resolución de más detalles.",
  "Accepting '{0}' made {1} additional edits": "Aceptando \"{0}\" ediciones adicionales de {1} realizadas",
  "Trigger Suggest": "Sugerencias para Trigger",
  "Insert": "Insertar",
  "show less": "Mostrar menos",
  "show more": "Mostrar más",
  "Reset Suggest Widget Size": "Restablecer tamaño del widget de sugerencias",
  "Background color of the suggest widget.": "Color de fondo del widget sugerido.",
  "Border color of the suggest widget.": "Color de borde del widget sugerido.",
  "Foreground color of the suggest widget.": "Color de primer plano del widget sugerido.",
  "Foreground color of the selected entry in the suggest widget.": "Color de primer plano de le entrada seleccionada del widget de sugerencias.",
  "Icon foreground color of the selected entry in the suggest widget.": "Color de primer plano del icono de la entrada seleccionada en el widget de sugerencias.",
  "Background color of the selected entry in the suggest widget.": "Color de fondo de la entrada seleccionada del widget sugerido.",
  "Color of the match highlights in the suggest widget.": "Color del resaltado coincidido en el widget sugerido.",
  "Color of the match highlights in the suggest widget when an item is focused.": "Color de los resaltados de coincidencia en el widget de sugerencias cuando se enfoca un elemento.",
  "Foreground color of the suggest widget status.": "Color de primer plano del estado del widget sugerido.",
  "Suggest": "Sugerir",
  "{0}{1}, {2}": "{0} {1}, {2}",
  "{0}{1}": "{0} {1}",
  "{0}, docs: {1}": "{0}, documentos: {1}",
  "No suggestions.": "No hay sugerencias.",
  "Icon for more information in the suggest widget.": "Icono para obtener más información en el widget de sugerencias.",
  "Read More": "Leer más",
  "The foreground color for array symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de matriz. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for boolean symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos booleanos. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for class symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de clase. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for color symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de color. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for constant symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos constantes. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for constructor symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de constructor. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for enumerator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de enumerador. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for enumerator member symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de miembro del enumerador. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for event symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de evento. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for field symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de campo. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for file symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de archivo. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for folder symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de carpeta. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for function symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de función. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for interface symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de interfaz. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for key symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de claves. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for keyword symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de palabra clave. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for method symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de método. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for module symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de módulo. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for namespace symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de espacio de nombres. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for null symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos nulos. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for number symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano para los símbolos numéricos. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for object symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de objeto. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for operator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano para los símbolos del operador. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for package symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de paquete. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for property symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de propiedad. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for reference symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de referencia. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for snippet symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de fragmento de código. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for string symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de cadena. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for struct symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de estructura. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for text symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de texto. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for type parameter symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano para los símbolos de parámetro de tipo. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for unit symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos de unidad. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "The foreground color for variable symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Color de primer plano de los símbolos variables. Estos símbolos aparecen en el contorno, la ruta de navegación y el widget de sugerencias.",
  "Toggle Tab Key Moves Focus": "Alternar tecla de tabulación para mover el punto de atención",
  "Pressing Tab will now move focus to the next focusable element": "Presionando la pestaña ahora moverá el foco al siguiente elemento enfocable.",
  "Pressing Tab will now insert the tab character": "Presionando la pestaña ahora insertará el carácter de tabulación",
  "Developer: Force Retokenize": "Desarrollador: forzar nueva aplicación de token",
  "Icon shown with a warning message in the extensions editor.": "Icono que se muestra con un mensaje de advertencia en el editor de extensiones.",
  "This document contains many non-basic ASCII unicode characters": "Este documento contiene muchos caracteres Unicode ASCII no básicos",
  "This document contains many ambiguous unicode characters": "Este documento contiene muchos caracteres Unicode ambiguos",
  "This document contains many invisible unicode characters": "Este documento contiene muchos caracteres Unicode invisibles",
  "The character {0} could be confused with the character {1}, which is more common in source code.": "El carácter {0} podría confundirse con el carácter {1}, que es más común en el código fuente.",
  "The character {0} is invisible.": "El carácter {0} es invisible.",
  "The character {0} is not a basic ASCII character.": "El carácter {0} no es un carácter ASCII básico.",
  "Adjust settings": "Ajustar la configuración",
  "Disable highlighting of characters in comments": "Deshabilitar resaltado de caracteres en comentarios",
  "Disable Highlight In Comments": "Deshabilitar resaltado en comentarios",
  "Disable highlighting of characters in strings": "Deshabilitar resaltado de caracteres en cadenas",
  "Disable Highlight In Strings": "Deshabilitar resaltado en cadenas",
  "Disable highlighting of ambiguous characters": "Deshabilitar el resaltado de caracteres ambiguos",
  "Disable Ambiguous Highlight": "Deshabilitar resaltado ambiguo",
  "Disable highlighting of invisible characters": "Deshabilitar el resaltado de caracteres invisibles",
  "Disable Invisible Highlight": "Deshabilitar resaltado invisible",
  "Disable highlighting of non basic ASCII characters": "Deshabilitar el resaltado de caracteres ASCII no básicos",
  "Disable Non ASCII Highlight": "Deshabilitar resaltado que no es ASCII",
  "Show Exclude Options": "Mostrar opciones de exclusión",
  "Exclude {0} (invisible character) from being highlighted": "Excluir {0} (carácter invisible) de que se resalte",
  "Exclude {0} from being highlighted": "Excluir {0} de ser resaltado",
  "Allow unicode characters that are more common in the language \"{0}\".": "Permite caracteres Unicode más comunes en el idioma \"{0}\".",
  "Configure Unicode Highlight Options": "Configurar opciones de resaltado Unicode",
  "Unusual Line Terminators": "Terminadores de línea inusuales",
  "Detected unusual line terminators": "Se han detectado terminadores de línea inusuales",
  "The file '{0}' contains one or more unusual line terminator characters, like Line Separator (LS) or Paragraph Separator (PS).\n\nIt is recommended to remove them from the file. This can be configured via `editor.unusualLineTerminators`.": "Este archivo \"{0}\" contiene uno o más caracteres de terminación de línea inusuales, como el separador de línea (LS) o el separador de párrafo (PS).\r\n\r\nSe recomienda eliminarlos del archivo. Esto puede configurarse mediante \"editor.unusualLineTerminators\".",
  "Remove Unusual Line Terminators": "&&Quitar terminadores de línea inusuales",
  "Ignore": "Omitir",
  "Background color of a symbol during read-access, like reading a variable. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color of a symbol during write-access, like writing to a variable. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color of a symbol during read-access, like reading a variable.": "",
  "Border color of a symbol during write-access, like writing to a variable.": "",
  "Overview ruler marker color for symbol highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Overview ruler marker color for write-access symbol highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Go to Next Symbol Highlight": "Ir al siguiente símbolo destacado",
  "Go to Previous Symbol Highlight": "Ir al símbolo destacado anterior",
  "Trigger Symbol Highlight": "Desencadenar los símbolos destacados",
  "Delete Word": "Eliminar palabra",
  "Click to show {0} definitions.": "Haga clic para mostrar {0} definiciones.",
  "Whether reference peek is visible, like 'Peek References' or 'Peek Definition'": "Indica si está visible la inspección de referencias, como \"Inspección de referencias\" o \"Ver la definición sin salir\".",
  "{0} references": "{0} referencias",
  "{0} reference": "{0} referencia",
  "no preview available": "vista previa no disponible"
}