{
  "(empty)": "(puste)",
  "{0}: {1}": "{0}: {1}",
  "A system error occurred ({0})": "Wystąpił błąd systemu ({0})",
  "An unknown error occurred. Please consult the log for more details.": "Wystąpił nieznany błąd. Sprawdź dziennik, aby uzyskać więcej szczegółów.",
  "{0} ({1} errors in total)": "{0} (łączna liczba błędów: {1})",
  "Ctrl": "Ctrl",
  "Shift": "Shift",
  "Alt": "Alt",
  "Windows": "Windows",
  "Super": "Super",
  "Control": "Control",
  "Option": "Opcja",
  "Command": "Polecenie",
  "&&Undo": "&&Cofnij",
  "Undo": "Cofnij",
  "&&Redo": "&&Ponów",
  "Redo": "Ponów",
  "&&Select All": "&&Wybierz wszystko",
  "Select All": "Wybierz wszystko",
  "Whether the editor text has focus (cursor is blinking)": "Określa, czy tekst edytora ma fokus (kursor miga)",
  "Whether the editor or an editor widget has focus (e.g. focus is in the find widget)": "Określa, czy edytor lub widżet edytora ma fokus (np. widżet znajdowania ma fokus)",
  "Whether an editor or a rich text input has focus (cursor is blinking)": "Określa, czy edytor lub pole wejściowe tekstu sformatowanego ma fokus (kursor miga)",
  "Whether the editor is read only": "Określa, czy edytor jest tylko do odczytu",
  "Whether the context is a diff editor": "Określa, czy kontekst jest edytorem różnicowym",
  "Whether `editor.columnSelection` is enabled": "Określa, czy jest włączona opcja `editor.columnSelection`",
  "Whether the editor has text selected": "Określa, czy w edytorze wybrano tekst",
  "Whether the editor has multiple selections": "Określa, czy edytor ma wiele zaznaczeń",
  "Whether `Tab` will move focus out of the editor": "Określa, czy naciśnięcie klawisza `Tab` spowoduje przeniesienie fokusu poza edytor",
  "Whether the editor hover is visible": "Określa, czy jest widoczny obszar aktywny edytora",
  "Whether the editor is part of a larger editor (e.g. notebooks)": "Określa, czy edytor jest częścią większego edytora (np. w notesach)",
  "The language identifier of the editor": "Identyfikator języka edytora",
  "Whether the editor has a completion item provider": "Określa, czy edytor ma dostawcę elementów uzupełniania",
  "Whether the editor has a code actions provider": "Określa, czy edytor ma dostawcę akcji kodu",
  "Whether the editor has a code lens provider": "Określa, czy edytor ma dostawcę funkcji CodeLens",
  "Whether the editor has a definition provider": "Określa, czy edytor ma dostawcę definicji",
  "Whether the editor has a declaration provider": "Określa, czy edytor ma dostawcę deklaracji",
  "Whether the editor has an implementation provider": "Określa, czy edytor ma dostawcę implementacji",
  "Whether the editor has a type definition provider": "Określa, czy edytor ma dostawcę definicji typów",
  "Whether the editor has a hover provider": "Określa, czy edytor ma dostawcę obszarów aktywnych",
  "Whether the editor has a document highlight provider": "Określa, czy edytor ma dostawcę wyróżniania dokumentów",
  "Whether the editor has a document symbol provider": "Określa, czy edytor ma dostawcę symboli dokumentów",
  "Whether the editor has a reference provider": "Określa, czy edytor ma dostawcę odwołań",
  "Whether the editor has a rename provider": "Określa, czy edytor ma dostawcę zmian nazw",
  "Whether the editor has a signature help provider": "Określa, czy edytor ma dostawcę pomocy dotyczącej sygnatur",
  "Whether the editor has an inline hints provider": "Określa, czy edytor ma dostawcę wbudowanych wskazówek",
  "Whether the editor has a document formatting provider": "Określa, czy edytor ma dostawcę formatowania dokumentów",
  "Whether the editor has a document selection formatting provider": "Określa, czy edytor ma dostawcę formatowania zaznaczenia dokumentu",
  "Whether the editor has multiple document formatting providers": "Określa, czy edytor ma wielu dostawców formatowania dokumentów",
  "Whether the editor has multiple document selection formatting providers": "Określa, czy edytor ma wielu dostawców formatowania zaznaczenia dokumentu",
  "No selection": "",
  "Line {0}, Column {1} ({2} selected)": "",
  "Line {0}, Column {1}": "",
  "{0} selections ({1} characters selected)": "",
  "{0} selections": "",
  "Now changing the setting `accessibilitySupport` to 'on'.": "",
  "Now opening the Editor Accessibility documentation page.": "Otwieranie strony dokumentacji ułatwień dostępu.",
  " in a read-only pane of a diff editor.": "Znajdujesz się w okienku tylko do odczytu edytora różnic.",
  " in a pane of a diff editor.": "Znajdujesz się w okienku edytora różnic.",
  " in a read-only code editor": "Znajdujesz się w edytorze kodu tylko do odczytu.",
  " in a code editor": "Znajdujesz się w edytorze kodu.",
  "To configure the editor to be optimized for usage with a Screen Reader press Command+E now.": "Skonfiguruj aplikację tak, aby była zoptymalizowana pod kątem korzystania z czytnika ekranu (Command+E).",
  "To configure the editor to be optimized for usage with a Screen Reader press Control+E now.": "Skonfiguruj aplikację tak, aby była zoptymalizowana pod kątem korzystania z czytnika ekranu (Control+E).",
  "The editor is configured to be optimized for usage with a Screen Reader.": "Aplikacja jest skonfigurowana do optymalizacji pod kątem użycia za pomocą czytnika zawartości ekranu.",
  "The editor is configured to never be optimized for usage with a Screen Reader, which is not the case at this time.": "Aplikacja jest skonfigurowana tak, aby nigdy nie była optymalizowana pod kątem użycia za pomocą czytnika zawartości ekranu.",
  "Pressing Tab in the current editor will move focus to the next focusable element. Toggle this behavior by pressing {0}.": "Naciśnięcie klawisza Tab w bieżącym edytorze spowoduje przeniesienie fokusu do następnego elementu, do którego można przenieść fokus. Przełącz to zachowanie{0}.",
  "Pressing Tab in the current editor will move focus to the next focusable element. The command {0} is currently not triggerable by a keybinding.": "",
  "Pressing Tab in the current editor will insert the tab character. Toggle this behavior by pressing {0}.": "Naciśnięcie klawisza Tab w bieżącym edytorze spowoduje wstawienie znaku tabulacji. Przełącz to zachowanie{0}.",
  "Pressing Tab in the current editor will insert the tab character. The command {0} is currently not triggerable by a keybinding.": "",
  "Press Command+H now to open a browser window with more information related to editor accessibility.": "",
  "Press Control+H now to open a browser window with more information related to editor accessibility.": "",
  "You can dismiss this tooltip and return to the editor by pressing Escape or Shift+Escape.": "",
  "Show Accessibility Help": "Pokaż pomoc dotyczącą ułatwień dostępu",
  "Developer: Inspect Tokens": "Deweloper: sprawdź tokeny",
  "Go to Line/Column...": "Przejdź do wiersza/kolumny...",
  "Show all Quick Access Providers": "Pokaż wszystkich dostawców szybkiego dostępu",
  "Command Palette": "Paleta poleceń",
  "Show And Run Commands": "Pokaż i uruchom polecenia",
  "Go to Symbol...": "Przejdź do symbolu...",
  "Go to Symbol by Category...": "Przejdź do symbolu według kategorii...",
  "Editor content": "Zawartość edytora",
  "Press Alt+F1 for Accessibility Options.": "",
  "Toggle High Contrast Theme": "Przełącz motyw o dużym kontraście",
  "Made {0} edits in {1} files": "Dokonano {0} edycji w {1} plikach",
  "Stick to the end even when going to longer lines": "",
  "Removed secondary cursors": "",
  "editor": "",
  "The editor is not accessible at this time. Press {0} for options.": "",
  "The number of cursors has been limited to {0}.": "",
  "Line decoration for inserts in the diff editor.": "",
  "Line decoration for removals in the diff editor.": "",
  "Cannot compare files because one file is too large.": "",
  "Icon for 'Insert' in diff review.": "",
  "Icon for 'Remove' in diff review.": "",
  "Icon for 'Close' in diff review.": "",
  "Close": "Zamknij",
  "no lines changed": "",
  "1 line changed": "",
  "{0} lines changed": "",
  "Difference {0} of {1}: original line {2}, {3}, modified line {4}, {5}": "",
  "blank": "",
  "{0} unchanged line {1}": "",
  "{0} original line {1} modified line {2}": "",
  "+ {0} modified line {1}": "",
  "- {0} original line {1}": "",
  "Go to Next Difference": "",
  "Go to Previous Difference": "",
  "Copy deleted lines": "",
  "Copy deleted line": "",
  "Copy changed lines": "",
  "Copy changed line": "",
  "Copy deleted line ({0})": "",
  "Copy changed line ({0})": "",
  "Revert this change": "",
  "Editor": "Edytor",
  "The number of spaces a tab is equal to. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.": "Liczba spacji, której równy jest tabulator. To ustawienie jest przesłaniane na podstawie zawartości pliku, gdy jest włączona opcja {0}.",
  "Insert spaces when pressing `Tab`. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.": "Wstaw spacje po naciśnięciu klawisza „Tab”. To ustawienie jest przesłaniane na podstawie zawartości pliku, gdy opcja {0} jest włączona.",
  "Controls whether `#editor.tabSize#` and `#editor.insertSpaces#` will be automatically detected when a file is opened based on the file contents.": "Określa, czy {0} i {1} będą automatycznie wykrywane po otwarciu pliku na podstawie zawartości pliku.",
  "Remove trailing auto inserted whitespace.": "Usuń automatycznie wstawiony końcowy znak odstępu.",
  "Special handling for large files to disable certain memory intensive features.": "Specjalna obsługa dużych plików w celu wyłączenia pewnych funkcji intensywnie korzystających z pamięci.",
  "Controls whether completions should be computed based on words in the document.": "Określa, czy uzupełnienia mają być obliczane na podstawie wyrazów w dokumencie i na podstawie tego, z których dokumentów pochodzą.",
  "Only suggest words from the active document.": "",
  "Suggest words from all open documents of the same language.": "",
  "Suggest words from all open documents.": "",
  "Controls from which documents word based completions are computed.": "",
  "Semantic highlighting enabled for all color themes.": "Wyróżnianie semantyczne włączone dla wszystkich motywów kolorów.",
  "Semantic highlighting disabled for all color themes.": "Wyróżnianie semantyczne wyłączone dla wszystkich motywów kolorów.",
  "Semantic highlighting is configured by the current color theme's `semanticHighlighting` setting.": "Wyróżnianie semantyczne jest konfigurowane przez ustawienie „semanticHighlighting” bieżącego motywu kolorów.",
  "Controls whether the semanticHighlighting is shown for the languages that support it.": "Określa, czy element semanticHighlighting jest wyświetlany dla języków, które go obsługują.",
  "Keep peek editors open even when double clicking their content or when hitting `Escape`.": "Zachowuj otwarte edytory wglądu nawet po dwukrotnym kliknięciu ich zawartości lub naciśnięciu klawisza `Escape`.",
  "Lines above this length will not be tokenized for performance reasons": "Wiersze powyżej tej długości nie będą tokenizowane ze względu na wydajność",
  "Defines the bracket symbols that increase or decrease the indentation.": "Definiuje symbole nawiasów, które zwiększają lub zmniejszają wcięcie.",
  "The opening bracket character or string sequence.": "Znak nawiasu otwierającego lub sekwencja ciągu.",
  "The closing bracket character or string sequence.": "Znak nawiasu zamykającego lub sekwencja ciągu.",
  "Defines the bracket pairs that are colorized by their nesting level if bracket pair colorization is enabled.": "Definiuje pary nawiasów, które są koloryzowane według ich poziomu zagnieżdżenia, jeśli opcja kolorowania par nawiasów jest włączona.",
  "Timeout in milliseconds after which diff computation is cancelled. Use 0 for no timeout.": "Limit czasu (w milisekundach), po upływie którego obliczanie różnic jest anulowane. Użyj wartości 0, aby nie ustawiać limitu czasu.",
  "Maximum file size in MB for which to compute diffs. Use 0 for no limit.": "Maksymalny rozmiar pliku w MB, dla którego mają być obliczane różnice. W przypadku braku limitu użyj wartości 0.",
  "Controls whether the diff editor shows the diff side by side or inline.": "Określa, czy edytor różnic pokazuje porównanie obok siebie, czy w trybie śródwierszowym.",
  "When enabled, the diff editor ignores changes in leading or trailing whitespace.": "Po włączeniu tej opcji edytor różnic ignoruje zmiany w wiodącym lub końcowym białym znaku.",
  "Controls whether the diff editor shows +/- indicators for added/removed changes.": "Określa, czy edytor różnic pokazuje wskaźniki +/- dla dodanych/usuniętych zmian.",
  "Controls whether the editor shows CodeLens.": "Określa, czy w edytorze są wyświetlane wskaźniki CodeLens.",
  "Lines will never wrap.": "Wiersze nigdy nie będą zawijane.",
  "Lines will wrap at the viewport width.": "Wiersze będą zawijane przy szerokości okienka ekranu.",
  "Lines will wrap according to the `#editor.wordWrap#` setting.": "Wiersze będą zawijane zgodnie z ustawieniem {0}.",
  "The editor will use platform APIs to detect when a Screen Reader is attached.": "Wykrywanie, kiedy czytnik zawartości ekranu jest dołączony, za pomocą interfejsów API platformy.",
  "The editor will be permanently optimized for usage with a Screen Reader. Word wrapping will be disabled.": "Optymalizowanie pod kątem użycia za pomocą czytnika zawartości ekranu.",
  "The editor will never be optimized for usage with a Screen Reader.": "Załóżmy, że czytnik zawartości ekranu nie jest dołączony.",
  "Controls whether the editor should run in a mode where it is optimized for screen readers. Setting to on will disable word wrapping.": "Określa, czy interfejs użytkownika powinien działać w trybie, w którym jest zoptymalizowany pod kątem czytników zawartości ekranu.",
  "Controls whether a space character is inserted when commenting.": "Określa, czy podczas komentowania jest wstawiany znak spacji.",
  "Controls if empty lines should be ignored with toggle, add or remove actions for line comments.": "Określa, czy puste wiersze mają być ignorowane z akcjami przełącz, dodaj lub usuń dla komentarzy wierszy.",
  "Controls whether copying without a selection copies the current line.": "Określa, czy kopiowanie bez zaznaczenia powoduje skopiowanie bieżącego wiersza.",
  "Controls whether the cursor should jump to find matches while typing.": "Określa, czy kursor powinien przeskakiwać, aby znaleźć dopasowania podczas pisania.",
  "Never seed search string from the editor selection.": "Nigdy nie inicjuj ciągu wyszukiwania z zaznaczenia edytora.",
  "Always seed search string from the editor selection, including word at cursor position.": "Zawsze inicjuj ciąg wyszukiwania z zaznaczenia edytora, w tym wyraz w położeniu kursora.",
  "Only seed search string from the editor selection.": "Inicjuj tylko ciąg wyszukiwania z zaznaczenia edytora.",
  "Controls whether the search string in the Find Widget is seeded from the editor selection.": "Określa, czy ciąg wyszukiwania w widgecie Znajdź jest inicjowany z zaznaczenia w edytorze.",
  "Never turn on Find in Selection automatically (default).": "Nigdy nie włączaj automatycznie opcji Znajdź w zaznaczeniu (ustawienie domyślne).",
  "Always turn on Find in Selection automatically.": "Zawsze automatycznie włączaj opcję Znajdź w zaznaczeniu.",
  "Turn on Find in Selection automatically when multiple lines of content are selected.": "Włączaj opcję Znajdź w zaznaczeniu automatycznie po zaznaczeniu wielu wierszy zawartości.",
  "Controls the condition for turning on Find in Selection automatically.": "Steruje warunkiem automatycznego włączania znajdowania w zaznaczeniu.",
  "Controls whether the Find Widget should read or modify the shared find clipboard on macOS.": "Określa, czy widżet Znajdź powinien odczytywać lub modyfikować udostępniony schowek znajdowania w systemie macOS.",
  "Controls whether the Find Widget should add extra lines on top of the editor. When true, you can scroll beyond the first line when the Find Widget is visible.": "Określa, czy widżet Znajdź ma dodawać dodatkowe wiersze u góry edytora. Jeśli ta opcja ma wartość true, można przewijać poza pierwszy wiersz, gdy widżet Znajdź jest widoczny.",
  "Controls whether the search automatically restarts from the beginning (or the end) when no further matches can be found.": "Określa, czy przeszukiwanie jest automatycznie ponownie uruchamiane od początku (lub końca), gdy nie można znaleźć dalszych dopasowań.",
  "Enables/Disables font ligatures ('calt' and 'liga' font features). Change this to a string for fine-grained control of the 'font-feature-settings' CSS property.": "Włącza/wyłącza ligatury czcionek (funkcje czcionek „calt” i „liga”). Zmień to na ciąg, aby dokładnie sterować właściwością CSS „font-feature-settings”.",
  "Explicit 'font-feature-settings' CSS property. A boolean can be passed instead if one only needs to turn on/off ligatures.": "Jawna właściwość CSS „font-feature-settings”. Zamiast tego można przekazać wartość logiczną, jeśli należy tylko włączyć/wyłączyć ligatury.",
  "Configures font ligatures or font features. Can be either a boolean to enable/disable ligatures or a string for the value of the CSS 'font-feature-settings' property.": "Konfiguruje ligatury czcionek lub funkcje czcionek. Może być wartością logiczną umożliwiającą włączenie/wyłączenie ligatur albo ciągiem określającym wartość właściwości CSS „font-feature-settings”.",
  "Controls the font size in pixels.": "Określa rozmiar czcionki w pikselach.",
  "Only \"normal\" and \"bold\" keywords or numbers between 1 and 1000 are allowed.": "Dozwolone są tylko słowa kluczowe „normal” i „bold” lub liczby z zakresu od 1 do 1000.",
  "Controls the font weight. Accepts \"normal\" and \"bold\" keywords or numbers between 1 and 1000.": "Steruje grubością czcionki. Akceptuje słowa kluczowe „normal” i „bold” lub liczby z zakresu od 1 do 1000.",
  "Show peek view of the results (default)": "Pokaż widok wglądu wyników (domyślnie)",
  "Go to the primary result and show a peek view": "Przejdź do wyniku podstawowego i pokaż widok wglądu",
  "Go to the primary result and enable peek-less navigation to others": "Przejdź do wyniku podstawowego i włącz nawigację bez wglądu do innych",
  "This setting is deprecated, please use separate settings like 'editor.editor.gotoLocation.multipleDefinitions' or 'editor.editor.gotoLocation.multipleImplementations' instead.": "To ustawienie jest przestarzałe, zamiast tego użyj oddzielnych ustawień, takich jak „editor.editor.gotoLocation.multipleDefinitions” lub „editor.editor.gotoLocation.multipleImplementations”.",
  "Controls the behavior the 'Go to Definition'-command when multiple target locations exist.": "Steruje zachowaniem polecenia „Przejdź do definicji”, gdy istnieje wiele lokalizacji docelowych.",
  "Controls the behavior the 'Go to Type Definition'-command when multiple target locations exist.": "Określa zachowanie polecenia „Przejdź do definicji typu”, gdy istnieje wiele lokalizacji docelowych.",
  "Controls the behavior the 'Go to Declaration'-command when multiple target locations exist.": "Steruje zachowaniem polecenia „Przejdź do deklaracji”, gdy istnieje wiele lokalizacji docelowych.",
  "Controls the behavior the 'Go to Implementations'-command when multiple target locations exist.": "Określa zachowanie polecenia „Przejdź do implementacji”, gdy istnieje wiele lokalizacji docelowych.",
  "Controls the behavior the 'Go to References'-command when multiple target locations exist.": "Określa zachowanie polecenia „Przejdź do odwołań”, gdy istnieje wiele lokalizacji docelowych.",
  "Alternative command id that is being executed when the result of 'Go to Definition' is the current location.": "Alternatywny identyfikator polecenia, które jest wykonywane, gdy wynikiem akcji „Przejdź do definicji” jest bieżąca lokalizacja.",
  "Alternative command id that is being executed when the result of 'Go to Type Definition' is the current location.": "Alternatywny identyfikator polecenia, które jest wykonywane, gdy wynikiem akcji „Przejdź do definicji typu” jest bieżąca lokalizacja.",
  "Alternative command id that is being executed when the result of 'Go to Declaration' is the current location.": "Alternatywny identyfikator polecenia, które jest wykonywane, gdy wynikiem akcji „Przejdź do deklaracji” jest bieżąca lokalizacja.",
  "Alternative command id that is being executed when the result of 'Go to Implementation' is the current location.": "Alternatywny identyfikator polecenia, które jest wykonywane, gdy wynikiem akcji „Przejdź do implementacji” jest bieżąca lokalizacja.",
  "Alternative command id that is being executed when the result of 'Go to Reference' is the current location.": "Alternatywny identyfikator polecenia, które jest wykonywane, gdy wynikiem akcji „Przejdź do odwołania” jest bieżąca lokalizacja.",
  "Controls whether the hover is shown.": "Określa, czy aktywowanie ma być pokazywane.",
  "Controls the delay in milliseconds after which the hover is shown.": "Określa opóźnienie w milisekundach, po którym jest wyświetlane aktywowanie.",
  "Controls whether the hover should remain visible when mouse is moved over it.": "Określa, czy aktywowanie powinno pozostać widoczne, gdy wskaźnik myszy zostanie nad nim przesunięty.",
  "Prefer showing hovers above the line, if there's space.": "Preferuj pokazywanie wskaźników myszy nad linią, jeśli jest miejsce.",
  "Enables the code action lightbulb in the editor.": "",
  "Enables the inlay hints in the editor.": "Włącza podpowiedzi śródwierszowe w edytorze.",
  "Controls font size of inlay hints in the editor. A default of 90% of `#editor.fontSize#` is used when the configured value is less than `5` or greater than the editor font size.": "Określa rozmiar czcionki dla wskazówek śródwierszowych w edytorze. Domyślnie jest używana {0}, gdy skonfigurowana wartość jest mniejsza od {1} lub większa od rozmiaru czcionki edytora.",
  "Controls font family of inlay hints in the editor. When set to empty, the `#editor.fontFamily#` is used.": "Określa rodzinę czcionek dla wskazówek śródwierszowych w edytorze. Po ustawieniu pustej wartości używana jest {0}.",
  "Controls the line height. \n - Use 0 to automatically compute the line height from the font size.\n - Values between 0 and 8 will be used as a multiplier with the font size.\n - Values greater than or equal to 8 will be used as effective values.": "Kontroluje wysokość linii. \r\n — użyj wartości 0, aby automatycznie obliczyć wysokość linii na podstawie rozmiaru czcionki.\r\n — wartości w przedziale od 0 do 8 będą używane jako mnożnik z rozmiarem czcionki.\r\n — wartości większe lub równe 8 będą używane jako wartości rzeczywiste.",
  "Controls whether the minimap is shown.": "Określa, czy minimapa jest wyświetlana.",
  "The minimap has the same size as the editor contents (and might scroll).": "Minimapa ma taki sam rozmiar jak zawartość edytora (i może być przewijana).",
  "The minimap will stretch or shrink as necessary to fill the height of the editor (no scrolling).": "Minimapa zostanie rozciągnięta lub zmniejszona w razie potrzeby, aby wypełnić wysokość edytora (bez przewijania).",
  "The minimap will shrink as necessary to never be larger than the editor (no scrolling).": "Minimapa zostanie zmniejszona w razie potrzeby, aby nigdy nie była większa niż edytor (bez przewijania).",
  "Controls the size of the minimap.": "Steruje rozmiarem minimapy.",
  "Controls the side where to render the minimap.": "Określa, po której stronie ma być renderowana minimapa.",
  "Controls when the minimap slider is shown.": "Określa, kiedy jest wyświetlany suwak minimapy.",
  "Scale of content drawn in the minimap: 1, 2 or 3.": "Skala zawartości narysowanej na minimapie: 1, 2 lub 3.",
  "Render the actual characters on a line as opposed to color blocks.": "Renderowanie rzeczywistych znaków w wierszu w przeciwieństwie do bloków koloru.",
  "Limit the width of the minimap to render at most a certain number of columns.": "Ogranicz szerokość minimapy, aby renderować co najwyżej określoną liczbę kolumn.",
  "Controls the amount of space between the top edge of the editor and the first line.": "Kontroluje ilość miejsca między górną krawędzią edytora a pierwszym wierszem.",
  "Controls the amount of space between the bottom edge of the editor and the last line.": "Kontroluje ilość miejsca między dolną krawędzią edytora a ostatnim wierszem.",
  "Enables a pop-up that shows parameter documentation and type information as you type.": "Włącza wyskakujące okienko, które pokazuje dokumentację parametrów i informacje o typie podczas pisania.",
  "Controls whether the parameter hints menu cycles or closes when reaching the end of the list.": "Określa, czy menu podpowiedzi dotyczących parametrów ma być przewijane, czy zamykane po osiągnięciu końca listy.",
  "Enable quick suggestions inside strings.": "Włącz szybkie sugestie wewnątrz ciągów.",
  "Enable quick suggestions inside comments.": "Włącz szybkie sugestie wewnątrz komentarzy.",
  "Enable quick suggestions outside of strings and comments.": "Włącz szybkie sugestie poza ciągami i komentarzami.",
  "Controls whether suggestions should automatically show up while typing.": "Określa, czy sugestie powinny być automatycznie wyświetlane podczas pisania. Można to określać wpisywaniem w komentarzach, ciągach i innym kodzie. Szybką sugestię można skonfigurować tak, aby była wyświetlana jako tekst zduplikowany lub za pomocą widżetu sugestii. Pamiętaj również o ustawieniu {0}, które kontroluje, czy sugestie są wyzwalane przez znaki specjalne.",
  "Line numbers are not rendered.": "Numery wierszy nie są renderowane.",
  "Line numbers are rendered as absolute number.": "Numery wierszy są renderowane jako liczba bezwzględna.",
  "Line numbers are rendered as distance in lines to cursor position.": "Numery wierszy są renderowane jako odległość w wierszach do pozycji kursora.",
  "Line numbers are rendered every 10 lines.": "Numery wierszy są renderowane co 10 wierszy.",
  "Controls the display of line numbers.": "Steruje wyświetlaniem numerów wierszy.",
  "Number of monospace characters at which this editor ruler will render.": "Liczba znaków o stałej szerokości, przy których będzie renderowana ta linijka edytora.",
  "Color of this editor ruler.": "Kolor tej linijki edytora.",
  "Render vertical rulers after a certain number of monospace characters. Use multiple values for multiple rulers. No rulers are drawn if array is empty.": "Renderowanie linijek pionowych po określonej liczbie znaków monotypowych. Używanie wielu wartości dla wielu linijek. Żadne linijki nie są rysowane, jeśli tablica jest pusta.",
  "The vertical scrollbar will be visible only when necessary.": "Pionowy pasek przewijania będzie widoczny tylko wtedy, gdy jest to konieczne.",
  "The vertical scrollbar will always be visible.": "Pionowy pasek przewijania będzie zawsze widoczny.",
  "The vertical scrollbar will always be hidden.": "Pionowy pasek przewijania będzie zawsze ukryty.",
  "Controls the visibility of the vertical scrollbar.": "Kontroluje widoczność pionowego paska przewijania.",
  "The horizontal scrollbar will be visible only when necessary.": "Poziomy pasek przewijania będzie widoczny tylko wtedy, gdy jest to konieczne.",
  "The horizontal scrollbar will always be visible.": "Poziomy pasek przewijania będzie zawsze widoczny.",
  "The horizontal scrollbar will always be hidden.": "Poziomy pasek przewijania będzie zawsze ukryty.",
  "Controls the visibility of the horizontal scrollbar.": "Kontroluje widoczność poziomego paska przewijania.",
  "The width of the vertical scrollbar.": "Szerokość pionowego paska przewijania.",
  "The height of the horizontal scrollbar.": "Wysokość poziomego paska przewijania.",
  "Controls whether clicks scroll by page or jump to click position.": "Kontroluje, czy kliknięcia powodują przewijanie stron czy przeskok do miejsca kliknięcia.",
  "Controls whether all non-basic ASCII characters are highlighted. Only characters between U+0020 and U+007E, tab, line-feed and carriage-return are considered basic ASCII.": "Określa, czy wszystkie znaki ASCII inne niż podstawowe są wyróżnione. Tylko znaki z zakresu od U+0020 do U+007E, tab, line-feed i carriage-return są traktowane jako podstawowe ASCII.",
  "Controls whether characters that just reserve space or have no width at all are highlighted.": "Określa, czy znaki, które tylko rezerwują miejsce lub nie mają żadnej szerokości, są wyróżniane.",
  "Controls whether characters are highlighted that can be confused with basic ASCII characters, except those that are common in the current user locale.": "Określa, czy są wyróżniane znaki, które można pomylić z podstawowymi znakami ASCII, z wyjątkiem tych, które są typowe w bieżących ustawieniach regionalnych użytkownika.",
  "Controls whether characters in comments should also be subject to unicode highlighting.": "Określa, czy znaki w komentarzach również powinny podlegać wyróżnianiu standardu Unicode.",
  "Controls whether characters in strings should also be subject to unicode highlighting.": "Określa, czy znaki w ciągach również powinny podlegać wyróżnianiu standardu Unicode.",
  "Defines allowed characters that are not being highlighted.": "Definiuje dozwolone znaki, które nie są wyróżniane.",
  "Unicode characters that are common in allowed locales are not being highlighted.": "Znaki Unicode, które są wspólne w dozwolonych ustawieniach regionalnych, nie są wyróżniane.",
  "Controls whether to automatically show inline suggestions in the editor.": "Określa, czy automatycznie wyświetlać wbudowane sugestie w edytorze.",
  "Controls whether bracket pair colorization is enabled or not. Use 'workbench.colorCustomizations' to override the bracket highlight colors.": "Określa, czy kolorowanie par nawiasów jest włączone. Użyj {0}, aby zastąpić kolory wyróżnienia nawiasów.",
  "Enables bracket pair guides.": "Włącza prowadnice par nawiasów.",
  "Enables bracket pair guides only for the active bracket pair.": "Włącza prowadnice par nawiasów tylko dla aktywnej pary nawiasów.",
  "Disables bracket pair guides.": "Wyłącza prowadnice par nawiasów.",
  "Controls whether bracket pair guides are enabled or not.": "Określa, czy edytor powinien wyróżniać aktywną parę nawiasów.",
  "Enables horizontal guides as addition to vertical bracket pair guides.": "Włącza prowadnice poziome jako dodatek do prowadnic par nawiasów pionowych.",
  "Enables horizontal guides only for the active bracket pair.": "Włącza prowadnice poziome tylko dla aktywnej pary nawiasów.",
  "Disables horizontal bracket pair guides.": "Wyłącza prowadnice par nawiasów poziomych.",
  "Controls whether horizontal bracket pair guides are enabled or not.": "Steruje, czy włączone są prowadnice pary poziomych nawiasów.",
  "Controls whether the editor should render indent guides.": "Określa, czy edytor ma renderować prowadnice wcięcia.",
  "Controls whether the editor should highlight the active indent guide.": "Określa, czy edytor ma wyróżniać prowadnicę aktywnego wcięcia.",
  "Insert suggestion without overwriting text right of the cursor.": "Wstaw sugestię bez zastępowania tekstu z prawej strony kursora.",
  "Insert suggestion and overwrite text right of the cursor.": "Wstaw sugestię i zastąp tekst z prawej strony kursora.",
  "Controls whether words are overwritten when accepting completions. Note that this depends on extensions opting into this feature.": "Określa, czy wyrazy są zastępowane podczas akceptowania uzupełnień. Należy pamiętać, że zależy to od rozszerzeń korzystających z tej funkcji.",
  "Controls whether filtering and sorting suggestions accounts for small typos.": "Określa, czy sugestie filtrowania i sortowania na kontach uwzględniają małe literówki.",
  "Controls whether sorting favors words that appear close to the cursor.": "Określa, czy sortowanie faworyzuje wyrazy, które pojawiają się w pobliżu kursora.",
  "Controls whether remembered suggestion selections are shared between multiple workspaces and windows (needs `#editor.suggestSelection#`).": "Określa, czy zapamiętane wybory sugestii są współużytkowane przez wiele obszarów roboczych i okien (wymaga ustawienia „#editor.suggestSelection#”).",
  "Controls whether an active snippet prevents quick suggestions.": "Określa, czy aktywny fragment kodu uniemożliwia szybkie sugestie.",
  "Controls whether to show or hide icons in suggestions.": "Określa, czy ikony mają być pokazywane, czy ukrywane w sugestiach.",
  "Controls the visibility of the status bar at the bottom of the suggest widget.": "Steruje widocznością paska stanu u dołu widżetu sugestii.",
  "Controls whether to preview the suggestion outcome in the editor.": "Kontroluje, czy ma być dostępny podgląd wyników sugestii w edytorze.",
  "Controls whether suggest details show inline with the label or only in the details widget": "Określa, czy szczegóły sugestii mają być wyświetlane śródwierszowo z etykietą, czy tylko w widżecie szczegółów.",
  "This setting is deprecated. The suggest widget can now be resized.": "To ustawienie jest przestarzałe. Można teraz zmienić rozmiar widżetu sugestii.",
  "This setting is deprecated, please use separate settings like 'editor.suggest.showKeywords' or 'editor.suggest.showSnippets' instead.": "To ustawienie jest przestarzałe, zamiast tego użyj oddzielnych ustawień, takich jak „editor.suggest.showKeywords” lub „editor.suggest.showSnippets”.",
  "When enabled IntelliSense shows `method`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „method”.",
  "When enabled IntelliSense shows `function`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „function”.",
  "When enabled IntelliSense shows `constructor`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „constructor”.",
  "When enabled IntelliSense shows `deprecated`-suggestions.": "W przypadku włączenia funkcji IntelliSense wyświetla sugestie typu „przestarzałe”.",
  "When enabled IntelliSense shows `field`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „field”.",
  "When enabled IntelliSense shows `variable`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „variable”.",
  "When enabled IntelliSense shows `class`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „class”.",
  "When enabled IntelliSense shows `struct`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „struct”.",
  "When enabled IntelliSense shows `interface`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „interface”.",
  "When enabled IntelliSense shows `module`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „module”.",
  "When enabled IntelliSense shows `property`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „property”.",
  "When enabled IntelliSense shows `event`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „event”.",
  "When enabled IntelliSense shows `operator`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „operator”.",
  "When enabled IntelliSense shows `unit`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „unit”.",
  "When enabled IntelliSense shows `value`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „value”.",
  "When enabled IntelliSense shows `constant`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „constant”.",
  "When enabled IntelliSense shows `enum`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „enum”.",
  "When enabled IntelliSense shows `enumMember`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „enumMember”.",
  "When enabled IntelliSense shows `keyword`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „keyword”.",
  "When enabled IntelliSense shows `text`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „text”.",
  "When enabled IntelliSense shows `color`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „color”.",
  "When enabled IntelliSense shows `file`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „file”.",
  "When enabled IntelliSense shows `reference`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „reference”.",
  "When enabled IntelliSense shows `customcolor`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „customcolor”.",
  "When enabled IntelliSense shows `folder`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „folder”.",
  "When enabled IntelliSense shows `typeParameter`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „typeParameter”.",
  "When enabled IntelliSense shows `snippet`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „snippet”.",
  "When enabled IntelliSense shows `user`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „user”.",
  "When enabled IntelliSense shows `issues`-suggestions.": "W przypadku włączenia tej opcji funkcja IntelliSense wyświetla sugestie „issues”.",
  "Whether leading and trailing whitespace should always be selected.": "Czy biały znak na początku i na końcu powinien być zawsze wybierany.",
  "Controls whether suggestions should be accepted on commit characters. For example, in JavaScript, the semi-colon (`;`) can be a commit character that accepts a suggestion and types that character.": "Określa, czy sugestie powinny być akceptowane w przypadku znaków zatwierdzenia. Na przykład w języku JavaScript średnik („;”) może być znakiem zatwierdzenia, który akceptuje sugestię i wpisuje ten znak.",
  "Only accept a suggestion with `Enter` when it makes a textual change.": "Akceptuj sugestię za pomocą klawisza „Enter” tylko wtedy, gdy wprowadza ona zmianę tekstową.",
  "Controls whether suggestions should be accepted on `Enter`, in addition to `Tab`. Helps to avoid ambiguity between inserting new lines or accepting suggestions.": "Określa, czy sugestie powinny być akceptowane po naciśnięciu klawisza „Enter”, tak jak po naciśnięciu klawisza „Tab”. Pomaga uniknąć niejednoznaczności między wstawianiem nowych wierszy i akceptowaniem sugestii.",
  "Controls the number of lines in the editor that can be read out by a screen reader at once. When we detect a screen reader we automatically set the default to be 500. Warning: this has a performance implication for numbers larger than the default.": "Kontroluje liczbę wierszy w edytorze, które mogą być odczytywane jednocześnie przez czytnik zawartości ekranu. Po wykryciu czytnika zawartości ekranu automatycznie ustawiamy wartość domyślną na 500. Ostrzeżenie: ma to wpływ na wydajność w przypadku wartości większych niż wartość domyślna.",
  "Use language configurations to determine when to autoclose brackets.": "Użyj konfiguracji języka, aby określić, kiedy automatycznie zamykać nawiasy.",
  "Autoclose brackets only when the cursor is to the left of whitespace.": "Automatycznie zamykaj nawiasy tylko wtedy, gdy kursor znajduje się po lewej stronie białego znaku.",
  "Controls whether the editor should automatically close brackets after the user adds an opening bracket.": "Określa, czy edytor ma automatycznie zamykać nawiasy po dodaniu nawiasu otwierającego przez użytkownika.",
  "Remove adjacent closing quotes or brackets only if they were automatically inserted.": "Usuń sąsiadujące zamykające cudzysłowy lub nawiasy kwadratowe tylko wtedy, gdy zostały wstawione automatycznie.",
  "Controls whether the editor should remove adjacent closing quotes or brackets when deleting.": "Określa, czy edytor ma usuwać sąsiadujące zamykające cudzysłowy lub nawiasy kwadratowe podczas usuwania.",
  "Type over closing quotes or brackets only if they were automatically inserted.": "Nadpisuj cudzysłowy lub nawiasy zamykające tylko wtedy, gdy zostały one automatycznie wstawione.",
  "Controls whether the editor should type over closing quotes or brackets.": "Określa, czy edytor powinien nadpisywać cudzysłowy lub nawiasy zamykające.",
  "Use language configurations to determine when to autoclose quotes.": "Użyj konfiguracji języka, aby określić, kiedy automatycznie zamykać cudzysłowy.",
  "Autoclose quotes only when the cursor is to the left of whitespace.": "Automatycznie zamykaj cudzysłowy tylko wtedy, gdy kursor znajduje się po lewej stronie białego znaku.",
  "Controls whether the editor should automatically close quotes after the user adds an opening quote.": "Określa, czy edytor ma automatycznie zamykać cudzysłowy po dodaniu przez użytkownika cudzysłowu otwierającego.",
  "The editor will not insert indentation automatically.": "Edytor nie będzie wstawiać wcięć automatycznie.",
  "The editor will keep the current line's indentation.": "Edytor zachowa wcięcie bieżącego wiersza.",
  "The editor will keep the current line's indentation and honor language defined brackets.": "Edytor zachowa wcięcie bieżącego wiersza i będzie honorować nawiasy zdefiniowane przez język.",
  "The editor will keep the current line's indentation, honor language defined brackets and invoke special onEnterRules defined by languages.": "Edytor zachowa wcięcie bieżącego wiersza, będzie honorować nawiasy zdefiniowane przez język i wywoła specjalne reguły onEnterRules zdefiniowane przez języki.",
  "The editor will keep the current line's indentation, honor language defined brackets, invoke special onEnterRules defined by languages, and honor indentationRules defined by languages.": "Edytor zachowa wcięcie bieżącego wiersza, będzie honorować nawiasy zdefiniowane przez język, wywoływać specjalne reguły onEnterRules zdefiniowane przez języki i honorować reguły indentationRules zdefiniowane przez języki.",
  "Controls whether the editor should automatically adjust the indentation when users type, paste, move or indent lines.": "Określa, czy edytor powinien automatycznie dostosowywać wcięcie, gdy użytkownik wpisuje, wkleja, przenosi lub wcina wiersze.",
  "Use language configurations to determine when to automatically surround selections.": "Użyj konfiguracji języka, aby określić, kiedy automatycznie otaczać zaznaczenia.",
  "Surround with quotes but not brackets.": "Otaczaj za pomocą cudzysłowów, ale nie nawiasów.",
  "Surround with brackets but not quotes.": "Otaczaj za pomocą nawiasów, ale nie cudzysłowów.",
  "Controls whether the editor should automatically surround selections when typing quotes or brackets.": "Określa, czy edytor ma automatycznie otaczać zaznaczenia podczas wpisywania cudzysłowów lub nawiasów.",
  "Emulate selection behavior of tab characters when using spaces for indentation. Selection will stick to tab stops.": "Emuluj zachowanie zaznaczeń znaków tabulacji podczas używania spacji na potrzeby wcięć. Zaznaczanie będzie nadal korzystać z tabulatorów.",
  "Controls the font family for CodeLens.": "Określa rodziną czcionek dla funkcji CodeLens.",
  "Controls the font size in pixels for CodeLens. When set to `0`, 90% of `#editor.fontSize#` is used.": "Określa rozmiar czcionki (w pikselach) dla funkcji CodeLens. Jeśli wartość jest ustawiona na 0, używane jest 90% wartości „#editor.fontSize#”.",
  "Controls whether the editor should render the inline color decorators and color picker.": "Określa, czy edytor ma renderować wbudowane dekoratory kolorów i selektor kolorów.",
  "Enable that the selection with the mouse and keys is doing column selection.": "Zaznaczenie za pomocą myszy i klawiszy powoduje zaznaczenie kolumny.",
  "Controls whether syntax highlighting should be copied into the clipboard.": "Określa, czy wyróżnianie składni ma być kopiowane do schowka.",
  "Control the cursor animation style.": "Kontroluje styl animacji kursora.",
  "Controls whether the smooth caret animation should be enabled.": "Określa, czy ma być włączona płynna animacja karetki.",
  "Controls the cursor style.": "Steruje stylem kursora.",
  "Controls the minimal number of visible leading and trailing lines surrounding the cursor. Known as 'scrollOff' or 'scrollOffset' in some other editors.": "Określa minimalną liczbę widocznych wierszy wiodących (minimum 0) i wierszy końcowych (minimum 1) otaczających kursor. W niektórych edytorach opcja ta nazywana jest „scrollOff” lub „scrollOffset”.",
  "`cursorSurroundingLines` is enforced only when triggered via the keyboard or API.": "element „cursorSurroundingLines” jest wymuszany tylko wtedy, gdy jest wyzwalany za pomocą klawiatury lub interfejsu API.",
  "`cursorSurroundingLines` is enforced always.": "element „cursorSurroundingLines” jest wymuszany zawsze.",
  "Controls when `cursorSurroundingLines` should be enforced.": "Kontroluje, kiedy `#editor.cursorSurroundingLines#` powinien być wymuszany.",
  "Controls the width of the cursor when `#editor.cursorStyle#` is set to `line`.": "Steruje szerokością kursora, gdy ustawienie „#editor.cursorStyle#” ma wartość „line”.",
  "Controls whether the editor should allow moving selections via drag and drop.": "Określa, czy edytor powinien zezwalać na przenoszenie zaznaczeń za pomocą przeciągania i upuszczania.",
  "Scrolling speed multiplier when pressing `Alt`.": "Mnożnik szybkości przewijania podczas naciskania klawisza „Alt”.",
  "Controls whether the editor has code folding enabled.": "Określa, czy w edytorze jest włączone składanie kodu.",
  "Use a language-specific folding strategy if available, else the indentation-based one.": "Użyj strategii składania specyficznej dla języka, jeśli jest dostępna, w przeciwnym razie użyj strategii na podstawie wcięcia.",
  "Use the indentation-based folding strategy.": "Użyj strategii składania opartej na wcięciach.",
  "Controls the strategy for computing folding ranges.": "Określa strategię obliczania zakresów składania.",
  "Controls whether the editor should highlight folded ranges.": "Określa, czy edytor ma wyróżniać złożone zakresy.",
  "Controls whether the editor automatically collapses import ranges.": "Kontroluje, czy edytor automatycznie zwija zakresy importu.",
  "The maximum number of foldable regions. Increasing this value may result in the editor becoming less responsive when the current source has a large number of foldable regions.": "Maksymalna liczba regionów, które można składać. Zwiększenie tej wartości może spowodować, że edytor będzie mniej dynamiczny, gdy bieżące źródło ma dużą liczbę regionów z możliwością składania.",
  "Controls whether clicking on the empty content after a folded line will unfold the line.": "Określa, czy kliknięcie pustej zawartości po złożonym wierszu spowoduje rozwinięcie wiersza.",
  "Controls the font family.": "Określa rodzinę czcionek.",
  "Controls whether the editor should automatically format the pasted content. A formatter must be available and the formatter should be able to format a range in a document.": "Określa, czy edytor ma automatycznie formatować wklejaną zawartość. Program formatujący musi być dostępny i powinien mieć możliwość formatowania zakresu w dokumencie.",
  "Controls whether the editor should automatically format the line after typing.": "Określa, czy edytor ma automatycznie formatować wiersz po wpisaniu.",
  "Controls whether the editor should render the vertical glyph margin. Glyph margin is mostly used for debugging.": "Określa, czy edytor ma renderować pionowy margines symboli. Margines symboli jest najczęściej używany do debugowania.",
  "Controls whether the cursor should be hidden in the overview ruler.": "Określa, czy kursor ma być ukrywany na linijce przeglądu.",
  "Controls the letter spacing in pixels.": "Określa odstępy liter w pikselach.",
  "Controls whether the editor has linked editing enabled. Depending on the language, related symbols, e.g. HTML tags, are updated while editing.": "Określa, czy w edytorze jest włączone edytowanie połączone. Zależnie od języka, powiązane symbole (np. tagi HTML) są aktualizowane podczas edytowania.",
  "Controls whether the editor should detect links and make them clickable.": "Określa, czy edytor powinien wykrywać linki i umożliwiać ich kliknięcie.",
  "Highlight matching brackets.": "Wyróżnij pasujące nawiasy.",
  "A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events.": "Mnożnik, który ma być używany w elementach „deltaX” i „deltaY” zdarzeń przewijania kółka myszy.",
  "Zoom the font of the editor when using mouse wheel and holding `Ctrl`.": "Powiększ czcionkę edytora, gdy jest używane kółko myszy i przytrzymywany klawisz „Ctrl”.",
  "Merge multiple cursors when they are overlapping.": "Scal wiele kursorów, gdy nakładają się na siebie.",
  "Maps to `Control` on Windows and Linux and to `Command` on macOS.": "Mapuje na klawisz „Control” w systemach Windows i Linux oraz na klawisz „Command” w systemie MacOS.",
  "Maps to `Alt` on Windows and Linux and to `Option` on macOS.": "Mapuje na klawisz „Alt” w systemach Windows i Linux oraz na klawisz „Option” w systemie MacOS.",
  "The modifier to be used to add multiple cursors with the mouse. The Go to Definition and Open Link mouse gestures will adapt such that they do not conflict with the multicursor modifier. [Read more](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).": "Modyfikator używany do dodawania wielu kursorów za pomocą myszy. Gesty myszy Przejdź do definicji i Otwórz link zostaną dostosowane w taki sposób, aby nie powodować konfliktu z [multicursor modifier](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).",
  "Each cursor pastes a single line of the text.": "Każdy kursor wkleja pojedynczy wiersz tekstu.",
  "Each cursor pastes the full text.": "Każdy kursor wkleja pełny tekst.",
  "Controls pasting when the line count of the pasted text matches the cursor count.": "Steruje wklejaniem, gdy liczba wierszy wklejanego tekstu odpowiada liczbie kursora.",
  "Controls whether the editor should highlight semantic symbol occurrences.": "Określa, czy wystąpienia mają być wyróżniane w otwartych plikach.",
  "Controls whether a border should be drawn around the overview ruler.": "Określa, czy wokół linijki przeglądu ma być rysowane obramowanie.",
  "Focus the tree when opening peek": "Przenieś fokus do drzewa podczas otwierania wglądu",
  "Focus the editor when opening peek": "Przenieś fokus do edytora podczas otwierania wglądu",
  "Controls whether to focus the inline editor or the tree in the peek widget.": "Określa, czy w widżecie wglądu przenieść fokus do wbudowanego edytora, czy do drzewa.",
  "Controls whether the Go to Definition mouse gesture always opens the peek widget.": "Określa, czy gest myszy Przejdź do definicji zawsze powoduje otwarcie widżetu wglądu.",
  "Controls the delay in milliseconds after which quick suggestions will show up.": "Określa opóźnienie w milisekundach, po którym będą wyświetlane szybkie sugestie.",
  "Controls whether the editor auto renames on type.": "Określa, czy edytor automatycznie zmienia nazwę na typ.",
  "Deprecated, use `editor.linkedEditing` instead.": "Przestarzałe. Zamiast tego użyj elementu „editor.linkedEditing”.",
  "Controls whether the editor should render control characters.": "Określa, czy edytor powinien renderować znaki kontrolne.",
  "Render last line number when the file ends with a newline.": "Renderuj numer ostatniego wiersza, gdy plik kończy się znakiem nowego wiersza.",
  "Highlights both the gutter and the current line.": "Wyróżnia zarówno odstęp, jak i bieżący wiersz.",
  "Controls how the editor should render the current line highlight.": "Określa, w jaki sposób edytor powinien renderować wyróżnienie bieżącego wiersza.",
  "Controls if the editor should render the current line highlight only when the editor is focused.": "Określa, czy edytor powinien renderować wyróżnienie bieżącego wiersza tylko wtedy, gdy fokus znajduje się w edytorze.",
  "Render whitespace characters except for single spaces between words.": "Renderuj znaki odstępu z wyjątkiem pojedynczych spacji między wyrazami.",
  "Render whitespace characters only on selected text.": "Renderuj białe znaki tylko w zaznaczonym tekście.",
  "Render only trailing whitespace characters.": "Renderuj tylko końcowe białe znaki.",
  "Controls how the editor should render whitespace characters.": "Określa, w jaki sposób edytor powinien renderować znaki odstępu.",
  "Controls whether selections should have rounded corners.": "Określa, czy zaznaczenia powinny mieć zaokrąglone rogi.",
  "Controls the number of extra characters beyond which the editor will scroll horizontally.": "Określa liczbę dodatkowych znaków, po których edytor będzie przewijany w poziomie.",
  "Controls whether the editor will scroll beyond the last line.": "Określa, czy edytor umożliwia przewijanie poza ostatni wiersz.",
  "Scroll only along the predominant axis when scrolling both vertically and horizontally at the same time. Prevents horizontal drift when scrolling vertically on a trackpad.": "Przewijanie tylko wzdłuż dominującej osi, gdy przewijasz jednocześnie w pionie i w poziomie. Zapobiega poziomemu dryfowi podczas przewijania pionowego na gładziku.",
  "Controls whether the Linux primary clipboard should be supported.": "Określa, czy podstawowy schowek systemu Linux powinien być obsługiwany.",
  "Controls whether the editor should highlight matches similar to the selection.": "Określa, czy edytor powinien wyróżniać dopasowania podobne do zaznaczenia.",
  "Always show the folding controls.": "Zawsze pokazuj kontrolki składania.",
  "Only show the folding controls when the mouse is over the gutter.": "Pokaż kontrolki składania tylko wtedy, gdy wskaźnik myszy znajduje się nad odstępem.",
  "Controls when the folding controls on the gutter are shown.": "Określa, kiedy są wyświetlane kontrolki składania w obszarze odstępu.",
  "Controls fading out of unused code.": "Steruje zanikaniem nieużywanego kodu.",
  "Controls strikethrough deprecated variables.": "Kontroluje przekreślanie przestarzałych zmiennych.",
  "Show snippet suggestions on top of other suggestions.": "Pokaż sugestie dotyczące fragmentów kodu nad innymi sugestiami.",
  "Show snippet suggestions below other suggestions.": "Pokaż sugestie dotyczące fragmentów kodu pod innymi sugestiami.",
  "Show snippets suggestions with other suggestions.": "Pokaż sugestie dotyczące fragmentów kodu z innymi sugestiami.",
  "Do not show snippet suggestions.": "Nie pokazuj sugestii dotyczących fragmentów kodu.",
  "Controls whether snippets are shown with other suggestions and how they are sorted.": "Określa, czy fragmenty są pokazywane z innymi sugestiami, i jak są sortowane.",
  "Controls whether the editor will scroll using an animation.": "Określa, czy edytor będzie przewijany przy użyciu animacji.",
  "Font size for the suggest widget. When set to `0`, the value of `#editor.fontSize#` is used.": "Rozmiar czcionki dla widżetu sugestii. W przypadku ustawienia na wartość {0} używana jest wartość {1}.",
  "Line height for the suggest widget. When set to `0`, the value of `#editor.lineHeight#` is used. The minimum value is 8.": "Wysokość wiersza dla widżetu sugestii. W przypadku ustawienia na wartość {0} używana jest wartość {1}. Wartość minimalna to 8.",
  "Controls whether suggestions should automatically show up when typing trigger characters.": "Określa, czy sugestie powinny być automatycznie wyświetlane podczas wpisywania znaków wyzwalacza.",
  "Always select the first suggestion.": "Zawsze wybieraj pierwszą sugestię.",
  "Select recent suggestions unless further typing selects one, e.g. `console.| -> console.log` because `log` has been completed recently.": "Wybierz ostatnie sugestie, chyba że dalsze wpisywanie wybierze jedną, np. „console.| -> console.log”, ponieważ element „log” był uzupełniony ostatnio.",
  "Select suggestions based on previous prefixes that have completed those suggestions, e.g. `co -> console` and `con -> const`.": "Wybierz sugestie na podstawie poprzednich prefiksów, które uzupełniły te sugestie, na przykład „co -> console” i „con -> const”.",
  "Controls how suggestions are pre-selected when showing the suggest list.": "Określa sposób wstępnego wybierania sugestii podczas wyświetlania listy sugestii.",
  "Tab complete will insert the best matching suggestion when pressing tab.": "Zakończenie klawiszem Tab spowoduje wstawienie najlepiej pasującej sugestii po naciśnięciu klawisza Tab.",
  "Disable tab completions.": "Wyłącz uzupełnianie po naciśnięciu klawisza Tab.",
  "Tab complete snippets when their prefix match. Works best when 'quickSuggestions' aren't enabled.": "Naciśnięcie klawisza Tab uzupełnia fragmenty kodu, gdy ich prefiks jest zgodny. Sprawdza się najlepiej, gdy sugestie „quickSuggestions” nie są włączone.",
  "Enables tab completions.": "Włącza uzupełnianie za pomocą klawisza Tab.",
  "Unusual line terminators are automatically removed.": "Nietypowe terminatory wierszy są automatycznie usuwane.",
  "Unusual line terminators are ignored.": "Nietypowe terminatory wiersza są ignorowane.",
  "Unusual line terminators prompt to be removed.": "Dla nietypowych terminatorów wiersza wyświetlany jest monit o ich usunięcie.",
  "Remove unusual line terminators that might cause problems.": "Usuń nietypowe terminatory wierszy, które mogą powodować problemy.",
  "Inserting and deleting whitespace follows tab stops.": "Spacje i tabulatory są wstawiane i usuwane zgodnie ze znacznikami tabulacji.",
  "Characters that will be used as word separators when doing word related navigations or operations.": "Znaki, które będą używane jako separatory wyrazów podczas wykonywania nawigacji lub operacji związanych z wyrazami",
  "Lines will wrap at `#editor.wordWrapColumn#`.": "Wiersze będą zawijane zgodnie z ustawieniem „#editor.wordWrapColumn#”.",
  "Lines will wrap at the minimum of viewport and `#editor.wordWrapColumn#`.": "Wiersze będą zawijane przy minimum krawędzi okienka ekranu i szerokości „#editor.wordWrapColumn#”.",
  "Controls how lines should wrap.": "Kontroluje sposób zawijania wierszy.",
  "Controls the wrapping column of the editor when `#editor.wordWrap#` is `wordWrapColumn` or `bounded`.": "Określa kolumnę zawijania edytora, gdy ustawienie „#editor.wordWrap#” ma wartość „wordWrapColumn” lub „bounded”.",
  "No indentation. Wrapped lines begin at column 1.": "Brak wcięcia. Zawijane wiersze zaczynają się w kolumnie 1.",
  "Wrapped lines get the same indentation as the parent.": "Zawinięte wiersze mają takie samo wcięcie jak element nadrzędny.",
  "Wrapped lines get +1 indentation toward the parent.": "Zawinięte wiersze otrzymują wcięcie +1 w kierunku nadrzędnego.",
  "Wrapped lines get +2 indentation toward the parent.": "Zawinięte wiersze otrzymują wcięcie +2 w kierunku nadrzędnego.",
  "Controls the indentation of wrapped lines.": "Steruje wcięciem zawijanych wierszy.",
  "Assumes that all characters are of the same width. This is a fast algorithm that works correctly for monospace fonts and certain scripts (like Latin characters) where glyphs are of equal width.": "Zakłada, że wszystkie znaki mają tę samą szerokość. Jest to szybki algorytm, który działa poprawnie w przypadku czcionek o stałej szerokości i określonych skryptów (takich jak znaki alfabetu łacińskiego), w których symbole mają taką samą szerokość.",
  "Delegates wrapping points computation to the browser. This is a slow algorithm, that might cause freezes for large files, but it works correctly in all cases.": "Deleguje obliczenia punktów zawijania do przeglądarki. Jest to powolny algorytm, który może powodować zawieszanie się w przypadku dużych plików, ale działa poprawnie we wszystkich przypadkach.",
  "Controls the algorithm that computes wrapping points.": "Steruje algorytmem, który oblicza punkty zawijania. Pamiętaj, że w trybie ułatwień dostępu, zaawansowane będą używane w celu uzyskania najlepszego środowiska.",
  "Background color for the highlight of line at the cursor position.": "Kolor tła dla wyróżnienia wiersza w pozycji kursora.",
  "Background color for the border around the line at the cursor position.": "Kolor tła dla obramowania wokół wiersza w pozycji kursora.",
  "Background color of highlighted ranges, like by quick open and find features. The color must not be opaque so as not to hide underlying decorations.": "Kolor tła wyróżnionych zakresów, na przykład przez funkcje szybkiego otwierania i znajdowania. Kolor nie może być nieprzezroczysty, aby nie ukrywać podstawowych dekoracji.",
  "Background color of the border around highlighted ranges.": "Kolor tła obramowania wokół wyróżnionych zakresów.",
  "Background color of highlighted symbol, like for go to definition or go next/previous symbol. The color must not be opaque so as not to hide underlying decorations.": "Kolor tła wyróżnionego symbolu, na przykład dla przejścia do definicji lub do następnego/poprzedniego symbolu. Kolor nie może być nieprzezroczysty, aby nie ukrywać podstawowych dekoracji.",
  "Background color of the border around highlighted symbols.": "Kolor tła obramowania wokół wyróżnionych symboli.",
  "Color of the editor cursor.": "Kolor kursora edytora.",
  "The background color of the editor cursor. Allows customizing the color of a character overlapped by a block cursor.": "Kolor tła kursora edytora. Umożliwia dostosowywanie koloru znaku, na który nakłada się kursor blokowy.",
  "Color of whitespace characters in the editor.": "Kolor białych znaków w edytorze.",
  "Color of the editor indentation guides.": "Kolor prowadnic wcięć edytora.",
  "Color of the active editor indentation guides.": "Kolor aktywnych prowadnic wcięć edytora.",
  "Color of editor line numbers.": "Kolor numerów wierszy edytora.",
  "Color of editor active line number": "Kolor aktywnego numeru wiersza edytora",
  "Id is deprecated. Use 'editorLineNumber.activeForeground' instead.": "Identyfikator jest przestarzały. Zamiast tego użyj właściwości „editorLineNumber.activeForeground”.",
  "Color of the editor rulers.": "Kolor linijek edytora.",
  "Foreground color of editor CodeLens": "Kolor pierwszego planu wskaźników CodeLens edytora",
  "Background color behind matching brackets": "Kolor tła za pasującymi nawiasami",
  "Color for matching brackets boxes": "Kolor pól pasujących nawiasów",
  "Color of the overview ruler border.": "Kolor obramowania linijki przeglądu.",
  "Background color of the editor overview ruler. Only used when the minimap is enabled and placed on the right side of the editor.": "Kolor tła linijki przeglądu edytora.",
  "Background color of the editor gutter. The gutter contains the glyph margins and the line numbers.": "Kolor tła marginesu edytora. Margines zawiera marginesy symboli i numery wierszy.",
  "Border color of unnecessary (unused) source code in the editor.": "Kolor obramowania niepotrzebnego (nieużywanego) kodu źródłowego w edytorze.",
  "Opacity of unnecessary (unused) source code in the editor. For example, \"#000000c0\" will render the code with 75% opacity. For high contrast themes, use the  'editorUnnecessaryCode.border' theme color to underline unnecessary code instead of fading it out.": "Nieprzezroczystość niepotrzebnego (nieużywanego) kodu źródłowego w edytorze. Na przykład „#000000c0” spowoduje renderowanie kodu z nieprzezroczystością 75%. W przypadku motywów o dużym kontraście użyj koloru motywu „editorUnnecessaryCode.border”, aby podkreślić niepotrzebny kod zamiast powodować jego zaniknięcie.",
  "Border color of ghost text in the editor.": "Kolor obramowania tekstu widmo w edytorze.",
  "Foreground color of the ghost text in the editor.": "Kolor pierwszego planu tekstu widma w edytorze.",
  "Background color of the ghost text in the editor.": "Kolor tła dla tekstu widma w edytorze.",
  "Overview ruler marker color for range highlights. The color must not be opaque so as not to hide underlying decorations.": "Kolor znacznika linijki przeglądu na potrzeby wyróżnień zakresów. Kolor nie może być nieprzezroczysty, aby nie ukrywać podstawowych dekoracji.",
  "Overview ruler marker color for errors.": "Kolor znacznika linijki przeglądu dla błędów.",
  "Overview ruler marker color for warnings.": "Kolor znacznika linijki przeglądu dla ostrzeżeń.",
  "Overview ruler marker color for infos.": "Kolor znacznika linijki przeglądu dla informacji.",
  "Foreground color of brackets (1). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (1). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of brackets (2). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (2). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of brackets (3). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (3). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of brackets (4). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (4). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of brackets (5). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (5). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of brackets (6). Requires enabling bracket pair colorization.": "Kolor pierwszego planu nawiasów (6). Wymaga włączenia kolorowania pary nawiasów.",
  "Foreground color of unexpected brackets.": "Kolor pierwszego planu nieoczekiwanych nawiasów kwadratowych.",
  "Background color of inactive bracket pair guides (1). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (1). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of inactive bracket pair guides (2). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (2). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of inactive bracket pair guides (3). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (3). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of inactive bracket pair guides (4). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (4). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of inactive bracket pair guides (5). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (5). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of inactive bracket pair guides (6). Requires enabling bracket pair guides.": "Kolor tła prowadnic par nieaktywnych nawiasów (6). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (1). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (1). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (2). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (2). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (3). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (3). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (4). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (4). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (5). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (5). Wymaga włączenia prowadnic par nawiasów.",
  "Background color of active bracket pair guides (6). Requires enabling bracket pair guides.": "Kolor tła prowadnic par aktywnych nawiasów (6). Wymaga włączenia prowadnic par nawiasów.",
  "Border color used to highlight unicode characters.": "Kolor obramowania używany do wyróżniania znaków Unicode.",
  "Plain Text": "Zwykły tekst",
  "Typing": "Wpisywanie",
  "{0} ({1})": "{0} ({1})",
  "Default Language Configuration Overrides": "Zastąpienia domyślnej konfiguracji języka",
  "Configure settings to be overridden for {0} language.": "Skonfiguruj ustawienia do zastąpienia dla języka {0}.",
  "Configure editor settings to be overridden for a language.": "Skonfiguruj ustawienia edytora do zastąpienia dla języka.",
  "This setting does not support per-language configuration.": "To ustawienie nie obsługuje konfiguracji dla poszczególnych języków.",
  "Cannot register an empty property": "Nie można zarejestrować pustej właściwości",
  "Cannot register '{0}'. This matches property pattern '\\\\[.*\\\\]$' for describing language specific editor settings. Use 'configurationDefaults' contribution.": "Nie można zarejestrować elementu „{0}”. Jest on zgodny ze wzorcem właściwości „\\\\[.*\\\\]$” opisującym ustawienia edytora specyficzne dla języka. Użyj kontrybucji „configurationDefaults”.",
  "Cannot register '{0}'. This property is already registered.": "Nie można zarejestrować elementu „{0}”. Ta właściwość jest już zarejestrowana.",
  "A command that returns information about context keys": "Polecenie, które zwraca informacje o kluczach kontekstu",
  "Whether the operating system is macOS": "Określa, czy system operacyjny to macOS",
  "Whether the operating system is Linux": "Określa, czy system operacyjny to Linux",
  "Whether the operating system is Windows": "Określa, czy system operacyjny to Windows",
  "Whether the platform is a web browser": "Określa, czy platforma to przeglądarka internetowa",
  "Whether the operating system is macOS on a non-browser platform": "Określa, czy system operacyjny to macOS na platformie innej niż przeglądarka",
  "Whether the operating system is IOS": "Czy system operacyjny to iOS",
  "Whether keyboard focus is inside an input box": "Określa, czy fokus klawiatury znajduje się wewnątrz pola wejściowego",
  "({0}) was pressed. Waiting for second key of chord...": "({0}) został naciśnięty. Oczekiwanie na drugi klawisz akordu...",
  "The key combination ({0}, {1}) is not a command.": "Kombinacja klawiszy ({0}, {1}) nie jest poleceniem.",
  "Workbench": "Pulpit",
  "The modifier to be used to add an item in trees and lists to a multi-selection with the mouse (for example in the explorer, open editors and scm view). The 'Open to Side' mouse gestures - if supported - will adapt such that they do not conflict with the multiselect modifier.": "Modyfikator do zastosowania w celu dodania elementu w drzewach i na listach przy wybieraniu wielu elementów za pomocą myszy (na przykład w eksploratorze, przy otwieraniu edytorów i w widoku SCM). Gesty myszy „Otwórz na bok” (jeśli są obsługiwane) dostosują się, tak aby nie powodować konfliktu z modyfikatorem wielokrotnego wyboru.",
  "Controls how to open items in trees and lists using the mouse (if supported). Note that some trees and lists might choose to ignore this setting if it is not applicable.": "Steruje sposobem otwierania elementów w drzewach i na listach za pomocą myszy (jeśli jest to obsługiwane). Pamiętaj, że niektóre drzewa i listy mogą ignorować to ustawienie, jeśli nie ma zastosowania. ",
  "Controls whether lists and trees support horizontal scrolling in the workbench. Warning: turning on this setting has a performance implication.": "Kontroluje, czy listy i drzewa obsługują przewijanie w poziomie w środowisku roboczym. Ostrzeżenie: włączenie tego ustawienia wpływa na wydajność.",
  "Controls tree indentation in pixels.": "Kontroluje wcięcie drzewa w pikselach.",
  "Controls whether the tree should render indent guides.": "Kontroluje, czy drzewo ma wyświetlać prowadnice wcięć.",
  "Controls whether lists and trees have smooth scrolling.": "Kontroluje, czy listy i drzewa są przewijane płynnie.",
  "Simple keyboard navigation focuses elements which match the keyboard input. Matching is done only on prefixes.": "Prosta nawigacja klawiaturą skupia elementy zgodne z sygnałem z klawiatury. Dopasowywanie odbywa się tylko na prefiksach.",
  "Highlight keyboard navigation highlights elements which match the keyboard input. Further up and down navigation will traverse only the highlighted elements.": "Wyróżnij elementy wyróżniania nawigacji za pomocą klawiatury, które pasują do danych wprowadzonych przy użyciu klawiatury. Dalsza nawigacja w górę i w dół będzie odbywać się tylko w ramach wyróżnionych elementów.",
  "Filter keyboard navigation will filter out and hide all the elements which do not match the keyboard input.": "Funkcja filtrowania dla nawigacji za pomocą klawiatury powoduje odfiltrowanie i ukrycie wszystkich elementów, które nie pasują do danych wprowadzonych przy użyciu klawiatury.",
  "Controls the keyboard navigation style for lists and trees in the workbench. Can be simple, highlight and filter.": "Kontroluje styl nawigacji za pomocą klawiatury dla list i drzew na pulpicie. Dostępne są style prosty, wyróżnienia i filtru.",
  "Controls whether keyboard navigation in lists and trees is automatically triggered simply by typing. If set to `false`, keyboard navigation is only triggered when executing the `list.toggleKeyboardNavigation` command, for which you can assign a keyboard shortcut.": "",
  "Controls how tree folders are expanded when clicking the folder names. Note that some trees and lists might choose to ignore this setting if it is not applicable.": "Określa, w jaki sposób foldery drzewiaste są rozwijane po kliknięciu nazw folderów. Pamiętaj, że niektóre drzewa i listy mogą ignorować to ustawienie, jeśli nie ma zastosowania.",
  "Error": "Błąd",
  "Warning": "Ostrzeżenie",
  "Info": "Informacje",
  "{0}, {1}": "{0}, {1}",
  "recently used": "ostatnio używane",
  "other commands": "inne polecenia",
  "Command '{0}' resulted in an error ({1})": "Polecenie „{0}” spowodowało błąd",
  "global commands": "",
  "editor commands": "",
  "Overall foreground color. This color is only used if not overridden by a component.": "",
  "Overall foreground color for error messages. This color is only used if not overridden by a component.": "",
  "Foreground color for description text providing additional information, for example for a label.": "",
  "The default color for icons in the workbench.": "",
  "Overall border color for focused elements. This color is only used if not overridden by a component.": "",
  "An extra border around elements to separate them from others for greater contrast.": "",
  "An extra border around active elements to separate them from others for greater contrast.": "",
  "The background color of text selections in the workbench (e.g. for input fields or text areas). Note that this does not apply to selections within the editor.": "",
  "Color for text separators.": "",
  "Foreground color for links in text.": "",
  "Foreground color for links in text when clicked on and on mouse hover.": "",
  "Foreground color for preformatted text segments.": "",
  "Background color for block quotes in text.": "",
  "Border color for block quotes in text.": "",
  "Background color for code blocks in text.": "",
  "Shadow color of widgets such as find/replace inside the editor.": "",
  "Input box background.": "",
  "Input box foreground.": "",
  "Input box border.": "",
  "Border color of activated options in input fields.": "",
  "Background color of activated options in input fields.": "",
  "Background hover color of options in input fields.": "",
  "Foreground color of activated options in input fields.": "",
  "Input box foreground color for placeholder text.": "",
  "Input validation background color for information severity.": "",
  "Input validation foreground color for information severity.": "",
  "Input validation border color for information severity.": "",
  "Input validation background color for warning severity.": "",
  "Input validation foreground color for warning severity.": "",
  "Input validation border color for warning severity.": "",
  "Input validation background color for error severity.": "",
  "Input validation foreground color for error severity.": "",
  "Input validation border color for error severity.": "",
  "Dropdown background.": "",
  "Dropdown list background.": "",
  "Dropdown foreground.": "",
  "Dropdown border.": "",
  "Background color of checkbox widget.": "",
  "Foreground color of checkbox widget.": "",
  "Border color of checkbox widget.": "",
  "Button foreground color.": "",
  "Button background color.": "",
  "Button background color when hovering.": "",
  "Button border color.": "",
  "Secondary button foreground color.": "",
  "Secondary button background color.": "",
  "Secondary button background color when hovering.": "",
  "Badge background color. Badges are small information labels, e.g. for search results count.": "",
  "Badge foreground color. Badges are small information labels, e.g. for search results count.": "",
  "Scrollbar shadow to indicate that the view is scrolled.": "",
  "Scrollbar slider background color.": "",
  "Scrollbar slider background color when hovering.": "",
  "Scrollbar slider background color when clicked on.": "",
  "Background color of the progress bar that can show for long running operations.": "",
  "Background color of error text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of error squigglies in the editor.": "",
  "Border color of error boxes in the editor.": "",
  "Background color of warning text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of warning squigglies in the editor.": "",
  "Border color of warning boxes in the editor.": "",
  "Background color of info text in the editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Foreground color of info squigglies in the editor.": "",
  "Border color of info boxes in the editor.": "",
  "Foreground color of hint squigglies in the editor.": "",
  "Border color of hint boxes in the editor.": "",
  "Border color of active sashes.": "",
  "Editor background color.": "",
  "Editor default foreground color.": "",
  "Background color of editor widgets, such as find/replace.": "",
  "Foreground color of editor widgets, such as find/replace.": "",
  "Border color of editor widgets. The color is only used if the widget chooses to have a border and if the color is not overridden by a widget.": "",
  "Border color of the resize bar of editor widgets. The color is only used if the widget chooses to have a resize border and if the color is not overridden by a widget.": "",
  "Quick picker background color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker foreground color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker title background color. The quick picker widget is the container for pickers like the command palette.": "",
  "Quick picker color for grouping labels.": "",
  "Quick picker color for grouping borders.": "",
  "Keybinding label background color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label foreground color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label border color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Keybinding label border bottom color. The keybinding label is used to represent a keyboard shortcut.": "",
  "Color of the editor selection.": "",
  "Color of the selected text for high contrast.": "",
  "Color of the selection in an inactive editor. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color for regions with the same content as the selection. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color for regions with the same content as the selection.": "",
  "Color of the current search match.": "",
  "Color of the other search matches. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color of the current search match.": "",
  "Border color of the other search matches.": "",
  "Border color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the Search Editor query matches.": "",
  "Border color of the Search Editor query matches.": "",
  "Highlight below the word for which a hover is shown. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color of the editor hover.": "",
  "Foreground color of the editor hover.": "",
  "Border color of the editor hover.": "",
  "Background color of the editor hover status bar.": "",
  "Color of active links.": "",
  "Foreground color of inline hints": "",
  "Background color of inline hints": "",
  "Foreground color of inline hints for types": "",
  "Background color of inline hints for types": "",
  "Foreground color of inline hints for parameters": "",
  "Background color of inline hints for parameters": "",
  "The color used for the lightbulb actions icon.": "",
  "The color used for the lightbulb auto fix actions icon.": "",
  "Background color for text that got inserted. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color for text that got removed. The color must not be opaque so as not to hide underlying decorations.": "",
  "Outline color for the text that got inserted.": "",
  "Outline color for text that got removed.": "",
  "Border color between the two text editors.": "",
  "Color of the diff editor's diagonal fill. The diagonal fill is used in side-by-side diff views.": "",
  "List/Tree background color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree outline color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree icon foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree icon foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree outline color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.": "",
  "List/Tree background when hovering over items using the mouse.": "",
  "List/Tree foreground when hovering over items using the mouse.": "",
  "List/Tree drag and drop background when moving items around using the mouse.": "",
  "List/Tree foreground color of the match highlights when searching inside the list/tree.": "",
  "List/Tree foreground color of the match highlights on actively focused items when searching inside the list/tree.": "",
  "List/Tree foreground color for invalid items, for example an unresolved root in explorer.": "",
  "Foreground color of list items containing errors.": "",
  "Foreground color of list items containing warnings.": "",
  "Background color of the type filter widget in lists and trees.": "",
  "Outline color of the type filter widget in lists and trees.": "",
  "Outline color of the type filter widget in lists and trees, when there are no matches.": "",
  "Background color of the filtered match.": "",
  "Border color of the filtered match.": "",
  "Tree stroke color for the indentation guides.": "",
  "Table border color between columns.": "",
  "Background color for odd table rows.": "",
  "List/Tree foreground color for items that are deemphasized. ": "",
  "Please use quickInputList.focusBackground instead": "",
  "Quick picker foreground color for the focused item.": "",
  "Quick picker icon foreground color for the focused item.": "",
  "Quick picker background color for the focused item.": "",
  "Border color of menus.": "",
  "Foreground color of menu items.": "",
  "Background color of menu items.": "",
  "Foreground color of the selected menu item in menus.": "",
  "Background color of the selected menu item in menus.": "",
  "Border color of the selected menu item in menus.": "",
  "Color of a separator menu item in menus.": "",
  "Toolbar background when hovering over actions using the mouse": "",
  "Toolbar outline when hovering over actions using the mouse": "",
  "Toolbar background when holding the mouse over actions": "",
  "Highlight background color of a snippet tabstop.": "",
  "Highlight border color of a snippet tabstop.": "",
  "Highlight background color of the final tabstop of a snippet.": "",
  "Highlight border color of the final tabstop of a snippet.": "",
  "Color of focused breadcrumb items.": "",
  "Background color of breadcrumb items.": "",
  "Color of selected breadcrumb items.": "",
  "Background color of breadcrumb item picker.": "",
  "Current header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Current content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Incoming header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Incoming content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Common ancestor header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Common ancestor content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color on headers and the splitter in inline merge-conflicts.": "",
  "Current overview ruler foreground for inline merge-conflicts.": "",
  "Incoming overview ruler foreground for inline merge-conflicts.": "",
  "Common ancestor overview ruler foreground for inline merge-conflicts.": "",
  "Overview ruler marker color for find matches. The color must not be opaque so as not to hide underlying decorations.": "",
  "Overview ruler marker color for selection highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Minimap marker color for find matches.": "",
  "Minimap marker color for repeating editor selections.": "",
  "Minimap marker color for the editor selection.": "",
  "Minimap marker color for errors.": "",
  "Minimap marker color for warnings.": "",
  "Minimap background color.": "",
  "Opacity of foreground elements rendered in the minimap. For example, \"#000000c0\" will render the elements with 75% opacity.": "",
  "Minimap slider background color.": "",
  "Minimap slider background color when hovering.": "",
  "Minimap slider background color when clicked on.": "",
  "The color used for the problems error icon.": "",
  "The color used for the problems warning icon.": "",
  "The color used for the problems info icon.": "",
  "The foreground color used in charts.": "",
  "The color used for horizontal lines in charts.": "",
  "The red color used in chart visualizations.": "",
  "The blue color used in chart visualizations.": "",
  "The yellow color used in chart visualizations.": "",
  "The orange color used in chart visualizations.": "",
  "The green color used in chart visualizations.": "",
  "The purple color used in chart visualizations.": "",
  "The id of the font to use. If not set, the font that is defined first is used.": "",
  "The font character associated with the icon definition.": "",
  "Icon for the close action in widgets.": "Ikona akcji zamknięcia w widżetach.",
  "Icon for goto previous editor location.": "Ikona przechodzenia do poprzedniej lokalizacji edytora.",
  "Icon for goto next editor location.": "Ikona przechodzenia do następnej lokalizacji edytora.",
  "The following files have been closed and modified on disk: {0}.": "Następujące pliki zostały zamknięte i zmodyfikowane na dysku: {0}.",
  "The following files have been modified in an incompatible way: {0}.": "Następujące pliki zostały zmodyfikowane w niezgodny sposób: {0}.",
  "Could not undo '{0}' across all files. {1}": "Nie można cofnąć operacji „{0}” dla wszystkich plików. {1}",
  "Could not undo '{0}' across all files because changes were made to {1}": "Nie można cofnąć operacji „{0}” dla wszystkich plików, ponieważ wprowadzono zmiany w plikach {1}",
  "Could not undo '{0}' across all files because there is already an undo or redo operation running on {1}": "Nie można cofnąć operacji „{0}” dla wszystkich plików, ponieważ istnieje już operacja cofania lub ponownego uruchomienia dla plików {1}",
  "Could not undo '{0}' across all files because an undo or redo operation occurred in the meantime": "Nie można cofnąć operacji „{0}” dla wszystkich plików, ponieważ w międzyczasie miała miejsce operacja cofania lub ponownego wykonania",
  "Would you like to undo '{0}' across all files?": "Czy chcesz cofnąć operację „{0}” dla wszystkich plików?",
  "Undo in {0} Files": "&&Cofnij w {0} plikach",
  "Undo this File": "Cofnij ten &&plik",
  "Cancel": "",
  "Could not undo '{0}' because there is already an undo or redo operation running.": "Nie można cofnąć operacji „{0}”, ponieważ jest już uruchomiona operacja cofania lub ponownego wykonania.",
  "Would you like to undo '{0}'?": "Czy chcesz cofnąć operację „{0}”?",
  "Yes": "&&Tak",
  "No": "Nie",
  "Could not redo '{0}' across all files. {1}": "Nie można wykonać ponownie operacji „{0}” dla wszystkich plików. {1}",
  "Could not redo '{0}' across all files because changes were made to {1}": "Nie można wykonać ponownie operacji „{0}” dla wszystkich plików, ponieważ wprowadzono zmiany dla plików {1}",
  "Could not redo '{0}' across all files because there is already an undo or redo operation running on {1}": "Nie można wykonać ponownie operacji „{0}” dla wszystkich plików, ponieważ operacja cofania lub ponownego wykonania jest już uruchomiona dla plików {1}",
  "Could not redo '{0}' across all files because an undo or redo operation occurred in the meantime": "Nie można wykonać ponownie operacji „{0}” dla wszystkich plików, ponieważ w międzyczasie miała miejsce operacja cofania lub ponownego wykonania",
  "Could not redo '{0}' because there is already an undo or redo operation running.": "Nie można wykonać ponownie operacji „{0}”, ponieważ jest już uruchomiona operacja cofania lub ponownego wykonania.",
  "Code Workspace": "",
  "input": "wejście",
  "Match Case": "",
  "Match Whole Word": "",
  "Use Regular Expression": "",
  "Preserve Case": "",
  "Loading...": "Trwa ładowanie...",
  "Error: {0}": "Błąd: {0}",
  "Warning: {0}": "Ostrzeżenie: {0}",
  "Info: {0}": "Informacje: {0}",
  "for history": "",
  "Unbound": "Niepowiązany",
  "Clear": "",
  "Disable Filter on Type": "",
  "Enable Filter on Type": "",
  "No elements found": "",
  "Matched {0} out of {1} elements": "",
  "Back": "",
  "{0}/{1}": "",
  "Press 'Enter' to confirm your input or 'Escape' to cancel": "",
  "Type to narrow down results.": "",
  "{0} Results": "",
  "{0} Selected": "",
  "OK": "",
  "Custom": "",
  "Back ({0})": "",
  "Quick Input": "",
  "Selection Anchor": "Zakotwiczenie zaznaczenia",
  "Anchor set at {0}:{1}": "Zestaw zakotwiczenia w {0}: {1}",
  "Set Selection Anchor": "Ustaw zakotwiczenia zaznaczenia",
  "Go to Selection Anchor": "Przejdź do zakotwiczenia zaznaczenia",
  "Select from Anchor to Cursor": "Zaznacz od zakotwiczenia do kursora",
  "Cancel Selection Anchor": "Anuluj zakotwiczenie zaznaczenia",
  "Overview ruler marker color for matching brackets.": "Kolor znacznika linijki przeglądu dla pasujących nawiasów.",
  "Go to Bracket": "Przejdź do nawiasu",
  "Select to Bracket": "Zaznacz do nawiasu",
  "Go to &&Bracket": "Przejdź do &&nawiasu",
  "Move Selected Text Left": "Przenieś zaznaczony tekst w lewo",
  "Move Selected Text Right": "Przesuń zaznaczony tekst w prawo",
  "Transpose Letters": "Transponuj litery",
  "Cu&&t": "Wy&&tnij",
  "Cut": "Wytnij",
  "&&Copy": "&&Kopiuj",
  "Copy": "Kopiuj",
  "Copy As": "Kopiuj jako",
  "&&Paste": "&&Wklej",
  "Paste": "Wklej",
  "Copy With Syntax Highlighting": "Kopiuj z wyróżnieniem składni",
  "Kind of the code action to run.": "Rodzaj akcji kodu do uruchomienia.",
  "Controls when the returned actions are applied.": "Steruje stosowaniem zwracanych akcji.",
  "Always apply the first returned code action.": "Zawsze stosuj pierwszą zwróconą akcję kodu.",
  "Apply the first returned code action if it is the only one.": "Zastosuj pierwszą zwróconą akcję kodu, jeśli jest jedyna.",
  "Do not apply the returned code actions.": "Nie stosuj zwróconych akcji kodu.",
  "Controls if only preferred code actions should be returned.": "Kontroluje, czy powinny być zwracane tylko preferowane akcje kodu.",
  "An unknown error occurred while applying the code action": "",
  "Quick Fix...": "Szybka poprawka...",
  "No code actions available": "Brak dostępnych akcji kodu",
  "No preferred code actions for '{0}' available": "Brak dostępnych preferowanych akcji kodu dla elementu „{0}”",
  "No code actions for '{0}' available": "Brak dostępnych akcji kodu dla elementu „{0}”",
  "No preferred code actions available": "Brak dostępnych preferowanych akcji kodu",
  "Refactor...": "Refaktoryzuj...",
  "No preferred refactorings for '{0}' available": "Brak dostępnych preferowanych refaktoryzacji dla elementu „{0}”",
  "No refactorings for '{0}' available": "Brak dostępnych refaktoryzacji dla elementu „{0}”",
  "No preferred refactorings available": "Brak dostępnych preferowanych refaktoryzacji",
  "No refactorings available": "Brak dostępnych refaktoryzacji",
  "Source Action...": "Akcja źródłowa...",
  "No preferred source actions for '{0}' available": "Brak dostępnych preferowanych akcji źródłowych dla elementu „{0}”",
  "No source actions for '{0}' available": "Brak dostępnych akcji źródłowych dla elementu „{0}”",
  "No preferred source actions available": "Brak dostępnych preferowanych akcji źródłowych",
  "No source actions available": "Brak dostępnych akcji źródłowych",
  "Organize Imports": "Organizuj importy",
  "No organize imports action available": "Brak dostępnej akcji organizowania importów",
  "Fix All": "Napraw wszystko",
  "No fix all action available": "Brak dostępnej akcji naprawienia wszystkiego",
  "Auto Fix...": "Popraw automatycznie...",
  "No auto fixes available": "Brak dostępnych automatycznych poprawek",
  "Show Code Actions. Preferred Quick Fix Available ({0})": "Pokaż akcje kodu. Preferowana szybka poprawka jest dostępna ({0})",
  "Show Code Actions ({0})": "Pokaż akcje kodu ({0})",
  "Show Code Actions": "Pokaż akcje kodu",
  "Show CodeLens Commands For Current Line": "Pokaż polecenia CodeLens dla bieżącego wiersza",
  "Click to toggle color options (rgb/hsl/hex)": "",
  "Toggle Line Comment": "Przełącz komentarz wiersza",
  "&&Toggle Line Comment": "&&Przełącz komentarz wiersza",
  "Add Line Comment": "Dodaj komentarz wiersza",
  "Remove Line Comment": "Usuń komentarz wiersza",
  "Toggle Block Comment": "Przełącz komentarz blokowy",
  "Toggle &&Block Comment": "Przełącz komentarz &&blokowy",
  "Show Editor Context Menu": "Pokaż menu kontekstowe edytora",
  "Cursor Undo": "Cofnij kursor",
  "Cursor Redo": "Wykonaj ponownie kursor",
  "Whether the editor runs a cancellable operation, e.g. like 'Peek References'": "Czy w edytorze jest uruchamiana operacja możliwa do anulowania, na przykład „Wgląd w odwołania”",
  "Find": "Znajdź",
  "&&Find": "&&Znajdź",
  "Overrides \"Use Regular Expression\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Match Whole Word\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Math Case\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Overrides \"Preserve Case\" flag.\nThe flag will not be saved for the future.\n0: Do Nothing\n1: True\n2: False": "",
  "Find With Arguments": "Znajdź z argumentami",
  "Find With Selection": "Znajdź z zaznaczeniem",
  "Find Next": "Znajdź następny",
  "Find Previous": "Znajdź poprzedni",
  "Find Next Selection": "Znajdź następne zaznaczenie",
  "Find Previous Selection": "Znajdź poprzednie zaznaczenie",
  "Replace": "Zamień",
  "&&Replace": "&&Zamień",
  "Icon for 'Find in Selection' in the editor find widget.": "Ikona polecenia „Znajdź w zaznaczeniu” w widżecie znajdowania w edytorze.",
  "Icon to indicate that the editor find widget is collapsed.": "Ikona wskazująca, że widżet znajdowania w edytorze jest zwinięty.",
  "Icon to indicate that the editor find widget is expanded.": "Ikona wskazująca, że widżet znajdowania w edytorze jest rozwinięty.",
  "Icon for 'Replace' in the editor find widget.": "Ikona polecenia „Zamień” w widżecie znajdowania w edytorze.",
  "Icon for 'Replace All' in the editor find widget.": "Ikona polecenia „Zamień wszystko” w widżecie znajdowania w edytorze.",
  "Icon for 'Find Previous' in the editor find widget.": "Ikona polecenia „Znajdź poprzedni” w widżecie znajdowania w edytorze.",
  "Icon for 'Find Next' in the editor find widget.": "Ikona polecenia „Znajdź następny” w widżecie znajdowania w edytorze.",
  "Previous Match": "Poprzednie dopasowanie",
  "Next Match": "Następne dopasowanie",
  "Find in Selection": "Znajdź w zaznaczeniu",
  "Replace All": "Zamień wszystko",
  "Toggle Replace": "Przełącz zastępowanie",
  "Only the first {0} results are highlighted, but all find operations work on the entire text.": "Tylko pierwsze wyniki ({0}) są wyróżnione, ale wszystkie operacje znajdowania działają na całym tekście.",
  "{0} of {1}": "{0} z {1}",
  "No results": "Brak wyników",
  "{0} found": "znaleziono: {0}",
  "{0} found for '{1}'": "Znaleziono {0} dla „{1}”",
  "{0} found for '{1}', at {2}": "znaleziono {0} dla „{1}” w {2}",
  "Ctrl+Enter now inserts line break instead of replacing all. You can modify the keybinding for editor.action.replaceAll to override this behavior.": "Kombinacja klawiszy Ctrl+Enter teraz wstawia podział wiersza zamiast powodować zastąpienie wszystkiego. Możesz zmodyfikować powiązanie klawiszy dla elementu editor.action.replaceAll, aby zastąpić to zachowanie.",
  "The number of foldable regions is limited to a maximum of {0}. Increase configuration option ['Folding Maximum Regions'](command:workbench.action.openSettings?[\"editor.foldingMaximumRegions\"]) to enable more.": "",
  "Unfold": "Rozłóż",
  "Unfold Recursively": "Rozłóż rekursywnie",
  "Fold": "Złóż",
  "Toggle Fold": "Przełącz złożenie",
  "Fold Recursively": "Składaj cyklicznie",
  "Fold All Block Comments": "Złóż wszystkie komentarze blokowe",
  "Fold All Regions": "Złóż wszystkie regiony",
  "Unfold All Regions": "Rozłóż wszystkie regiony",
  "Fold All Regions Except Selected": "Zwiń wszystko z wyjątkiem zaznaczonych",
  "Unfold All Regions Except Selected": "Rozwiń wszystko z wyjątkiem zaznaczonych",
  "Fold All": "Złóż wszystko",
  "Unfold All": "Rozłóż wszystko",
  "Go to Parent Fold": "Przeskocz do składania nadrzędnego",
  "Go to Previous Folding Range": "Przejdź do poprzedniego zakresu składania",
  "Go to Next Folding Range": "Przejdź do następnego zakresu składania",
  "Fold Level {0}": "Poziom składania {0}",
  "Background color behind folded ranges. The color must not be opaque so as not to hide underlying decorations.": "",
  "Color of the folding control in the editor gutter.": "",
  "Icon for expanded ranges in the editor glyph margin.": "Ikona dla rozwiniętych zakresów na marginesie symboli edytora.",
  "Icon for collapsed ranges in the editor glyph margin.": "Ikona zwiniętych zakresów na marginesie symboli edytora.",
  "Editor Font Zoom In": "Zwiększ rozmiar czcionki edytora",
  "Editor Font Zoom Out": "Zmniejsz rozmiar czcionki edytora",
  "Editor Font Zoom Reset": "Resetuj rozmiar czcionki edytora",
  "Made 1 formatting edit on line {0}": "",
  "Made {0} formatting edits on line {1}": "",
  "Made 1 formatting edit between lines {0} and {1}": "",
  "Made {0} formatting edits between lines {1} and {2}": "",
  "Format Document": "Formatuj dokument",
  "Format Selection": "Formatuj zaznaczenie",
  "Icon for goto next marker.": "Ikona do przechodzenia do następnego znacznika.",
  "Go to Next Problem (Error, Warning, Info)": "Przejdź do następnego problemu (błąd, ostrzeżenie, informacje)",
  "Icon for goto previous marker.": "Ikona do przechodzenia do poprzedniego znacznika.",
  "Go to Previous Problem (Error, Warning, Info)": "Przejdź do poprzedniego problemu (błąd, ostrzeżenie, informacje)",
  "Go to Next Problem in Files (Error, Warning, Info)": "Przejdź do następnego problemu w plikach (błąd, ostrzeżenie, informacje)",
  "Next &&Problem": "Następny &&problem",
  "Go to Previous Problem in Files (Error, Warning, Info)": "Przejdź do poprzedniego problemu w plikach (błąd, ostrzeżenie, informacje)",
  "Previous &&Problem": "Poprzedni &&problem",
  "Hint": "Wskazówka",
  "{0} at {1}. ": "{0} w {1}. ",
  "{0} of {1} problems": "{0} z {1} problemów",
  "{0} of {1} problem": "{0} z {1} problemu",
  "Editor marker navigation widget error color.": "Kolor błędu widgetu nawigacji po znacznikach w edytorze.",
  "Editor marker navigation widget error heading background.": "Tło nagłówka błędów dla widżetu nawigowania po znacznikach w edytorze.",
  "Editor marker navigation widget warning color.": "Kolor ostrzeżenia widgetu nawigacji po znacznikach w edytorze.",
  "Editor marker navigation widget warning heading background.": "Tło nagłówka ostrzeżeń dla widżetu nawigowania po znacznikach w edytorze.",
  "Editor marker navigation widget info color.": "Kolor informacji widgetu nawigacji po znacznikach w edytorze.",
  "Editor marker navigation widget info heading background.": "Tło nagłówka informacji dla widżetu nawigowania po znacznikach w edytorze.",
  "Editor marker navigation widget background.": "Tło widgetu nawigacji po znacznikach w edytorze.",
  "Peek": "Wgląd",
  "Definitions": "Definicje",
  "No definition found for '{0}'": "Nie znaleziono definicji dla elementu „{0}”",
  "No definition found": "Nie znaleziono definicji",
  "Go to Definition": "Przejdź do definicji",
  "Open Definition to the Side": "Otwórz definicję z boku",
  "Peek Definition": "Wgląd w definicję",
  "Declarations": "Deklaracje",
  "No declaration found for '{0}'": "Nie znaleziono deklaracji dla elementu „{0}”",
  "No declaration found": "Nie znaleziono deklaracji",
  "Go to Declaration": "Przejdź do deklaracji",
  "Peek Declaration": "Wgląd w deklarację",
  "Type Definitions": "Definicje typów",
  "No type definition found for '{0}'": "Nie znaleziono definicji typu dla elementu „{0}”",
  "No type definition found": "Nie znaleziono definicji typu",
  "Go to Type Definition": "Przejdź do definicji typu",
  "Peek Type Definition": "Wgląd w definicję typu",
  "Implementations": "Implementacje",
  "No implementation found for '{0}'": "Nie znaleziono implementacji dla elementu „{0}”",
  "No implementation found": "Nie znaleziono implementacji",
  "Go to Implementations": "Przejdź do implementacji",
  "Peek Implementations": "Wgląd w implementację",
  "No references found for '{0}'": "Nie referencji dla elementu „{0}”",
  "No references found": "Nie znaleziono referencji",
  "Go to References": "Przejdź do odwołań",
  "References": "Odwołania",
  "Peek References": "Wgląd w odwołania",
  "Go to Any Symbol": "Przejdź do dowolnego symbolu",
  "Locations": "Lokalizacje",
  "No results for '{0}'": "Brak wyników dla użytkownika „{0}”",
  "Go to &&Definition": "Przejdź do &&definicji",
  "Go to &&Declaration": "Przejdź do &&deklaracji",
  "Go to &&Type Definition": "Przejdź do &&definicji typu",
  "Go to &&Implementations": "Przejdź do &&implementacji",
  "Go to &&References": "Przejdź do &&odwołań",
  "symbol in {0} on line {1} at column {2}": "w {0} w wierszu {1} w kolumnie {2}",
  "symbol in {0} on line {1} at column {2}, {3}": "{0}w {1} w wierszu {2} w kolumnie {3}",
  "1 symbol in {0}, full path {1}": "1 symbol w {0}, pełna ścieżka {1}",
  "{0} symbols in {1}, full path {2}": "Symbole w liczbie {0} w elemencie {1}, pełna ścieżka {2}",
  "No results found": "Nie znaleziono wyników",
  "Found 1 symbol in {0}": "Znaleziono 1 symbol w {0}",
  "Found {0} symbols in {1}": "Znaleziono {0} symbole w {1}",
  "Found {0} symbols in {1} files": "Znaleziono {0} symbole w {1} plikach",
  "Whether there are symbol locations that can be navigated via keyboard-only.": "Określa, czy istnieją lokalizacje symboli, do których można przechodzić tylko za pomocą klawiatury.",
  "Symbol {0} of {1}, {2} for next": "Symbol {0} z {1}, {2} dla następnego",
  "Symbol {0} of {1}": "Symbol {0} z {1}",
  "Show Hover": "",
  "Show Definition Preview Hover": "",
  "Tokenization is skipped for long lines for performance reasons. This can be configured via `editor.maxTokenizationLineLength`.": "Tokenizacja jest pomijana dla długich wierszy ze względu na wydajność. Można to skonfigurować za pośrednictwem elementu „editor.maxTokenizationLineLength”.",
  "View Problem": "Wyświetl problem",
  "No quick fixes available": "Brak dostępnych szybkich poprawek",
  "Checking for quick fixes...": "Sprawdzanie szybkich poprawek...",
  "Convert Indentation to Spaces": "Konwertuj wcięcia na spacje",
  "Convert Indentation to Tabs": "Konwertuj wcięcia na tabulatory",
  "Configured Tab Size": "Skonfigurowany rozmiar karty",
  "Select Tab Size for Current File": "Wybierz rozmiar tabulatora dla bieżącego pliku",
  "Indent Using Tabs": "Wcięcie za pomocą tabulatorów",
  "Indent Using Spaces": "Wcięcie za pomocą spacji",
  "Detect Indentation from Content": "Wykryj wcięcia na podstawie zawartości",
  "Reindent Lines": "Ponowne wcięcie wierszy",
  "Reindent Selected Lines": "Ponowne wcięcie zaznaczonych wierszy",
  "Whether an inline suggestion is visible": "",
  "Whether the inline suggestion starts with whitespace": "",
  "Whether the inline suggestion starts with whitespace that is less than what would be inserted by tab": "",
  "Show Next Inline Suggestion": "",
  "Show Previous Inline Suggestion": "",
  "Trigger Inline Suggestion": "",
  "Next": "",
  "Previous": "",
  "Accept": "",
  "Suggestion:": "",
  "Replace with Previous Value": "Zamień na poprzednią wartość",
  "Replace with Next Value": "Zamień na następną wartość",
  "Expand Line Selection": "Rozwiń zaznaczenie linii",
  "Copy Line Up": "Kopiuj wiersz w górę",
  "&&Copy Line Up": "&&Kopiuj wiersz w górę",
  "Copy Line Down": "Kopiuj wiersz w dół",
  "Co&&py Line Down": "Ko&&piuj wiersz w dół",
  "Duplicate Selection": "Duplikuj zaznaczenie",
  "&&Duplicate Selection": "&&Duplikuj zaznaczenie",
  "Move Line Up": "Przenieś wiersz w górę",
  "Mo&&ve Line Up": "&&Przenieś wiersz w górę",
  "Move Line Down": "Przenieś wiersz w dół",
  "Move &&Line Down": "Przenieś &&wiersz w dół",
  "Sort Lines Ascending": "Sortuj wiersze rosnąco",
  "Sort Lines Descending": "Sortuj wiersze malejąco",
  "Delete Duplicate Lines": "Usuń zduplikowane wiersze",
  "Trim Trailing Whitespace": "Przytnij końcowy biały znak",
  "Delete Line": "Usuń wiersz",
  "Indent Line": "Wcięcie wiersza",
  "Outdent Line": "Zmniejsz wcięcie wiersza",
  "Insert Line Above": "Wstaw wiersz powyżej",
  "Insert Line Below": "Wstaw wiersz poniżej",
  "Delete All Left": "Usuń wszystko z lewej",
  "Delete All Right": "Usuń wszystko z prawej",
  "Join Lines": "Połącz wiersze",
  "Transpose characters around the cursor": "Transponuj znaki wokół kursora",
  "Transform to Uppercase": "Przekształć na wielkie litery",
  "Transform to Lowercase": "Przekształć na małe litery",
  "Transform to Title Case": "Przekształć do wielkości liter jak w nazwach własnych",
  "Transform to Snake Case": "Przekształć do pisowni z podkreśleniami zamiast spacji",
  "Start Linked Editing": "Rozpocznij edytowanie połączone",
  "Background color when the editor auto renames on type.": "Kolor tła, gdy edytor automatycznie zmienia nazwę na typ.",
  "Execute command": "Wykonaj polecenie",
  "Follow link": "Śledź link",
  "cmd + click": "cmd + kliknięcie",
  "ctrl + click": "ctrl + kliknięcie",
  "option + click": "option + kliknięcie",
  "alt + click": "alt i kliknięcie",
  "Execute command {0}": "Wykonaj polecenie {0}",
  "Failed to open this link because it is not well-formed: {0}": "Nie można otworzyć tego linku, ponieważ nie jest on poprawnie sformułowany: {0}",
  "Failed to open this link because its target is missing.": "Nie można otworzyć tego linku, ponieważ brakuje jego elementu docelowego.",
  "Open Link": "Otwórz link",
  "Cannot edit in read-only editor": "",
  "Whether the editor is currently showing an inline message": "Czy edytor aktualnie pokazuje komunikat osadzony",
  "Cursor added: {0}": "Dodano kursor: {0}",
  "Cursors added: {0}": "Dodane kursory: {0}",
  "Add Cursor Above": "Dodaj kursor powyżej",
  "&&Add Cursor Above": "&&Dodaj kursor powyżej",
  "Add Cursor Below": "Dodaj kursor poniżej",
  "A&&dd Cursor Below": "D&&odaj kursor poniżej",
  "Add Cursors to Line Ends": "Dodaj kursory do końców wierszy",
  "Add C&&ursors to Line Ends": "Dodaj &&kursory do końców wierszy",
  "Add Cursors To Bottom": "Dodaj kursory na dole",
  "Add Cursors To Top": "Dodaj kursory na górze",
  "Add Selection To Next Find Match": "Dodaj zaznaczenie do następnego znalezionego dopasowania",
  "Add &&Next Occurrence": "Dodaj &&następne wystąpienie",
  "Add Selection To Previous Find Match": "Dodaj zaznaczenie do poprzedniego dopasowania wyszukiwania",
  "Add P&&revious Occurrence": "Dodaj &&poprzednie wystąpienie",
  "Move Last Selection To Next Find Match": "Przenieś ostatnie zaznaczenie do następnego dopasowania wyszukiwania",
  "Move Last Selection To Previous Find Match": "Przenieś ostatnie zaznaczenie do poprzedniego dopasowania wyszukiwania",
  "Select All Occurrences of Find Match": "Zaznacz wszystkie wystąpienia znalezionego dopasowania",
  "Select All &&Occurrences": "Zaznacz wszystkie &&wystąpienia",
  "Change All Occurrences": "Zmień wszystkie wystąpienia",
  "Trigger Parameter Hints": "Wyzwól wskazówki dotyczące parametrów",
  "Icon for show next parameter hint.": "Ikona do pokazywania następnej wskazówki dotyczącą parametru.",
  "Icon for show previous parameter hint.": "Ikona do pokazywania poprzedniej wskazówki dotyczącej parametru.",
  "{0}, hint": "{0}, wskazówka",
  "Foreground color of the active item in the parameter hint.": "Kolor pierwszego planu aktywnego elementu w podpowiedzi parametru.",
  "Whether the current code editor is embedded inside peek": "Określa, czy bieżący edytor kodu jest osadzony w podglądzie",
  "Background color of the peek view title area.": "Kolor tła obszaru tytułu widoku wglądu.",
  "Color of the peek view title.": "Kolor tytułu widoku wglądu.",
  "Color of the peek view title info.": "Kolor informacji dotyczących tytułu widoku wglądu.",
  "Color of the peek view borders and arrow.": "Kolor obramowań i strzałki widoku wglądu.",
  "Background color of the peek view result list.": "Kolor tła listy wyników widoku wglądu.",
  "Foreground color for line nodes in the peek view result list.": "Kolor pierwszego planu węzłów wierszy na liście wyników widoku wglądu.",
  "Foreground color for file nodes in the peek view result list.": "Kolor pierwszego planu węzłów plików na liście wyników widoku wglądu.",
  "Background color of the selected entry in the peek view result list.": "Kolor tła zaznaczonego wpisu na liście wyników widoku wglądu.",
  "Foreground color of the selected entry in the peek view result list.": "Kolor pierwszego planu zaznaczonego wpisu na liście wyników widoku wglądu.",
  "Background color of the peek view editor.": "Kolor tła edytora widoku wglądu.",
  "Background color of the gutter in the peek view editor.": "Kolor tła marginesu w edytorze widoku wglądu.",
  "Match highlight color in the peek view result list.": "Dopasuj kolor wyróżnienia na liście wyników widoku wglądu.",
  "Match highlight color in the peek view editor.": "Dopasuj kolor wyróżnienia w edytorze widoku wglądu.",
  "Match highlight border in the peek view editor.": "Dopasuj obramowanie wyróżnienia w edytorze widoku wglądu.",
  "Open a text editor first to go to a line.": "Aby przejść do wiersza, najpierw otwórz edytor tekstu.",
  "Go to line {0} and character {1}.": "Przejdź do wiersza {0} i znaku {1}.",
  "Go to line {0}.": "Przejdź do wiersza {0}.",
  "Current Line: {0}, Character: {1}. Type a line number between 1 and {2} to navigate to.": "Bieżący wiersz: {0}, znak: {1}. Wpisz numer wiersza z zakresu od 1 do {2}, aby do niego przejść.",
  "Current Line: {0}, Character: {1}. Type a line number to navigate to.": "Bieżący wiersz: {0}, znak: {1}. Wpisz numer wiersza, aby do niego przejść.",
  "To go to a symbol, first open a text editor with symbol information.": "Aby przejść do symbolu, najpierw otwórz edytor tekstu z informacjami o symbolach.",
  "The active text editor does not provide symbol information.": "Aktywny edytor tekstu nie udostępnia informacji o symbolach.",
  "No matching editor symbols": "Brak pasujących symboli edytora",
  "No editor symbols": "Brak symboli edytora",
  "Open to the Side": "Otwórz z boku",
  "Open to the Bottom": "Otwórz na dole",
  "symbols ({0})": "symbole ({0})",
  "properties ({0})": "właściwości ({0})",
  "methods ({0})": "metody ({0})",
  "functions ({0})": "funkcje ({0})",
  "constructors ({0})": "konstruktory ({0})",
  "variables ({0})": "zmienne ({0})",
  "classes ({0})": "klasy ({0})",
  "structs ({0})": "struktury ({0})",
  "events ({0})": "zdarzenia ({0})",
  "operators ({0})": "operatory ({0})",
  "interfaces ({0})": "interfejsy ({0})",
  "namespaces ({0})": "przestrzenie nazw ({0})",
  "packages ({0})": "pakiety ({0})",
  "type parameters ({0})": "parametry typu ({0})",
  "modules ({0})": "moduły ({0})",
  "enumerations ({0})": "wyliczenia ({0})",
  "enumeration members ({0})": "elementy członkowskie wyliczenia ({0})",
  "strings ({0})": "ciągi ({0})",
  "files ({0})": "pliki ({0})",
  "arrays ({0})": "tablice ({0})",
  "numbers ({0})": "liczby ({0})",
  "booleans ({0})": "wartości logiczne ({0})",
  "objects ({0})": "obiekty ({0})",
  "keys ({0})": "klucze ({0})",
  "fields ({0})": "pola ({0})",
  "constants ({0})": "stałe ({0})",
  "No result.": "Brak wyniku.",
  "An unknown error occurred while resolving rename location": "Wystąpił nieznany błąd podczas rozpoznawania lokalizacji zmiany nazwy",
  "Renaming '{0}'": "Zmienianie nazwy z „{0}” na „{1}”",
  "Renaming {0}": "Zmienianie nazwy z „{0}” na „{1}”",
  "Successfully renamed '{0}' to '{1}'. Summary: {2}": "Pomyślnie zmieniono nazwę elementu „{0}” na „{1}”. Podsumowanie: {2}",
  "Rename failed to apply edits": "Zmiana nazwy nie może zastosować edycji",
  "Rename failed to compute edits": "Zmiana nazwy nie może obliczyć edycji",
  "Rename Symbol": "Zmień nazwę symbolu",
  "Enable/disable the ability to preview changes before renaming": "Włącz/wyłącz możliwość wyświetlania podglądu zmian przed zmianą nazwy",
  "Whether the rename input widget is visible": "",
  "Rename input. Type new name and press Enter to commit.": "",
  "{0} to Rename, {1} to Preview": "",
  "Expand Selection": "Rozwiń zaznaczenie",
  "&&Expand Selection": "&&Rozwiń zaznaczenie",
  "Shrink Selection": "Zmniejsz zaznaczenie",
  "&&Shrink Selection": "&&Zmniejsz zaznaczenie",
  "Whether the editor in current in snippet mode": "Określa, czy edytor jest bieżący w trybie fragmentów kodu",
  "Whether there is a next tab stop when in snippet mode": "Określa, czy w trybie fragmentów kodu jest dostępny następny tabulator",
  "Whether there is a previous tab stop when in snippet mode": "Określa, czy w trybie fragmentów kodu jest dostępny poprzedni tabulator",
  "Sunday": "Niedziela",
  "Monday": "Poniedziałek",
  "Tuesday": "Wtorek",
  "Wednesday": "Środa",
  "Thursday": "Czwartek",
  "Friday": "Piątek",
  "Saturday": "Sobota",
  "Sun": "Nie",
  "Mon": "Pon",
  "Tue": "Wto",
  "Wed": "Śro",
  "Thu": "Czw",
  "Fri": "Pt",
  "Sat": "Sob",
  "January": "Styczeń",
  "February": "Luty",
  "March": "Marzec",
  "April": "Kwiecień",
  "May": "Maj",
  "June": "Czerwiec",
  "July": "Lipiec",
  "August": "Sierpień",
  "September": "Wrzesień",
  "October": "Październik",
  "November": "Listopad",
  "December": "Grudzień",
  "Jan": "Sty",
  "Feb": "Lut",
  "Mar": "Mar",
  "Apr": "Kwi",
  "Jun": "Cze",
  "Jul": "Lip",
  "Aug": "Sie",
  "Sep": "Wrz",
  "Oct": "Paź",
  "Nov": "Lis",
  "Dec": "Gru",
  "Whether suggestion are visible": "",
  "Whether suggestion details are visible": "Określa, czy szczegóły sugestii są widoczne",
  "Whether there are multiple suggestions to pick from": "Określa, czy jest dostępnych wiele sugestii do wyboru",
  "Whether inserting the current suggestion yields in a change or has everything already been typed": "Określa, czy wstawienie bieżącej sugestii jest tymczasowo wstrzymywane w zmianie, czy wszystko zostało już wpisane",
  "Whether suggestions are inserted when pressing Enter": "Określa, czy sugestie są wstawiane po naciśnięciu klawisza Enter",
  "Whether the current suggestion has insert and replace behaviour": "Określa, czy bieżąca sugestia ma zachowanie wstawiania i zamiany",
  "Whether the default behaviour is to insert or replace": "Określa, czy domyślne zachowanie to wstawienie, czy zamiana",
  "Whether the current suggestion supports to resolve further details": "Określa, czy bieżąca sugestia obsługuje rozpoznawanie dalszych szczegółów",
  "Accepting '{0}' made {1} additional edits": "Zaakceptowanie elementu „{0}” spowodowało powstanie {1} nowych edycji",
  "Trigger Suggest": "Wyzwól sugestie",
  "Insert": "Wstaw",
  "show less": "Pokaż mniej",
  "show more": "Pokaż więcej",
  "Reset Suggest Widget Size": "Resetuj rozmiar widżetu sugestii",
  "Background color of the suggest widget.": "Kolor tła widżetu sugestii.",
  "Border color of the suggest widget.": "Kolor obramowania widżetu sugestii.",
  "Foreground color of the suggest widget.": "Kolor pierwszego planu widżetu sugestii.",
  "Foreground color of the selected entry in the suggest widget.": "Kolor pierwszego planu wybranego wpisu w widżecie sugestii.",
  "Icon foreground color of the selected entry in the suggest widget.": "Kolor pierwszego planu ikony wybranego wpisu w widżecie sugestii.",
  "Background color of the selected entry in the suggest widget.": "Kolor tła zaznaczonego wpisu w widżecie sugestii.",
  "Color of the match highlights in the suggest widget.": "Kolor wyróżnień dopasowania w widżecie sugestii.",
  "Color of the match highlights in the suggest widget when an item is focused.": "Kolor wyróżnień dopasowania w widżecie sugestii, gdy element ma fokus.",
  "Foreground color of the suggest widget status.": "Kolor pierwszego planu stanu widżetu sugestii.",
  "Suggest": "Sugeruj",
  "{0}{1}, {2}": "{0} {1}, {2}",
  "{0}{1}": "{0} {1}",
  "{0}, docs: {1}": "{0}, dokumentacja: {1}",
  "No suggestions.": "Brak sugestii.",
  "Icon for more information in the suggest widget.": "Ikona do uzyskiwania dodatkowych informacji w widżecie sugestii.",
  "Read More": "Przeczytaj więcej",
  "The foreground color for array symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli tablic. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for boolean symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli wartości logicznych. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for class symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli klas. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for color symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli koloru. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for constant symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli stałych. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for constructor symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli konstruktora. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for enumerator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli modułu wyliczającego. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for enumerator member symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli elementów członkowskich modułu wyliczającego. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for event symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli zdarzeń. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for field symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu symboli pól. Te symbole pojawiają się w konspekcie, linku do strony nadrzędnej i widgecie sugestii.",
  "The foreground color for file symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli plików. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for folder symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli folderów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for function symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli funkcji. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for interface symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli interfejsu. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for key symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli kluczy. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for keyword symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli słów kluczowych. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for method symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli metod. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for module symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli modułów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for namespace symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli przestrzeni nazw. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for null symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli wartości null. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for number symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli liczb. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for object symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli obiektów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for operator symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli operatorów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for package symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli pakietów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for property symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli właściwości. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for reference symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli referencji. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for snippet symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli fragmentów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for string symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli ciągów. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for struct symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli struktur. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for text symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli tekstu. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for type parameter symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli parametrów typu. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for unit symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli jednostek. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "The foreground color for variable symbols. These symbols appear in the outline, breadcrumb, and suggest widget.": "Kolor pierwszego planu dla symboli zmiennych. Te symbole pojawiają się w konspekcie, nawigacji i widżecie sugestii.",
  "Toggle Tab Key Moves Focus": "Przełącz przenoszenie fokusu za pomocą klawisza Tab",
  "Pressing Tab will now move focus to the next focusable element": "Naciśnięcie klawisza Tab spowoduje przeniesienie fokusu do następnego elementu, do którego można przenieść fokus",
  "Pressing Tab will now insert the tab character": "Naciśnięcie klawisza Tab spowoduje teraz wstawienie znaku tabulacji",
  "Developer: Force Retokenize": "Deweloper: wymuś ponowną tokenizację",
  "Icon shown with a warning message in the extensions editor.": "Ikona wyświetlana z komunikatem ostrzeżenia w edytorze rozszerzeń.",
  "This document contains many non-basic ASCII unicode characters": "Ten dokument zawiera wiele niepodstawowych znaków ASCII unicode",
  "This document contains many ambiguous unicode characters": "Ten dokument zawiera wiele niejednoznacznych znaków Unicode",
  "This document contains many invisible unicode characters": "Ten dokument zawiera wiele niewidocznych znaków Unicode",
  "The character {0} could be confused with the character {1}, which is more common in source code.": "Znak {0} można pomylić ze znakiem {1}, co jest częstsze w kodzie źródłowym.",
  "The character {0} is invisible.": "Znak {0} jest niewidoczny.",
  "The character {0} is not a basic ASCII character.": "Znak {0} nie jest podstawowym znakiem ASCII.",
  "Adjust settings": "Dostosuj ustawienia",
  "Disable highlighting of characters in comments": "Wyłącz wyróżnianie znaków w komentarzach",
  "Disable Highlight In Comments": "Wyłącz wyróżnianie w komentarzach",
  "Disable highlighting of characters in strings": "Wyłącz wyróżnianie znaków w ciągach",
  "Disable Highlight In Strings": "Wyłącz wyróżnianie w ciągach",
  "Disable highlighting of ambiguous characters": "Wyłącz wyróżnianie niejednoznacznych znaków",
  "Disable Ambiguous Highlight": "Wyłącz niejednoznaczne wyróżnienie",
  "Disable highlighting of invisible characters": "Wyłącz wyróżnianie niewidocznych znaków",
  "Disable Invisible Highlight": "Wyłącz niewidoczne wyróżnienie",
  "Disable highlighting of non basic ASCII characters": "Wyłącz wyróżnianie znaków ASCII innych niż podstawowe",
  "Disable Non ASCII Highlight": "Wyłącz wyróżnienie inne niż ASCII",
  "Show Exclude Options": "Pokaż opcje wykluczania",
  "Exclude {0} (invisible character) from being highlighted": "Wyklucz {0} (niewidoczny znak) z wyróżnienia",
  "Exclude {0} from being highlighted": "Wyklucz {0} z wyróżnienia",
  "Allow unicode characters that are more common in the language \"{0}\".": "Zezwalaj na znaki Unicode, które są bardziej typowe w języku „{0}\".",
  "Configure Unicode Highlight Options": "Konfiguruj opcje wyróżniania Unicode",
  "Unusual Line Terminators": "Nietypowe elementy końcowe wiersza",
  "Detected unusual line terminators": "Wykryto nietypowe elementy końcowe wiersza",
  "The file '{0}' contains one or more unusual line terminator characters, like Line Separator (LS) or Paragraph Separator (PS).\n\nIt is recommended to remove them from the file. This can be configured via `editor.unusualLineTerminators`.": "Plik „{0}” zawiera co najmniej jeden nietypowy element końcowy wiersza, taki jak separator wierszy (LS) lub separator akapitów (PS).\r\n\r\nZaleca się usunięcie ich z pliku. Można to skonfigurować za pomocą elementu „editor.unusualLineTerminators”.",
  "Remove Unusual Line Terminators": "&&Usuń nietypowe elementy końcowe wiersza",
  "Ignore": "Ignoruj",
  "Background color of a symbol during read-access, like reading a variable. The color must not be opaque so as not to hide underlying decorations.": "",
  "Background color of a symbol during write-access, like writing to a variable. The color must not be opaque so as not to hide underlying decorations.": "",
  "Border color of a symbol during read-access, like reading a variable.": "",
  "Border color of a symbol during write-access, like writing to a variable.": "",
  "Overview ruler marker color for symbol highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Overview ruler marker color for write-access symbol highlights. The color must not be opaque so as not to hide underlying decorations.": "",
  "Go to Next Symbol Highlight": "Przejdź do następnego wyróżnienia symbolu",
  "Go to Previous Symbol Highlight": "Przejdź do poprzedniego wyróżnienia symbolu",
  "Trigger Symbol Highlight": "Wyzwól wyróżnienie symbolu",
  "Delete Word": "Usuń słowo",
  "Click to show {0} definitions.": "Kliknij, aby wyświetlić definicje ({0}).",
  "Whether reference peek is visible, like 'Peek References' or 'Peek Definition'": "Określa, czy jest widoczny podgląd odwołań, na przykład „Podejrzyj odwołania” lub „Podejrzyj definicję”",
  "{0} references": "odwołania: {0}",
  "{0} reference": "{0} odwołanie",
  "no preview available": "podgląd niedostępny"
}